{
    "info": {
        "ws_name": "Royal Brackla 21-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Royal Brackla",
        "ws_age": 21,
        "ws_abv": 46.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/1/8/5644/335889-normal.png",
        "ws_rating": 88.19,
        "ws_vote_cnt": 179,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/185644/royal-brackla-21-year-old"
    },
    "collected_count": 29,
    "reviews": [
        {
            "user_name": "lincolnimp",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "04 oct 2021 2:28 pm",
            "content": "Royal Brackla is one of those distilleries that people overlook in favour of the more well known ones which is a shame as they can produce nice whisky as this latest 21 years bottling proves.No notes tasted at a show.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "13 oct 2023 9:20 pm",
            "content": "Golden color. Slight oiliness.",
            "nose": "Smooth. A mass of orange fruit, in marinade. Apricots. Peaches. Orange peel. Red apples. Apple seeds. Cinnamon.",
            "taste": "Red apples. Cinnamon. Spices. Caramel. Toffee. Black pepper. Slight oiliness.",
            "finish": "Apples. Slightly smokey. Traces of ash. Caramel. Toffee. Oakwood. Carbonized oak. Medium length finish."
        },
        {
            "user_name": "dRambo",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "05 aug 2023 11:29 pm",
            "content": "Nobly bitter sweet and sour sherry profile, not quite modern, nutty, musty, dusty, malty, peppery, almost no hint of smoke - delicious but no better than an allardice",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Tom na Gruagaich",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "16 jul 2025 5:21 pm",
            "content": "The nose is top-notch, the rest is OK. A solid standard, a nice older sipper, not a world-shattering sipper.",
            "nose": "sweet and malty, sherry, a little orange, old-fashioned",
            "taste": "Quite crisp and spicy, lots of wood, bitter malty.",
            "finish": "Tart, herbs, slightly perfumed, citrus and oak."
        },
        {
            "user_name": "DistiLesha",
            "user_rank": "Connoisseur",
            "rating": "90",
            "review_date": "26 aug 2024 9:15 pm",
            "content": "An explosive whisky that not only lifts your spirits, but also creates a festive atmosphere in a glass! I wouldn't say it's a dry whisky, but rather the Palo Cortado casks seem to have been added to curb the wildness of the sweet Pedro Ximenez! 23 23 22 22",
            "nose": "Lots of malt, mango and banana. Simply divine aroma! And the mango here is of a specific variety, Joleb, which overripens to the state of delicious jam! The second part is wine - dried fruits, dry wine, a bit of cellar mustiness, champagne carbonation, wood, mothballs. Tobacco notes play briskly in the empty glass. Intensity: 8/10",
            "taste": "Dense and thick body with a dry, vinous backbone and malty filling. The same overripe mango, raisins, port wine, ginger slice. There is a lot of dryness not only from the wine notes, but also from the oak of the barrel. Tropical fruits become even more vibrant when exposed to air! Saturation: 9/10 Sweetness: 7/10",
            "finish": "Dry oak board, powerful ginger blast, dry wine, residual fruity touches."
        },
        {
            "user_name": "MrGlenfarclas",
            "user_rank": "Connoisseur",
            "rating": "89",
            "review_date": "20 jan 2023 7:15 pm",
            "content": "Wonderful nose. Sweet and sour. Spicy. Clearly sherry, but not to the point that it overwhelms everything else. Wonderfully integrated. Fruity but amazingly fresh fruit for 21 years. The wood comes through. Christmas spices. Also a meaty umami note. No misses. First sherry on the tongue. Slightly sweet, slightly sulphurous. But then it quickly turns into a clearly bitter oak note. Very spicy. Fleshy. Nut. Dark chocolate. Leather. Good alcohol strength, but could do with two or three more turns. Only in the finish does it fall off a bit now. It's relatively short. Dry. malty. Hmm, difficult. Really, really like it. Only the finish is disappointing. And 220€ round about...heavy. I'm still tempted to put a bottle on the shelf. A really nice, old school whisky. deep, complex. Not overloaded. Nice.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "BehindSpace",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "21 may 2023 8:46 am",
            "content": "One thing in advance: strange whisky. The key data sounded good. New version with 46%, sherry influence expected, etc. Bought on special offer in March and not at the normal price of over 200€. Even after two months of testing again and again I will not be 100% warm with the malt. Very little comes out of the glass at first. A little air in the bottle helps noticeably. Heat on the glass too. The nose starts off sherry-heavy and spicy, but then switches again and again to the (clearly) sour and very light fruity. Everything \"dark\" is very subtle to barely perceptible overall. The first sip confirms the nose. Very spicy, again and again lightly sour. Oak and bitter notes. You notice the age of the whisky - but I know these sour, immature notes from rather young whiskys. Maybe it was a short finish from not-so-active casks?? Why do you use three different types of sherry for finishing??? This may cause extra restlessness or little definition in the existing nuances. The whisky isn't bad per se, but it doesn't quite meet my personal taste. It's not worth the asking price to me. Especially not the normal price of ü200. For the money you can also grab a GF25. Here you also get a rather subtle sherry-heavy, but oak-heavy malt. It's been a long time since my last GF 25, I had something perfumed, floral there which ended up making it more interesting than this one. I realize again for myself that I don't like (short) finishes. I would have liked to try this Brackla before all the finishes. In the end, my points may be a bit too hard - it's subjective. /edit After extensive testing, I like it best with (some) water. I rarely if ever have that with whisky at 46%.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "sphinx",
            "user_rank": "Connoisseur",
            "rating": "89",
            "review_date": "28 dec 2021 4:15 pm",
            "content": "Maca**** 18yo Affordable Alternative Parallel to 25 cws 54%, 25 is good 91",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Crushed_ldH",
            "user_rank": "Connoisseur",
            "rating": "89",
            "review_date": "18 mar 2025 6:12 am",
            "content": "It is said to be a triple sherry finish, and it seems that the influence of Palo Cortado cask is stronger than the other two casks. Furthermore, the result was that rather than being ambiguous or bland, it has a fruity explosion of aroma and taste. The nose is the best part for me, and the taste has unexpectable waxiness, which was very interesting.",
            "nose": "Apricot jam, purple plum, lychee, lemon oil, peach, tangerine, yellow flower garden. Very sweet and fruity",
            "taste": "Dried plum, grape juice, lemon oil, tangerine peel, black tea, dry oak, slightly waxy",
            "finish": "Raisins, dry oak, pepper, almond powder, vanilla, meadow. The finish is rather hot considering its age"
        },
        {
            "user_name": "WhiskyBjorn83",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "20 sep 2025 4:49 pm",
            "content": "07-09-2025",
            "nose": "sherry",
            "taste": "sherry, red fruit",
            "finish": "sherry, red fruit, pepper"
        },
        {
            "user_name": "KIMCHIBaby",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "22 mar 2025 5:13 pm",
            "content": "Well-made 21 Year Old, and it gets heavier as it goes.This whisky offers two contrasting faces—its nose is bright and lively, while the finish is darker and heavier.It feels like discovering different sides of a person in real time.A tasty dram with layers of character, making it as enjoyable as it is intriguing.",
            "nose": "Green Apple, Lemon, Honey, Berries, Strawberry, Whipped Cream, Chocolate, Nutty \"Vibrant Fruits & Strawberry Shortcake\"Fresh green apple fruitiness and zesty lemon citrus open things up brightly.Then comes the richness—thick honey sweetness paired with tart-sweet berries and strawberries.The creamy, sweet note of whipped cream makes it feel like a strawberry shortcake in a glass.There’s also a subtle nutty undertone and a hint of chocolate that adds extra depth and rounds out the aroma beautifully.",
            "taste": "Berries, Nutty, Chalky, Chocolate, Apple, Woody \"Slightly Heavier, But Still Vibrant with Berries\"Compared to the nose, the palate feels more settled and weighty.The berries lean more toward sweetness rather than tartness, while nutty and chocolate notes take on a stronger role.Green apple acidity and a woody backbone provide structure.The influence of Oloroso sherry casks is clear here, bringing extra depth and complexity.",
            "finish": "Chestnut, Nutty, Apple, Lemon, Woody \"It Gets Heavier as It Goes\"The finish highlights chestnut-like dryness and nuttiness upfront.Dark chocolate and heavy woody notes roll in slowly, adding layers of richness.There’s still a faint trace of apple and lemon citrus lingering, but they stay subtle, behind the earthier elements.It’s fascinating how the finish shifts from bright and lively to dense and somber."
        },
        {
            "user_name": "KIMCHIBaby",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "01 mar 2025 4:20 am",
            "content": "Slightly nutty with a yogurt-like tang.Strong berry notes, setting it apart from typical sherry-aged whiskies.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "huangshantong",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "26 jul 2022 11:23 am",
            "content": "At one stage it was extremely cheap. But I still feel that underestimated price and overestimated quality exist. Objectively speaking, it will be a good ration, but that's all, it still has a gap from many excellent works. Even at the same price point, it's not a standout. Don't pay for the guidance of people with ulterior motives against their will.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "leejseo",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "25 nov 2023 5:54 pm",
            "content": "Not satisfied when opened a bottle and tried a glass of it. However, after contacting with airs for a significant amount of time, I was able to fully enjoy this whisky. Nice nose and flavour.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "manspear",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "02 aug 2024 1:21 pm",
            "content": "Nicely made sherry cask matured whisky. No alcohol boose kicks even recently opened.Different taste layer exist since several casks finished spirits.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Raistlinmejere",
            "user_rank": "Expert Senior",
            "rating": "89",
            "review_date": "13 jun 2025 5:07 pm",
            "content": "A very comfortable drink. The influence of the sherry cask is obvious, and the flavor of this cask is also very clear. It is not stressful to drink, but it is not very exciting. You can drink it all the time. It is currently more cost-effective in mainland China. Rating reference price: RMB1100",
            "nose": "There is almost no alcohol. The aroma is very diverse, with sweet and sour half-ripe berries, cool herbs, dried spices and herbal tea, as well as obvious sourness of fresh wood and a small amount of sugar-roasted nuts, and under all this, there are obvious sweet and sour half-ripe citrus, plums and apples. The aroma is not closed, but complex and the expression is relatively gentle.",
            "taste": "The alcohol is well suppressed. The main note is a combination of fresh sweet and sour berry juice and half-ripe temperate yellow fruit juice. In the middle and back, there are very obvious sweet mandarin and orange with skin, as well as some spices from oak and a little spiciness. The structure is medium in complexity and still very gentle and coordinated.",
            "finish": "The first part is obvious sugar-free nuts, dry orange peel, fresh branches and stems, and the tannins are obvious. There is a small amount of non-salty smoke and spices from oak in the middle and back. Overall, the finish is still too dry."
        },
        {
            "user_name": "anter",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "17 mar 2025 12:16 am",
            "content": "The whisky is beautiful and interesting, but in terms of price-performance, it's outpaced by the 18-year and 12-year expressions. Despite everything, it has a unique character. It left me with the impression that everything wasn't quite right, that it wasn't fully integrated, but it's certainly not a bad whisky. Price performance: Medium Would I buy it again?: I don't think so.",
            "nose": "A sharp nose. Quite nutty; nuts: walnuts, lightly roasted hazelnuts, and shelled cashews. The aroma is subtle here again. Grilled, perhaps slightly charred pineapple. Young banana. A greenish edge, almost grassy. The alcohol hasn't fully integrated. It needs time to open up. Over time, the fruitiness unfurls, and pear and apple join in. Palo cortado is at the forefront. Light grape and mulberry molasses is at the back. Sauternes-like, honeyed yellow fruits. It evolves over time; complex, but not the most refined or smooth nose.",
            "taste": "Quite intense on the palate. A slight Sauternes funk with honeyed crackers on the malty side. Pineapple is very evident. Bananas of varying ripeness, esters, and red apples beginning to oxidize. The alcohol doesn't seem to have fully integrated, but it's not at a disturbing level either. Above-medium sweetness. Peach juice. Gray black pepper. Good.",
            "finish": "A little sharper than the 18 and 12, surprisingly. Still estery and fruity. A slight acidity is felt here. Malic acid, like in green apples. Still yellow fruit. A very light barrel ash. Perhaps a slightly butyric side. It's quite long."
        },
        {
            "user_name": "DavionS",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "18 feb 2025 12:57 pm",
            "content": "",
            "nose": "Peanut candy, popcorn, spices, a little dried fruit, some roasted meat",
            "taste": "The body is nice and sweet, pepper, peanut candy, cream, caramel, bourbon dominates, and the varnish wood spice comes out in the back, plus some apple slices.",
            "finish": "Varnish is evident, wood, almond milk, spice, apple, caramel, pepper."
        },
        {
            "user_name": "Whiskyisfordrinking",
            "user_rank": "Expert Senior",
            "rating": null,
            "review_date": "24 feb 2023 10:57 am",
            "content": "N: sweetish, dark notes, leather, Christmas cake with raisins. G: on entry you notice the PX barrels, raisin-like, oily, light oak, creamy, light citrus fruit, light smoked notes at the end. A: round, mild, warm and soft, very pleasing. Diverse and very successful.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "GlasMost",
            "user_rank": "Expert Senior",
            "rating": "90",
            "review_date": "17 oct 2024 3:10 pm",
            "content": "One of my favorite 21 standards without cask strength. Not a real sherry bomb like the GD Parliament. Neither too dry or too sweet. Perfect balance. Dangerously drinkable. Never boring. Very complex, smooth, tropical fruits too.I love palo cortado finishes.The stopper is super heavy.This at a higher ABV would be heaven!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "SliverFox",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "17 jul 2022 10:01 am",
            "content": "underrated distillery",
            "nose": "fresh fruit, dried mushroom, honey , grape peel",
            "taste": "Fruity goodness for a corerange this is damn good.",
            "finish": "not much going on hereclean some nut and fruit.good stuffdon't over look this distillery"
        },
        {
            "user_name": "Qiefangbai",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "13 dec 2025 6:02 pm",
            "content": "High quality, good price",
            "nose": "Very straightforward spices (even somewhat like flavored gin), nuts, hawthorn, minerals; after resting for a while, the nutty flavors begin to lean towards creamy walnut and hazelnut.",
            "taste": "Syrup (not long-lasting), turns into citrus juice after a while, used in stewed fruit, maltose",
            "finish": "Dried apples, minerals, hazelnut chocolate"
        },
        {
            "user_name": "RamiW",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "31 may 2025 11:57 pm",
            "content": "Thanks for WhiskyLab for the sample. I had high hopes for this one and it did not disappoint. Refined, balanced, soft whisky that shows age and bears it well. I’ve had mostly younger -often CS- stuff lately and this is a welcome variation to that theme. This is one of the few times I like the ABV not being too high, I feel like this isn't meant to be punchy or too 'out there'. What else can I say; would recommend, and would obviously not mind a full bottle.",
            "nose": "Clear European oak, with spices - cinnamon, cloves, allspice. Raisins, dates, a little bit of chocolate, but also citrus, orange and other sour fruity notes. Some roasted malty notes in the background. Although I get many of these notes in a lot of other (younger) sherried whiskies, the are more balanced, subtle and integrated than usual. If I were to sum op the nose for this one in a single word, it’s ‘refined’.",
            "taste": "Not what I expected. Very soft, fruity, elegant. Very light spices, roasty malt, orange zest, dried fruits and a touch of cocoa.",
            "finish": "Medium finish, clean fruity zesty notes linger for a bit."
        },
        {
            "user_name": "djmaxliving",
            "user_rank": "Expert Junior",
            "rating": "85",
            "review_date": "15 mar 2024 12:00 am",
            "content": "I think on the nose it needs 48% rather than at 46% to help carry it, maybe even more.When I first tried this, it was very good to excellent. But having left it quite a while, I'm left disappointed, they're plenty of better 21 year old offerings out there.Out of the core range the 12 year old is the one I would recommend.",
            "nose": "Refined matured classic sherry nose, baked fruits, sherbet, melon, light spices, red apples and herbs in the background.",
            "taste": "Mentol, green herbs, spicy, woody.",
            "finish": "Again oaky and spicy, with a medium to long finish."
        },
        {
            "user_name": "xbxm1996",
            "user_rank": "Expert Junior",
            "rating": "89",
            "review_date": "21 jul 2025 11:15 am",
            "content": "",
            "nose": "Orange peel, jam, almonds, toffee, spices, a little tobacco",
            "taste": "Dried fruit and nuts then evolve into spices, fresh oranges and chocolate with a hint of tobacco. The alcohol is well hidden but the intensity is average. The body is quite balanced.",
            "finish": "Short and watery finish, cinnamon, nuts and marmalade"
        },
        {
            "user_name": "Benjamin_Wang",
            "user_rank": "Expert Junior",
            "rating": "86",
            "review_date": "13 nov 2022 8:48 am",
            "content": "Very weak on the nose, but it has a full mouthfeel, full body sweetness, and some cinnamon, clove, and syrup, maybe a little too soft. Good but no fancy. Considering the price, it is definitely a NO BUYING.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Tomate182",
            "user_rank": "Expert Junior",
            "rating": "89",
            "review_date": "20 jul 2025 9:53 pm",
            "content": "Absolutely delicious ???? The nose and the taste are absolutely consistent.",
            "nose": "Chocolate, vanilla, nut, red fruit (strawberry very dominant, grape",
            "taste": "Nut, chocolate, pepper, wood, slightly tingling on the tongue and honey and dried fruits (in the direction of grape or plum)",
            "finish": "Wood, chocolate, nut, slightly bitter, tingling in the mouth."
        },
        {
            "user_name": "Tyler_Valdal",
            "user_rank": "Member Junior",
            "rating": "88",
            "review_date": "17 aug 2025 3:08 pm",
            "content": "One of the best 21-year-old scotches on the market. Notes of dark fruits, ripe plum, and dark chocolate dominate. Very approachable and sticks to your mouth.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "mshenk617",
            "user_rank": "Newbie",
            "rating": "91",
            "review_date": "20 aug 2022 8:58 pm",
            "content": "Nose: Beautiful malt notes, then caramel, dark toffee, dark plums/cherry, poached pears with a nice citrus/orange note.Taste: stewed fruits (pears, apples), great coffee, choc notes, oak present, nice hit of spice on finish. Give this time in the glass and you will be rewarded. Big, rich, great balance between sweet and savory notes. Highly recommend!",
            "nose": "",
            "taste": "",
            "finish": ""
        }
    ]
}