{
    "info": {
        "ws_name": "Macallan 12-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Macallan",
        "ws_age": 12,
        "ws_abv": 40.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/1/1/3049/187234-normal.png",
        "ws_rating": 84.36,
        "ws_vote_cnt": 947,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/113049/macallan-12-year-old"
    },
    "collected_count": 22,
    "reviews": [
        {
            "user_name": "Tauti",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "07 jun 2018 7:15 pm",
            "content": "What does \"Sherry seasoned oak cask from Jerez\" mean?1. Bring your cask to Jerez, Spain (it doesn't even have to be an ex-sherry cask)2. Fill cask with sherry3. Empty casks a couple of hours later (and let a little bit of sherry inside, accidently of course)4. Fill the same sherry into another cask, repeat5. Bring mentioned casks to Scotland6. Fill it with Macallan spirit7. Sell it and tell customers they're buying \"kinda\" sherry cask matured Macallan. GREAT DEAL!Well, am I close?",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Andytka3",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "01 mar 2019 5:24 am",
            "content": "N- Roasted coffee, cocoa and ripe fruits notes, enticing for a 12YO with nice casks in the vat. Some PX probably, for the sugar coated dried fruits and indian candy. Simply delicious, bright with plenty of zest, peaches, dried flower and buddha fruit nuances. Even some not so 'Macallan' farm-y notes too. Good body at 40%. (88/22)P- Velvet mouthfeel, superbly ripe for a 12YO expression. Prunes, figs sweetness balanced with a tinge of bitter coffee. (90/22)F- Medium-long, gentle but full, may not with much depth but deliciously sweet as a after dinner dram. (87/21)B/B- 91/22Cereal- 2, Fruity- 2, Floral- 2, Peaty- 0, Feinty- 0, Sulphur- 0, Woody- 2, Winery- 3Weighted Rate- 87pt",
            "nose": "N- Roasted coffee, cocoa and ripe fruits notes, enticing for a 12YO with nice casks in the vat. Some PX probably, for the sugar coated dried fruits and indian candy. Simply delicious, bright with plenty of zest, peaches, dried flower and buddha fruit nuances. Even some not so 'Macallan' farm-y notes too. Good body at 40%. (88/22)",
            "taste": "P- Velvet mouthfeel, superbly ripe for a 12YO expression. Prunes, figs sweetness balanced with a tinge of bitter coffee. (90/22)",
            "finish": "F- Medium-long, gentle but full, may not with much depth but deliciously sweet as a after dinner dram. (87/21)B/B- 91/22Cereal- 2, Fruity- 2, Floral- 2, Peaty- 0, Feinty- 0, Sulphur- 0, Woody- 2, Winery- 3Weighted Rate- 87pt"
        },
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "12 oct 2021 12:04 pm",
            "content": "",
            "nose": "Sherry Oloroso. Sweet skins, hazelnuts. Dried fruits. A less sweet variety of raisins. Then a little spice comes in somewhere. A pinch of cinnamon. The second time, notes of sweet perfume.",
            "taste": "Sweetness, gentleness, lightness. Delicate Sherry Oloroso. After a while, spices and cinnamon come in, but in a nice and non-alcoholic way. Sweetness again. Notes of vanilla and caramel. Sweet dried fruit, raisins. Definitely sweeter than The Macallan 12 YO Double Oak.",
            "finish": "Sweetness. Caramel. Lots of hazelnuts. Dried fruits. Dark chocolate. A bit astringent. Like the language - sweeter than in The Macallan 12 YO Double Oak. Medium-long."
        },
        {
            "user_name": "DistiLesha",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "10 nov 2021 9:28 pm",
            "content": "seasoned casks. There is some kind of standardization and predictability here. This Macallan clearly does not need water, since it is so highly diluted. Aroma and aftertaste clearly outperform taste, they are more sophisticated and complex. But the taste is weaker and watery. 46% would clearly benefit from this whisky. On the other hand, a well thought out and affordable consumer release. But if you ask me why a 12-year-old Dalmore costs 2 times more, then I will answer you that the barrels in it are not seasoned with Oloroso sherry. Although the blend is not even 100% sherry, even there the whisky looks richer, more concentrated and intense in taste, and at the same strength. N: 22 T: 20 F: 21 B: 20",
            "nose": "1st nose beats sharply with alcohols. If the blending master wanted to hide them, it would be like hiding an elephant behind a 12-year-old oak tree. Then the alcohols melt and a Spanish boy comes from the town of Jerez de La Frontera. He brings us raisins, vanilla, spices, cream, citrus fruits, chocolate and a handful of malt in a large basket. But in sherry barrels there is always sulfur content, if it is not removed, and it is clearly audible here.",
            "taste": "The first thing that rushes is the wateriness and weakness of intensity, then I catch the same raisins, prunes, vanilla, cream, lemon sourness, oak bitterness, figs, chocolate. Decanting? Bees arrive and bring propolis with honey, the level of sweetness increases to 7 out of 10.",
            "finish": "Round, mildly astringent with tannins, dry and raisin."
        },
        {
            "user_name": "nallacam",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "02 may 2019 8:25 pm",
            "content": "For me, 85 points for an unmistakable 12-year-old Macallan.",
            "nose": "Full sherry freight, albeit unnaturally strong.  Dark fruits, light muffle, raspberry, dark caramel",
            "taste": "There are no percentages, no chance to transport the flavors.",
            "finish": "Significant wood influence, slight bitterness, but pleasant, a little carnation ..... for me a classic Macallan finish."
        },
        {
            "user_name": "Expraesi",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "28 dec 2018 9:32 pm",
            "content": "",
            "nose": "Intense nose, though only 40%. Sherry dominates. Some honey and also spicy notes.",
            "taste": "Soft and creamy. Sweet and fruity.",
            "finish": "Long. Sherry sweetness, spiciness, some chocolate. Warming."
        },
        {
            "user_name": "Max70",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "05 feb 2020 9:08 am",
            "content": "Quite disappointing at the beginning, very closed and with a weak nose. After adding some water and let it breath a while, has definetely changed to a warmer sherried drum....",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Achany",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "08 jun 2018 11:28 am",
            "content": "dark fruits, some dark chocolate, dried apricots, nuts, some spices, some oak, some hints of dark berries, sweet and spicey all together. there is something from older bottling of the 12yo sherry of Macallan which I can recognize. but there is also something missing. the promising start fades away a bit too quickley. the finish is promising but could be much longer and much more intense. Nice dram but has to be re-tasted",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Jackson05",
            "user_rank": "Connoisseur",
            "rating": "70",
            "review_date": "27 feb 2019 6:17 am",
            "content": "Macallan 12 year 43%“Matured exclusively in selected sherry casks from Spain”. Okie dokie. I would love to taste the ‘sherry’ that was used to season this cask (for the least amount of time possible). Oopsie daisy, some sherry ‘accidentally’ stayed in the cask before we put the whisky in (tauti is dead on I think). But it’s from Jerez, so that’s exotic, right? Is Macallan not the Ed Hardy of scotch? N: It’s two sided (but very simple) There’s fresh oak, grass, straw, sawdust, and then an artificial sweetness, like If you asked for raspberry/strawberry/rhubarb syrup pumps at a coffee shop. It’s actually kind of hot for 43%, lots of ethanol notes. It’s like when my 2 year old son tries to hid behind a chair...P: Syrupy sweetness. Artificial cherry simple syrup, vanilla, copperF: Dry sweetness, lingering, sawdust, new oak, simple raspberry syrup. Thoughts: If I was to guess when his was bottled, I would say 12 years and not one day more. You get the idea...Macallan is pumping this shit out as fast as it can. Buyer beware.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Vallado",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "02 mar 2019 10:05 pm",
            "content": "After a long time had a Mac12 again in the glass to compare it with the Rare Cask Red can. The Mac12 is way ahead of the Rare Cask! Even today for me a saubereckerer Sherrymalt who is worthwhile to buy despite the ambitious price.",
            "nose": "Pleasant sherry aroma, syrup, berry puree",
            "taste": "Similar to the nose, with cooked fruits, raisins",
            "finish": "Medium long, young sherry, intense, minimal woody / spicy, towards the end strong nuttiness"
        },
        {
            "user_name": "WhiskyCasual",
            "user_rank": "Photo Moderator",
            "rating": "83",
            "review_date": "03 apr 2020 10:47 am",
            "content": "For me the best of the three (Fine, Double, Sherry)",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "DramGoodLife",
            "user_rank": "Expert Senior",
            "rating": "78",
            "review_date": "13 mar 2019 9:38 am",
            "content": "A whisky to nose and only nose.",
            "nose": "Powdery notes, black sugar, organic (extra dry) raisins, hint of ginger sponge and Christmas cake. Last but not least some freshly sliced green apple. Definitely a Macallan.",
            "taste": "Dull on arrival, spice creeps in with sour oak and earth not far behind. Jamaican ginger cake is obvious but the sour oak notes take away from any positives. Watery and flat.",
            "finish": "Finish is all sour and wet oak and some of the powder from the nose."
        },
        {
            "user_name": "pkomarek",
            "user_rank": "Expert Senior",
            "rating": "73",
            "review_date": "22 apr 2024 10:11 pm",
            "content": "The first impression in the aroma was good, sherry, smooth chocolate. Gradually, a light woodiness began to come in. Sweet woodiness soaked in sherry and chocolate. Gradually, the overall impression began to improve again, so it was quite good, although with a small notch and a slightly disturbed impression, but not spoiled by the expectation of things to come. But I didn't know what to expect. The taste starts with bitter woodiness, then the chocolate fruitiness and softer chocolate start to balance it out, but a little of that woody bitterness still remains. The aroma was better than the taste, so what will the conclusion be? It holds the line, continues downwards. The finish was bitter woodiness with a hint of chocolate. Overall, a disappointment. The aroma was quite good (with a slight reservation), but then it rubs off more and more. I somehow didn't get it. I recently tasted a 12-year-old Double Cask at Vašek's during a discussion on the subject of basic Macallan, which is even cheaper, and I found it to be fine, nothing particularly interesting, expensive for the money, but it didn't matter. So here I would have expected something better, nicely complemented by sherry, and I got something I could finish (so as not to make it into a dram), but I wouldn't want to pour another one. I feel like they put a paper box on a pedal car, wrote Bentley on it with a marker, and tripled the price.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "tester1277",
            "user_rank": "Expert Senior",
            "rating": "78",
            "review_date": "29 jan 2021 8:35 pm",
            "content": "Not bad, but way too expensive for the taste. There is better for less money.",
            "nose": "Sherry, nut, sweet",
            "taste": "sweet, very soft, mild, then becomes spicy",
            "finish": "medium long and sweet with dried fruits."
        },
        {
            "user_name": "Thatch",
            "user_rank": "Expert Senior",
            "rating": "70",
            "review_date": "24 feb 2022 10:18 pm",
            "content": "Can only agree with Tauti and Jackson05 ... an immature malt (it's supposed to be 12 years old?!) that seems drenched in sherry. Don't get me wrong, it tastes wholesome... if it were a liquor. While the nose still looks promising and is really inviting, the taste and finish are very disappointing. Downright insulting when you factor in the price.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Mugis",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "07 jun 2025 8:19 pm",
            "content": "",
            "nose": "Mild, sweet, sherry, orange, oak, apple.",
            "taste": "Surprisingly powerful, oranges, chocolate, oak, sweet red fruit, spicy.",
            "finish": "Mild, sweet, light acidity, orange, oak, becomes dry. Very elegant."
        },
        {
            "user_name": "MarcelWhiskyPanda",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "22 feb 2025 10:27 pm",
            "content": "Too expensive whisky!!!",
            "nose": "Dry Sherry Dried orange / citrus Some plum / dried fruit Chocolate caramel Slightly nutty, almost nougat Slightly perfumed",
            "taste": "For 40% the start is still quite ok Classic taste caramel Nutty Dried orange/dried fruit Hints of vanilla Chocolate / Nougat Spicy oak",
            "finish": "The sherry notes remain Afterwards it becomes clearly nutty and the oak sets in clearly"
        },
        {
            "user_name": "KyotoLefty",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "27 sep 2020 5:28 am",
            "content": "¥900 / 35 ml @ Sake Museum Karasuma.Appearance: Amber-orange. Nose: Lovely sherry nose, caramel, vanilla, very rich malt sugars, cinnamon. Palate: Sweet vanilla, toffee, wine and raisin. Finish: Vanilla, malt sugar, pepper, tannic oak. With Water: Doesn’t need it and only waters it down. Overall: Lovely nose and tastes quite delicious but really does not impress as it should. Too low in alcohol. Definitely does not live up to the hype or the price and I won’t be buying any more soon.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Buecherwurm",
            "user_rank": "Expert Junior",
            "rating": "85",
            "review_date": "13 jan 2019 1:21 pm",
            "content": "Nose: relatively voluminous for the Abv., Deep sherry nose, dark fruit, berries, nutty  Taste: sweet, nutty, full-bodied, cooked fruit, fruit bread, lightest spice (maybe a lot of white oak from overseas)  Finish: Fruit spritzer, medium long, nutty  Conclusion: I was impressed especially by the constant subtle nuttiness, but also the beautiful sherry. Unfortunately, the price is too high. 90 euros in Germany, with the neighbors in NL 68. This colleague will not be back soon.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "ScoutGott",
            "user_rank": "Member Senior",
            "rating": null,
            "review_date": "11 jul 2018 7:29 pm",
            "content": "Couldn't have said it better than Tauti...",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "lys1",
            "user_rank": "Member Senior",
            "rating": "84",
            "review_date": "02 jan 2021 9:09 pm",
            "content": "A good intro to Sherry whisky, but it's a shame this is watered down to 40%. Deep raisins and spice tones both in smell and taste, and delicious spices in the aftertaste. Would have been a very good one with 6-8% more alcohol, but also 3% as his big brother would have made a big difference. This one probably has a different target group than me. The press is actually not that bad in Norway: it costs the same as a Laphroaig Quarter Cask ..",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "ming660",
            "user_rank": "Member Junior",
            "rating": "85",
            "review_date": "01 dec 2022 3:17 pm",
            "content": "Sherry cask benchmark, very classic taste. In China, the premium is very serious, and it is difficult to buy",
            "nose": "Creamy, sweet flavor, with occasional prunes",
            "taste": "Salted plums, a little salty, sweet and sour plums, cream",
            "finish": "The aftertaste unique to sherry barrels is very warm, but it is different from the burning sensation produced by alcohol"
        }
    ]
}