{
    "info": {
        "ws_name": "Benromach 10-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Benromach",
        "ws_age": 10,
        "ws_abv": 43.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/1/5/9713/271079-normal.png",
        "ws_rating": 84.06,
        "ws_vote_cnt": 775,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/159713/benromach-10-year-old"
    },
    "collected_count": 51,
    "reviews": [
        {
            "user_name": "LukasJakubDrabek",
            "user_rank": "Shoplink Moderator",
            "rating": null,
            "review_date": "10 nov 2020 1:25 pm",
            "content": "Ralfy review 851: https://www.youtube.com/watch?v=FHgRvKH8_00 (84/100).\"Very much an old school flavor like you'll find in Glenugie's and North Port's. And Millburn's, another one. But lacking the yeastiness that you used to get in old whiskies. So if you want to taste the modern whisky which is an authentic throwback to the flavors of yesteryear's - and I'm talking about yesteryear is 30s, 40s and 50s, post prohibition times - then you've got a pretty good representation, or point of reference here, this 10 year old Benromach.\"",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Dre73",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "30 dec 2023 10:40 pm",
            "content": "Just a decent standard whisky, some red fruits, some whiffs of smoke. Pleasant, not very complex but just drinkable.",
            "nose": "Quite present nose initially, some red fruits, raisins, some whiffs of rubber. After some time, more smoke influence peeps in now. Some spicy pepper as well. Later on the nose gets more shy.",
            "taste": "Smooth, with only a little sparkle. Black pepper, rubber, some red fruits. In time, it seems to gain power.",
            "finish": "Some more power now, red fruity, pepper, some more bitter smoke now. Not too long finish."
        },
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "18 jul 2025 12:21 am",
            "content": "2021 Rating",
            "nose": "Sweetness, caramel, smoke, but more in the background. Hints of fruit.",
            "taste": "A little spice, caramel-fruity sweetness. A little sweet smoke. Salt. Salted caramel.",
            "finish": "Sweetness, smoke, caramel, salt, spices, perhaps a touch of honey. Medium-long finish."
        },
        {
            "user_name": "MaltVader",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "28 mar 2022 11:21 pm",
            "content": "",
            "nose": "A little smoke, leather, tobacco, caramel, dried fruit, vanilla, sweetness, a little peach on the back",
            "taste": "Balanced, fresh, sweet, plums, peaches, caramel, smoke, some pepper",
            "finish": "Medium, lasting, pleasant, fruity smoky"
        },
        {
            "user_name": "ThorstenH",
            "user_rank": "Connoisseur",
            "rating": "65",
            "review_date": "16 feb 2023 7:57 pm",
            "content": "herbs and cardboard. Drinkable, but I don't really know what to do with it. 61-70 - Okay, but not more than 1 dram",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "wisekyofcourse",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "20 aug 2021 6:50 pm",
            "content": "new bottle, what does that change? nose: malty, dry oak, vanilla, hint of smoke fruit in sweet compote on orchard fruits mouth: slight bitterness, the smoke is more frank, subtle at the same time; the toast exceeds it in terms of scent the wood arrives more pronounced, the cooked fruits and on grapes of the date, of the prune, the fruits of the orchard disappear caramel, peppery spices, a vegetal return to the elderberry all at once, some fresh, tannic leather, soft caramel final: bitterness, almond shell, cold smoke, dry wood, dried fruits, dried baked grapes, flower stalks.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Sweetspot",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "29 mar 2021 9:55 am",
            "content": "nice smoke, good spice - great value",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "pianoman",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "24 mar 2024 9:18 am",
            "content": "Blind Tasting",
            "nose": "Garden fire, lemon, a touch of brass. Some sawdust. Stone wall.",
            "taste": "Grilled lemon, some honey. Milk chocolate. A hint of pepper and burnt wood.",
            "finish": ""
        },
        {
            "user_name": "Calmar",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "14 jan 2026 6:07 pm",
            "content": "A rather intricate and finely crafted whisky, with a wide palette of derivatives, a multitude of shades and undertones, with ghostly phenolic notes appearing here and there. It's very interesting, although at first glance it seems banal and nothing special, and unfortunately, it lags a bit in development.",
            "nose": "Open, damp, spicy wood tones, freshly sawn boards, the lightest ash-peat notes, creamy shades, caramel sweetness, a little coffee, leather goods, tobacco, pungent mineral notes, olives in brine.",
            "taste": "Soft, slightly watery, dried apples, burlap, dusty tones, oak, orange peel, ginger, candy sweetness, floral-honey shades, tobacco, light ash-peat notes, industrial textiles, a little smoke, dried fruits.",
            "finish": "Spicy, warming, oak, caramel sweetness, floral tones, ash-mineral nuances, slight metallic taste, coffee, tobacco."
        },
        {
            "user_name": "LDB",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "28 dec 2022 6:22 pm",
            "content": "A little fake and not really letting the Benromach DNA come through. At least older versions taste better to me.",
            "nose": "Very sweet and pleasing, weak spiciness, later very subtle smoke.",
            "taste": "Also pleasing and sweet on the palate, but slightly sour and peaty notes are definitely present.",
            "finish": "Well, tastes good as long as a 10 year old, slightly smoky whisky stays. A bit sticky at the end."
        },
        {
            "user_name": "Rosebank88",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "17 oct 2023 1:24 pm",
            "content": "",
            "nose": "Wonderfully complex and delicate. On the one hand, herbal tones of valerian and cough syrup, but also fully ripe blackberries, earth, salt, apple compote, leather, nuts and a hint of forest honey. Less old-fashioned and smoky compared to previous versions.",
            "taste": "Very soft, delicately spicy and slightly smoky. Also fresh, unique, slightly campy, linden honey, nuts, some earth and slightly dusty. Burly aromas gradually follow. The taste is very reminiscent of earlier versions.",
            "finish": "Long, delicate salty notes, smoke, maybe a bit greasy and mineral."
        },
        {
            "user_name": "DistiLesha",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "16 jan 2025 8:46 pm",
            "content": "Excellent whisky for its price! Noticeably ammoniacal at first, then deep, aromatic and complex notes emerge. But it doesn’t last long in the air and deteriorates quite quickly, becoming bitter in taste. 21 21 21 21",
            "nose": "Smoke from smoking hay, a slice of fresh garden apple, vanilla, trace amounts of ammonia that quickly evaporates. In the air, the fruits pick up speed, and damp cardboard appears. Intensity: 7/10",
            "taste": "Smoked heather and its bitterness, sweet applesauce on an old but scraped board. There is also ammonia at first, but it quickly dissipates in the air. Vanilla, spices, sour-salted caramel, some dried fruits (dried apples and raisins). Sweetness: 8/10 Saturation: 9/10",
            "finish": "Lots of wood, heather bitterness, hot pepper, lemon zest. Very long."
        },
        {
            "user_name": "maurisso",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "24 sep 2023 12:55 am",
            "content": "With this style, perhaps the best q/p [where you can find it at the right prices (and it's not my country)] 10 years old available to date. Out of curiosity, try drinking it next to a Banca di Primavera of the same declared age... Hello.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Issie",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "31 mar 2022 2:10 pm",
            "content": "31.01.2022",
            "nose": "Warm smoke, much stronger than just now with the Contrasts Organic, leather, nuts, dried herbs, a few spices, lemon, light honey, also a bit of caramel, grain, a hint of wild berry jam, very light wood",
            "taste": "Honey, caramel, minimal aniseed, a bit of lemon, very light wild berry jam, a few nuts, tobacco, wood, some ash on the finish",
            "finish": ""
        },
        {
            "user_name": "glen efze",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "27 jan 2022 1:50 pm",
            "content": "A great value entry into the world of Benromach, the malt will be available at the end of 2021 for under €40, which is a good price for an aged whisky with no colouring. Benromach only uses 1st fill casks, in this case a blend of 70% ex-Bourbon and 30% ex-Oloroso. In addition, it is a Speyside whisky that is peated, so today it is more of an exception among the classic Speysiders. Does it make sense? www.glen-efze.de",
            "nose": "This is of course not Islay peat, first you have to consider whether there is any smoke in it at all. But this consideration lasts only briefly, because then comes a nice, warm smoke that is restrained: smoke for those who find Islay too blatant. The smoke is followed by sweet, ripe fruit, pears and sweet, red apples. The whisky can stand still for a while, then the smoke becomes clearer, Mirabelle plums are added to the fruits.",
            "taste": "The alcohol is 43% vol. quite ok, together with the smoke it brings enough power. The fruits are there, peach and mirabelle plum, mixed with the smoke of a still slightly smoldering fire. Wood is not directly noticeable, but you can feel it on the palate and find what you are looking for. The bourbon casks contribute nice vanilla.",
            "finish": "The smoldering wood fire remains on the palate as a smoky covering. This is a nice whisky that boasts a warm smoky note combined with fruit. For the price and age this whisky is really good. On the one hand it is pleasing, but with the smoke it offers an aspect that gives depth and maturity that you have to like."
        },
        {
            "user_name": "DramALife",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "18 dec 2022 10:18 pm",
            "content": "S 7 At first sip, it's not uncomfortable but like chewing smoked oak shaves. Would've totally missed the fruits entirely if I simply swallowed the liquid instantly with repulsion. It’d be a great entry-level sherried peated whisky if the bitterness is tuned down a bit. [78-82] I'll gladly welcome another dram.N 25 Sourish citrusy, lemon and orange. Dusty malt. Wet hay. Smoked oak. A whiff of coastal peat. Fruits gradually pick up the pace but vegetal notes continue to lead the way. Ginger cake. P 25 Sweet and slightly oily. More vegetal than the nose. Oak bitterness. Plenty of wood spices and peat masking the underlying red fruits. Honey. Slightly buttery. Subtle smoke. More fruits (red apples, grapes, peaches, cherries, strawberries) surface as it stays longer. F 23 \\ Mid-finish. Drying oak. A touch of red fruits and ashy peat lingering.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Spoerkel",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "11 jul 2024 8:41 pm",
            "content": "Totally OK. Unfortunately the dram disappears from the palate very quickly. Good value for money.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Xaver",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "04 dec 2023 10:49 am",
            "content": "Sample from my Advent calendar... Very good standard.",
            "nose": "Color: Light amber Nose: Starts with a nice, bitter smoky note. Tart leather, sweet figs, clove spice and some lovage. Quite an oily scent. Becomes sweeter with time. Bit of brown sugar, raisins. But also some motor oil and damp tobacco. Goes well with gravy and dark cherries with filter coffee.",
            "taste": "But a strong, spicy start. Ginger - Chili Mix. Again, oily with this slightly bitter smoky note. Plums, bitter nuts and fresh rusty notes. On the second sip, more bitter herbs and also dry, fresh wood and hints of apricots.",
            "finish": "Medium length. Dry, bitter smoky note. Nutty bitterness with a subtle, oily sweetness."
        },
        {
            "user_name": "spigray",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "13 nov 2021 7:54 pm",
            "content": "I hope they only changed the label!",
            "nose": "smoky and slightly ashy, shoe polish, raw wool, some dried fruits",
            "taste": "yep, still very nice. The smoke is moderate on the palate, the sherry influence a little stronger here. Roasted nuts, fresh figs, a little caramel. Tobacco, leather.",
            "finish": "medium in length, Oranges, very clean."
        },
        {
            "user_name": "Cask1988",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "01 apr 2021 9:51 pm",
            "content": "The Benromach 10 in a new jacket. I was a little afraid they would have changed the recept as well making me doubt this would be able to meet up with the high level of the previous batch and presentation.",
            "nose": "Great! This starts very mature and acts way older then 10yo. Initially I get loads of great sherry flavors like wood polish, tobacco and leather. After a while more youthful fruity flavors appear as well as a pleasant charcoal smoke, which gives this whisky a great and highly enjoyable whisky!",
            "taste": "Right in between smooth and full bodied! It gives light and more heavy flavors. Loads of red berry and strawberry a whiff of peat and mild spices. Very good and extremely palatable.",
            "finish": "Long, oaky, smoky and mature! Great quality cigar tobacco flavors as well as silky and coating fruits, spices and leather. This goes extremely well with a cigar I think! Well in short: this is one of those whiskies you’d always want an open bottle of! It offers a hell lot and this is without a doubt one of the best Core range starters out there!"
        },
        {
            "user_name": "Phalat",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "02 mar 2022 6:43 pm",
            "content": "",
            "nose": "sherrypeachdried nettlevanillacitricraspberrybananadry glass: milk flavor",
            "taste": "sherrywoodypeatywalnuthoneymentholwaterytouch of smoke",
            "finish": "sherrypeatymentholspicywoodymedium finish"
        },
        {
            "user_name": "VLG",
            "user_rank": "Connoisseur",
            "rating": "89",
            "review_date": "26 may 2023 11:46 pm",
            "content": "Amazing whisky. Tons of personality, complexity and flavor. A peculiar combination of sherry notes and peat notes. I definitely have to try more whiskys from this distillery. - Dominant notes: a very peculiar combination of sherry and peat. Both subtle, but at the same time prominent in their mutual combination. They don't stand out separately, but together they shine like gold. It's hard to explain, but extremely nice and interesting. It's unique. - Secondary notes: Smoked paprika (thanks CaolIlla25), rancid cardboard (yes), apple, cinnamon, anise, nuts, red fruits, wild herbs, mineral notes, honey, earthy, pepper, tobacco, malt, plum, toasted caramel, orange. Touches of leather, cerales and oak. Medium finish, in which the sweet notes of sherry, spicy pepper, peat and cardboard predominate. Intensity: 4/5 (Intense) Complexity:4 /5 (Complex) Originality/heterodoxy: 4/5 (Unique) Density/ presence in the mouth: 4/5 (Oily) Quality/price ratio: 4/5 (Good price) Rating: 89/100 (I like it a lot / Excellent) - Pros: It is the only whisky I know of that makes the notes of cardboard play an interesting role in the whole. In general, extremely interesting. Finding a whisky that is both accessible, highly original and very good is exactly what I look for in the wonderful world of whisky. I could spend many hours in your company. It is obviously of a higher quality than most. For its price, it is the best out there. - Cons: It is impossible to find it interesting if you do not have much experience in the world of whiskys. Even if you're very experienced, I think it's one of those whiskys you either love or hate, because of all its quirky notes, especially the cardboard one. This whisky requires not to be chillfiltered!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Palisker",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "09 aug 2025 1:11 pm",
            "content": "I have to say again and again, it's simply really well done. The 15 is far superior, but the 10 is always the best entry point into the distillery. The distillery character is unmistakable, with a Benromach funk that's hard to describe. The classic Benromachs from the core range generally have an ethereal note (near mint), light smoke, and that cowshed flavor (at least, that's how it is for me). I really like it.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "YD84",
            "user_rank": "Expert Senior",
            "rating": "89",
            "review_date": "28 mar 2021 3:32 pm",
            "content": "[11/10/2021 bottling] Distinctive, singular whisky. Old books, leather, dunnage, strawberries, oranges, earth, tobacco, powdered chocolate, hint of caramel. A wisp of smoke weaves in and out of all the other aromas and flavours. I will always have this in my cabinet. The livery has changed, but the liquid inside is still just as good. I probably prefer the older version a tiny bit more, but that's almost certainly down to just nostalgia. Having tried a couple of the new label batches, the 11/10/2021 batch is my favourite so far and almost deserves a 90, though I haven't tried anything post 2023 yet.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "molpet",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "06 dec 2022 7:23 am",
            "content": "Not my type of smoke, unfortunately. Like smelling on a ham with iodine on it. The palate is very nice however. Excellent casks have been chosen. The sherry is present on the top of fairly typical bourbon honey sweetness.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "M134481",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "06 jun 2021 8:58 pm",
            "content": "",
            "nose": "Pear, sherry, light smoke, apples, and yes.. as told by Whisky4all, the Hema smoked sausage, vanilla, peach, cocoa notes and an underlying pretzel.",
            "taste": "Pear, honey, dark chocolate, syrup, light smoke, slightly fleshy, red apples and sherry of course.",
            "finish": "Pear, white grape, sherry notes, dark chocolate, light smoke, honey and syrup."
        },
        {
            "user_name": "Montezuma",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "08 aug 2025 9:55 pm",
            "content": "06/30/2025 - bottle Is there a peat Benromach? My dream...",
            "nose": "Earthy peat with burnt meat, also medicinal, plus caramel and vanilla. Zero alcohol, just a cozy warmth, dried fruits (peanuts, walnuts, dates), spices (cinnamon sticks, cloves, and licorice), malt, dried grains, and aged and treated wood. Light yeast. Intense even without alcohol; it's hard to find that balance. With water, it's sweeter, with some very ripe red fruit, almost plum-like, licorice overpowering the clove. The peat is in the background, but it still enriches it. Fragrant old wood. Now that the label is revealed, let's put it on the ice? Leather, cinnamon, plastic, the peat lingers even on ice, too bad it doesn't stay in your mouth.",
            "taste": "There's a hint of heat here, but only a hint of clove (eugenol for toothaches). White wood tannins, but that doesn't rule out the old wood. Dried fruits and spices are lighter, except for the ubiquitous clove. Yeast, grains, malt, and oily notes. With water, the peat is subtle, just a little leather and tobacco. Some astringent, and it became less dry. With ice it's sweeter, with raisins, burnt sugar and yes, a peat in the background.",
            "finish": "Tannic, dry aftertaste, with light vanilla and caramel, and old sawn wood. A hint of cooked vegetables (sulfur). Some leather, like a peat residue, which didn't show up on the palate. Long finish."
        },
        {
            "user_name": "ZLako",
            "user_rank": "Expert Senior",
            "rating": "77",
            "review_date": "01 may 2022 11:06 pm",
            "content": "N: malty, sweet peat, oaky, fruityness in the backP: peat (surprising amount), oak, fruits, floral notes and some honeyF: long, ash, malty, fruity",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Joschbert",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "21 apr 2022 12:05 am",
            "content": "Remarkable standard bottling. Quite complex for 10 years. At the same time dangerously tasty. For under €40 unbeatable PLV.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "kawhi",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "19 oct 2024 8:42 pm",
            "content": "One of the entries that I often buy when it comes out at a reasonable price. I think I've had about 3 bottles since last year, but I've never written a bottle review, so I'll write a quick review. Even if I don't give it a high score, it's a good choice when you want to have a light and clean glass of peat and go to bed.",
            "nose": "- Apple, pineapple, honey, pear, cinnamon, peat, lemon, sherry, dark chocolate : The nuance of sherry is not strong, but it forms a layer from the base. Overall, you can feel the fruity taste of apple, pineapple, and pear, the sweetness of honey, the right amount of cinnamon spice, the subtle Highland peat, and the hint of lemon. The intensity of the taste is not strong and it feels like it has been slightly watered down, but overall, it feels very comfortable to drink daily. It feels like the layers were forcibly increased by mixing casks, but it goes down smoothly compared to the age.",
            "taste": "- Apple, pineapple, honey, pear, cinnamon, peat, lemon, sherry, dark chocolate : The nuance of sherry is not strong, but it forms a layer from the base. Overall, you can feel the fruity taste of apple, pineapple, and pear, the sweetness of honey, the right amount of cinnamon spice, the subtle Highland peat, and the hint of lemon. The intensity of the taste is not strong and it feels like it has been slightly watered down, but overall, it feels very comfortable to drink daily. It feels like the layers were forcibly increased by mixing casks, but it goes down smoothly compared to the age.",
            "finish": "- Peat, dark chocolate, oak, apple, hints of tropical fruit, hints of sherry : The finish is medium length. The finish leaves a subtle hint of sherry. The salty saltiness of the peat and the nuance of dark chocolate give a salted chocolate-like feeling, and the fruity aromas of apple and tropical fruits are felt."
        },
        {
            "user_name": "kawhi",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "15 feb 2024 4:37 pm",
            "content": "Not too strong peat, moderate sherry, and salty chocolate.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "notesofmalt",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "03 oct 2021 11:22 am",
            "content": "Benromach 10 years, 43% alc. Original bottling (approx. 2020) Nose: I first notice a mild smoky note of peat, slightly fruity. Add to that damp hay, flower meadow after heavy rain. Wood polish, solvents, flavored pipe tobacco. With a little more malt and cedar wood, dried strawberries, overripe blackberries. Palate: dry with more smoke than on the nose. Light salmiak liquorice, maybe a little aniseed. In addition, meaty aromas, dark chocolate and mild cinnamon heat. The fruit aromas on the nose are still there, but are more in the background. Finish: Medium to long, first creamy and then quickly salty dry, slightly spicy. The finish is characterized by peat smoke, along with dried fruit and wood aromas, malt and cigar tobacco. Conclusion: incredibly exciting and multi-layered, ingeniously complex for the age and without being overwhelming. There is a clear buy recommendation on my part. 87/100 points (tasted in 2021) www.notesofmalt.com",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "rich_93",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "24 jan 2022 8:38 pm",
            "content": "Super nice profile, so much character! However, It took me a while to finish the bottle. I think it is the combination of peat and sherry casks that just isn’t my thing, usually it results in a sourness that tends to clash with the sweet notes. Really good stuff though, and great value.",
            "nose": "Pretty rustic in form, a bit prickly even at 43%. Soft smoky vanilla, warm log fire peat, ginger, orange peel. There’s a sour facet to with some redcurrant and lemon peel as well. It’s all quite light and bright, making me suspect sherry-conditioned american oak. A dark, chalky mineral note keeps things interesting. Fresh clary sage, tobacco, cherry, clove. Good stuff!",
            "taste": "Well behaved, sweeter than expected, plenty of spice. Redcurrants, a little bit of honey, orange, vanilla and some coffee bean. Some peat, giving a hearty warming effect to it all. Delicious dessert notes of meringue and tonka bean. I miss some of the darker notes from the nose.",
            "finish": "Medium, on the dry side. Continued spice and peat, coastal freshness. Clove, cardamom, hint of savoury cheese, black and red currants. Well-balanced oak."
        },
        {
            "user_name": "Eilean a' Cheo",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "02 dec 2021 10:45 pm",
            "content": "Excellent taste ,quite complex, masterfully balanced on the mouth. The sherry blends with juicy fruits, the dry wood smoke is very well integrated in the whole oily profile, and fine leather notes along with orange peels add a more mature and old school air.Maybe the best value for money whisky of the year 2021.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "StefanKatonaXXL",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "07 mar 2025 5:23 pm",
            "content": "Compared to the older 10yo version, this one is significantly more sherry-like in both taste and aroma. Aroma: Sherry sweetness and fruity freshness, oak woodiness, leather, faint peat, pear slices, honey in the background. The old polished parquet floors have completely disappeared from the aroma. The taste is slightly peaty, distinctly vanilla-sweet, slightly woody, malty with honey and fruity freshness. A slight bitterness appears at the end.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "riegerjonas",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "20 jul 2022 10:32 pm",
            "content": "2022-07-20",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "RedBandit74",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "11 aug 2021 11:41 am",
            "content": "",
            "nose": "Sherry; Sweet; Apple; Tobacco; the alcohol is well integrated",
            "taste": "Sweet; Junk; creamy; Sherry; some chocolate",
            "finish": "Sherry; some sweetness; some tobacco"
        },
        {
            "user_name": "bl0wb4ck",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "02 mar 2024 2:24 am",
            "content": "Really great standard with good PLV. There is subtle smoke, some sherry, some citrus. some caramel. Uncomplicated and yet convincing.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "The_Osprey",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "09 jun 2025 10:10 pm",
            "content": "Benromach 10 Year, SSMSW, 43%. 25ml sample at home, June 2025. A nice vibrant golden colour. Aroma has lemon boiled sweets and buttery vanilla mixed with charcoal briquettes and cooking gas, singed sawdust. Good. Body is moderately oily. Good weight to it. Taste is again buttery oak with some lemon zest, minerally salty middle, moving bitter and waxy and charred into the finish. Increasingly bitter. Some nice aspects to this, and interesting character. I can see why they bottled it at a low ABV – this carries itself quite well despite it, and drinks a bit hotter than it is due to the bitterness. The palate doesn’t quite match up to the aroma and body, but it’s decent stuff. 3.45/82",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "littlebuzzed",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "03 jan 2024 5:26 pm",
            "content": "Very well done. Good value. Yes, I'd buy another bottle.",
            "nose": "Sherry and chocolate, fruity, barley, a little doughy",
            "taste": "Sweet and fruity, big honey, some peat",
            "finish": "More honey, light peat and spice"
        },
        {
            "user_name": "SingleMaltRussell",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "15 feb 2022 9:37 pm",
            "content": "The first time I tried Benromach 10 was ages ago and I didn't like it at all. I think my palate wasn't ready yet, because I do now. Quite a lot.I also think there might have been a bit of a neck-pour effect going on, or maybe I just hadnt let it rest, as I remember being put off by late astringency, whereas this time, that astringency is still there, but tastes more in balance every time I take a sip. In fact, the deeper into the bottle I get, the more I'm enjoying this, all round. And it is an all-rounder. A bit sweet, a bit sour some savoury funk, some spice, various fruits, measured bitterness, that astringent edge, wood, vanilla, even a hint of charred carbon - it packs them all in.I put this solidly between Ledaig and Craigellachie in terms of some of my favourite entry level, distillery bottlings and fantastic value for money.Slight digression: Benromach has been fairly recently rebranded and I'm not crazy about the new look, but then, I didn't really like the old style either.",
            "nose": "Vanilla malt funk, dried cherries and apricots, furniture polish, molasses, fruit spread, fresh-shredded pipe tobacco. Very light charcoal ash. Orange oil. Turmeric",
            "taste": "Ripe orchard fruit with a tart edge. Cooked plantain, charred pineapple, Hovis whole-grain biscuits, rising ginger, grapefruit peel and bitter leather, coffee and toffee.",
            "finish": "More ginger and bitter leather, Oak, astringent (but increasingly mild) Tea Tree, salted apple butter, vanilla. Dry."
        },
        {
            "user_name": "BarleyMail",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "19 dec 2021 3:28 pm",
            "content": "",
            "nose": "Very light peat smoke, a honey marinade on ribs, fried bacon, leather, black olives, dates, caramel, praline/milk chocolate, oranges and some peach in the background.",
            "taste": "Fried meat, lacquered with a sweet honey marinade. Zest of oranges, caramel, salt, hazelnuts, dates, olives and chocolate.",
            "finish": "Oranges, fried bacon, hazelnuts and milk chocolate. Too bad it wasn't bottled at 46%, nevertheless (one of) my favorite bfyb! Very delicious!"
        },
        {
            "user_name": "Peatyjohn",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "27 apr 2025 7:54 pm",
            "content": "Quite farmy and hay like. A decent, tasty, simple malt with sherry, oak, smoked almond nuts, with toffee and red sour fruits. Great value and quite delicious.",
            "nose": "Vanilla, malted barley, honey, damp grass.bitter, leather, tobacco.",
            "taste": "Toffee, nutty, quite prickly, cough drops, pears, dates figs.",
            "finish": "Malty, toffee, spicy peppercorns"
        },
        {
            "user_name": "KyleRiemen",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "18 jan 2024 8:12 pm",
            "content": "According to reports on the internet, this whisky is only slightly smoky, but unfortunately I can't confirm that. For fans of peaty whiskys, this Speysider is definitely a fine whisky, for me it borders on pleasant, it is significantly peatier than, for example, the Oban Little Bay and even than the Glen Scotia Double Cask.",
            "nose": "Gum, red berries, dark fruits, very sweet, some pleasant ash, caramel, chocolate and vanilla in the background. I can very well imagine how outstanding this nose would be without the smoke note.",
            "taste": "Smoke, dark fruits, also very sweet, chocolate, caramel, vanilla.",
            "finish": "At first it's very nice, notes like the key, but it disappears too quickly and then all that's left is the rubbery quality, which also disappears very quickly."
        },
        {
            "user_name": "Stefan_Hartl",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "16 oct 2021 2:15 pm",
            "content": "It can be so simple, sensible barrels and a suitable age and you get a wonderful whisky. This Benromach convinces with great fruit aromas, light campfire smoke and a clear barrel influence.",
            "nose": "First a spicy, warm wood smoke. Immediately behind it oranges, strawberries and some pipe tobacco. Then vanilla, floral notes and oak spice. Very nice and wonderfully complex nose for its age.",
            "taste": "First oily and mild, then becoming more and more spicy, with chocolate and slightly spicy cinnamon notes. The fruits fade into the background, the orange has now become more of a bitter orange peel. After a while in the mouth, ashy smoke aromas appear.",
            "finish": "In the medium-long finish, the pipe tobacco is back, along with a smoke that is reminiscent of a campfire that has just gone out. The fruits are more reminiscent of green grapes, plus some chocolate, leather and spicy oak. Very nice."
        },
        {
            "user_name": "Nomorewh",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "26 jan 2024 10:48 am",
            "content": "",
            "nose": "sherried, rubber, apples",
            "taste": "rubber, smoky, sweet berries",
            "finish": "sweet, smoke, rubber"
        },
        {
            "user_name": "tester1277",
            "user_rank": "Expert Senior",
            "rating": "69",
            "review_date": "23 feb 2021 7:35 pm",
            "content": "",
            "nose": "Spicy and intense, but slightly musty. Herbal, delicate smoke that smells like freshly varnished wood after 15 minutes of breathing.",
            "taste": "spicy and heavy",
            "finish": "relatively short and dry"
        },
        {
            "user_name": "RobNagtegaal",
            "user_rank": "Expert Senior",
            "rating": "75",
            "review_date": "01 nov 2022 12:13 pm",
            "content": "an oke dram, on the nose and pallet a lot more Peat smoke then expected. mouthfeel is soft and oily what i like. but in the tast some sharpness. I think some more years in the cask will do a lot for this one.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "smolar231",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "31 aug 2023 12:58 pm",
            "content": "",
            "nose": "campfire smoke, sweet, a bit cookie-like, nuts",
            "taste": "smoke, then a lot of dark chocolate, a bit spicy with a hint of sweetness",
            "finish": "medium-long, smoky, dark chocolate"
        },
        {
            "user_name": "M_A_S_K_A",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "22 feb 2025 3:42 pm",
            "content": "",
            "nose": "smoke, leather, sherry notes, dried fruits, apple, sweet pear, a bit of freshness and citrus",
            "taste": "dried fruits, chocolate, wood, caramel",
            "finish": "below average, dried fruits, pepper"
        },
        {
            "user_name": "Svjatogor",
            "user_rank": "Expert Senior",
            "rating": "79",
            "review_date": "26 apr 2022 9:04 pm",
            "content": "n: balanced, fruity, berries, red fruit, pepper, vanilla, citrus, cereal, perfume, muesli bar, bit of spicyt: full, fruity, citrus, oaka: balanced, light smoke, nice fruits",
            "nose": "",
            "taste": "",
            "finish": ""
        }
    ]
}