{
    "info": {
        "ws_name": "Benromach 15-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Benromach",
        "ws_age": 15,
        "ws_abv": 43.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/1/5/9714/270541-normal.png",
        "ws_rating": 85.58,
        "ws_vote_cnt": 777,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/159714/benromach-15-year-old"
    },
    "collected_count": 53,
    "reviews": [
        {
            "user_name": "dram-drinker",
            "user_rank": "Photo Moderator",
            "rating": "85",
            "review_date": "13 dec 2020 8:35 pm",
            "content": "The leathery notes are not bad – there doesn’t seem to be any sulphur",
            "nose": "Dry hay, honey, whiffs of leather, hints of green fruits, little grassy, heather",
            "taste": "Oily, creamy, good sweetness, honey, leathery notes, yellow fruits, little vanilla",
            "finish": "Medium long, warm, more honey, more leathery notes, little spices"
        },
        {
            "user_name": "Dris",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "21 nov 2023 1:31 am",
            "content": "",
            "nose": "+",
            "taste": "-",
            "finish": "+"
        },
        {
            "user_name": "Andytka3",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "17 jan 2022 12:35 pm",
            "content": "1654) Benromach, 15YO (Bottled 2020)Dull slogan, why have one if it is meaningless? But an opinion that entirely personal, and no disrespect to all the craftman working in the distilleries.",
            "nose": "N- What's important lies in the bottle, as the initial heather honey smokes teases the nose, the toffee, liquorice and natural forest mist drawing in slowly with mold-y, but nice fragrant of damp wood. Peppers awaken as it aired longer, stewed red apple with restrained scents of savoury oxidized sherry odor, sweet resin underlying dried fruit that induce it to a desired level of depth. (87/21)",
            "taste": "P- Firm and full texture, nutty and chocolaty sherry arrives with warm heather honey smokes over aged and elegant leathery notes. (87/21)",
            "finish": "F- Medium long, silky, waxy, herbal-y bitter and cola syrup lead to medium dry mouthfeel. Savoury sweet undertones that took awhile to shows, but worth the wait. (89/22)B/B- 88/22Weighted Rate- 86pt"
        },
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "29 oct 2022 5:48 pm",
            "content": "Golden color, light oily.",
            "nose": "Spring onions, dark berries. Sweetness. Arranged, rounded. Then caramel.",
            "taste": "Sweetness. Dark berries. Blueberries. Berries. Salt. Oily.",
            "finish": "Salt. Dark berries. Blueberries. Berries. Caramel. Salty caramel."
        },
        {
            "user_name": "thijs100",
            "user_rank": "Connoisseur",
            "rating": "89",
            "review_date": "22 jul 2020 3:00 pm",
            "content": "The Benromach 15 Years is as good if not better than when it was first introduced five years ago.",
            "nose": "Praise be! There's that Benromach profile I've come to expect and love! It has that classic soft barbecue smoke and grilled bacon aspect, but with lots of dried red fruits and hints of chocolate. There are some shy touches of citrus, grilled nectarine and pineapple too. A surprising hint of mint as well as a quick hit of tobacco leaves. Benromach at the top of its game.",
            "taste": "Quite oak-y and dry. It has some fruity aspects, like red apples and plums, but also there's also cocoa powder, a soft touch of smoke and cracked black pepper corns. Just a touch of eucalyptus.",
            "finish": "Sherried, fruity and spicy. Drying and medium in length."
        },
        {
            "user_name": "Sporx",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "17 apr 2021 11:23 pm",
            "content": "Aroma Sweet, vanilla, cherry, toffee, very little smoke taste Little smoke, chocolate, nuts, some raisins finish Medium length, smoky flavor, ham",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Malthead19",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "26 jun 2022 12:21 pm",
            "content": "COLOUR: amber (without dye) - a completely different Benromach 15 y. (compared to older predecessors until 2020) - different mouthfeel, different flavors, more oak more Bitterness, less oily and complex, the old bottling is unfortunately much better - for 60€ still a good price for the quality",
            "nose": "Sherry, fruity, dark berries, wood, tobacco, no smoke",
            "taste": "fruity, dry start, spiciness, wood, slightly bitter, not at all oily or voluminous",
            "finish": "medium length, dry, somewhat bitter finish; medium-long dry aftertaste"
        },
        {
            "user_name": "schengel10",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "16 jun 2022 7:44 pm",
            "content": "...with the change in optics, they seem to have slightly changed the recipe/cask selection. ...the smoke that was clearly present in the 15-year-old is no longer/hardly perceptible! ...nevertheless a very good malt! [color:] = amber;",
            "nose": "quite fruity (yellow fruits; pineapple, dark berries), sherry, leather, tobacco, wood, no smoke;",
            "taste": "fruity (berries, grapes), fairly dry start, spices (pepper), wood, slightly bitter oak;",
            "finish": "good medium length, dry, spices, slightly bitter aftertaste;"
        },
        {
            "user_name": "Rosebank88",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "17 oct 2023 1:29 pm",
            "content": "",
            "nose": "Ripe and heavy, after weeks of leather, syrupy fruit, beet syrup, a touch of ginger and overall less spicy than the 10. Just as noticeably sweeter, rounder and more domesticated than previous versions. Salt, some smoke, shoe polish and dark chocolate follow in the background.",
            "taste": "Very dense, slightly salty and smoky, salt, walnuts, gravy, ash, smoke, again hints of various fruit syrups and forest honey. Wonderfully rich and really very good",
            "finish": "Long, savory with salted walnuts, gravy and valerian."
        },
        {
            "user_name": "Issie",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "31 mar 2022 2:11 pm",
            "content": "31.01.2022",
            "nose": "Nuts, dried herbs, a bit of menthol, spices, dark dried fruit, tobacco, honey, caramel, orange, wild berry jam, warm smoke, but again much weaker than the 10, wood",
            "taste": "Honey, wild berry jam, dried herbs, mint, nuts, tobacco, coffee, wood, minimal ash",
            "finish": ""
        },
        {
            "user_name": "_Dziki_",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "07 apr 2023 11:13 pm",
            "content": "",
            "nose": "Figs, raisins, lemongrass, cinnamon, citrus, quite sweet and vegetable.",
            "taste": "Crisp, vegetable, a bit tart, gooseberry, slightly dry but very strongly diluted. Salted caramel, cane sugar.",
            "finish": "Not too long, vinegary and tart, warming, there is also a vegetable sweetness"
        },
        {
            "user_name": "thomasjx",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "27 jun 2025 6:03 pm",
            "content": "Quite underrated, very nice standard bottling - recommended for around 70 euros if you like the heavy old-school style with character",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Lorion",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "12 jan 2023 5:38 pm",
            "content": "Successful whisky that I always like to enjoy. 81 points.",
            "nose": "light smoke Fruity, pleasing, slightly sweet. A mild campfire in the background. Far in the background.",
            "taste": "Sweet berries, subtle smoke. Tasty, it encourages smacking.",
            "finish": "Medium length, fruity with a subtle smoke."
        },
        {
            "user_name": "Spoerkel",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "29 aug 2022 3:00 pm",
            "content": "Interesting taste experience for 43%.",
            "nose": "",
            "taste": "",
            "finish": "Travel bag?"
        },
        {
            "user_name": "spigray",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "28 dec 2020 1:28 pm",
            "content": "A very good dram, I think even a little better as the previous version.",
            "nose": "a layer of discreet smoke over beautiful sherry, dried fruit and some fresh berries. whiffs of shoe polish and mint.",
            "taste": "waxy, walnuts, dried fruits, malt. Quite smoky and slightly ashy. crushed black peppercorns, leather.",
            "finish": "long, slightly peppery, a little dry."
        },
        {
            "user_name": "domani",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "26 feb 2022 6:53 pm",
            "content": "Earthy malt with an edgy old-school character. Not many individual aromas and basically no dissecting whisky but compressed and distinctive. The 43% exude power and intensity - 02/25/2022",
            "nose": "Strong nose that is difficult to classify, definitely dirty, the red fruits are interwoven and clumped, for me it doesn't go in the direction of smoke, rather earthy and dusty, aromatic cigar",
            "taste": "Very spicy and malty, nice oily spiciness, dried fruits, oak",
            "finish": "Medium length, black pepper, earthy, oppressive oak"
        },
        {
            "user_name": "DannyDram",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "27 dec 2020 2:04 pm",
            "content": "Citric, fruity, herbaceous, spicy, leather, walnut, yeast, malt, rhubarb. Balanced, medium body, warming, good intensity and a little astringent.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Koning",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "05 jan 2025 5:02 pm",
            "content": "I just love that slightly vintage profile with subtle tobacco smoke that Benromach manages to offer! The 15 captures this perfectly. It has a bit more depth than the already impressive 10 years old, although it is still a bit fragile because of the low bottling strength. A pity G&M didn't seize the rebranding for bottling Benromach at 46+%!",
            "nose": "Mild tobacco smoke and cigar boxes, so Benromach! A slightly earthy and dusty note perfectly alligns with this, but it's got also a fresher side: citrus fruits, sweet flowers, vanilla fudge, some honey and walnuts. An nice touch of thyme and curry powder rounds off this attractive nose.",
            "taste": "Opens up softly on milk chocolate (reminding me of Toblerone), greengages, oranges, sour cherries, some raisins and again these walnuts. Then a bit of spice kicks in with paprika powder and green peppers, together with a whiff of that lovely tobacco smoke. All very good, except that it becomes a bit fragile when holding it longer in the mouth.",
            "finish": "Light smoke at the front now, pairing with juicy citrus fruits and some prunes (love that!). Becomes a bit drier, with tannins, some mustard and just a trace of sulphur developing. The finish is of medium length."
        },
        {
            "user_name": "grinface",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "01 jul 2022 9:01 am",
            "content": "Some nice evolution over the 10-year-old, but still nothing that convinces me very much.Full review, in a tasting session with two partners and five Benromach: https://keinehalbendrinks.de/2022/04/21/eine-benromach-session/",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "sarthur71",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "14 jan 2022 8:25 pm",
            "content": "Soft, pleasant, mint-fruity aroma gives way to a tanned, rather bitter taste and a short, nondescript finish. Ambiguous release. Too poor and unbalanced for a 15 year old. Doesn't match the price.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Dr.Nose",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "06 apr 2024 4:55 pm",
            "content": "Notes from the Internet.",
            "nose": "Aromas of toffee, ground black pepper, peat smoke, forest fruits, dark chocolate and dried banana.",
            "taste": "Creamy and sweet with notes of ripe apples, roasted oak, dark chocolate, roasted malt, orange peels and subtle peat smoke.",
            "finish": "In the long aftertaste it has notes of soft peat smoke and dried fruit."
        },
        {
            "user_name": "Phalat",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "02 mar 2022 6:47 pm",
            "content": "",
            "nose": "cocoa butterdried fruitsSkinchocolatedry woodwalnutplum jamsherryraspberry",
            "taste": "peatwoodydry woody (sawdust)mushroommold",
            "finish": "pepperwoodypeatmedium finish"
        },
        {
            "user_name": "katarn_rb",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "17 sep 2021 7:25 pm",
            "content": "Bacon rind, campfire, plums and a shot of Maggi ... sounds strange, but tastes good;)",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Palisker",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "08 aug 2025 6:27 pm",
            "content": "For me, it deserves a much higher rating. I particularly like the strawberry notes and, above all, the mint influence. This is where you can truly recognize Benromach funk. The 43% ABV certainly contributes to this influence. And yet, I would be so happy with 46% ABV. I could imagine this whisky getting a little more power, which would suit it well.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyBjorn83",
            "user_rank": "Expert Senior",
            "rating": "70",
            "review_date": "11 oct 2025 5:04 pm",
            "content": "04-10-2025",
            "nose": "smoke, fruit",
            "taste": "fruit, pepper, smoke, vanilla",
            "finish": "pepper, fruit, vanilla"
        },
        {
            "user_name": "YD84",
            "user_rank": "Expert Senior",
            "rating": "89",
            "review_date": "18 feb 2022 8:33 pm",
            "content": "A more elegant, slightly softer version of the 10 year old. Still bursting with that recognisable Benromach character. Superb, even though on some days I prefer the youthful exuberence of the 10.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Martin1965",
            "user_rank": "Expert Senior",
            "rating": "91",
            "review_date": "05 apr 2025 7:14 pm",
            "content": "A masterpiece!",
            "nose": "Sherry, vanilla, no hint of smoke, honey, fruits",
            "taste": "a little smoke, sherry, red fruits, sweet, chocolate aromas",
            "finish": "Medium length with fruit and smoke"
        },
        {
            "user_name": "M134481",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "06 jun 2021 9:23 pm",
            "content": "",
            "nose": "Flowers, meadow, fresh, pineapple juice, light peat, sherry tones, lime, creamy, slightly brown sugar as the Organic, straw or stable",
            "taste": "Honey, white grape, pear, brown sugar, apples, oranges, peach, pineapple juice, butter, light peat, straw.",
            "finish": "Honey, white grape, pear, brown sugar, apples, oranges, lemon juice, peach, pineapple juice, butter, light peat and straw."
        },
        {
            "user_name": "claymore84",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "24 apr 2021 11:01 pm",
            "content": "Blind tasted on 04-24-2021.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "kawhi",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "17 mar 2025 5:34 pm",
            "content": "A little bit of Sherry touch in the center of the bourbon Weak pit in taste",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "kawhi",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "30 jan 2025 12:51 am",
            "content": "2023.09.19",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "notesofmalt",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "02 dec 2021 4:47 pm",
            "content": "Benromach 15 years, 43% alc. Original bottling (2021). Maturation: first-filled bourbon and sherry barrels Nose: My first association is dirty. Charred tobacco, wood ash and roasted nuts, peat smoke. This is followed by cocoa and paprika powder, some black pepper and milk chocolate. A sweetness develops with a mixture of light honey aromas and dark berries. Nice complex nose. Palate: First creamy and then dry very quickly, almost salty. The nuts are back, salted pistachios and malt, plus pleasant fruit aromas. Baked apples, still slightly unripe banana, pepper in dark chocolate. The sweetness is holding back. Finish: Medium to long, almonds, walnuts and malt, with oak and mild smoke aromas. Conclusion: A Benromach the way I love it, complex and dirty, yet wonderfully harmonious and also enjoyable without any deeper analysis. A whisky for every evening at a very high level. 87/100 points (2021). www.notesofmalt.com",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "StefanKatonaXXL",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "07 mar 2025 5:42 pm",
            "content": "I like the Vintage scent, it feels very luxurious. Smell: leathery, spicy and meaty, slightly smoky but also quite sweet like bbq. Chocolate, cherry and some Rum notes. Rubber notes at the end... The taste also has vintage tones with soft peat, rubber, salty undertones, delicate woodiness, vanilla pudding sweetness with a subtle bitterness at the end.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "riegerjonas",
            "user_rank": "Expert Senior",
            "rating": "91",
            "review_date": "12 apr 2021 12:24 pm",
            "content": "2021-04-10",
            "nose": "dark plums, bitter orange, sherry, strong oak, hay ?, raspberries with vanilla sauce, real deep vanilla",
            "taste": "minimally smoky, oak spiciness, strong, tart berries, fruity, distillery character comes through well",
            "finish": "tart chocolate"
        },
        {
            "user_name": "marmeladow",
            "user_rank": "Expert Senior",
            "rating": "96",
            "review_date": "30 nov 2022 1:48 pm",
            "content": "A real discovery for me. First-class casks with sherry, Speyside and the perfectly harmonizing filigree smoke. Highly recommended because complex, harmonious, well matured and dangerously easy to drink. Perfect value for money Tasted over a period of 3 months. Developed very well in the emptying bottle.",
            "nose": ":bonfiresmoke: (very delicate, gentlemanly):malt: :oak: :grape: :blackberry: :cherry: :sherry: :driedfruit: :sweetness: :vanilla: :caramel: :honey: :maritime: (reminiscent of sweet liquorice ) :ginger: :tobacco: :darkchocolate: - complex, multi-layered, ripe for variety",
            "taste": "powerful and complex onset, full mouthfeel. Everything in it, what the nose offered. Plus some :honey: :cake: :pepper: :nutmeg:",
            "finish": "long and complex, nice oak spice and the aromas described above"
        },
        {
            "user_name": "The_Osprey",
            "user_rank": "Expert Senior",
            "rating": "74",
            "review_date": "01 may 2025 10:59 pm",
            "content": "Benromach 15, SSMSW, 43%. 25ml sample from an Inverurie Whisky Shop tasting set. Consumed May 2025. Dark orange. Aroma is charcoal briquettes and dried mulberries, coffee flavoured bonbons, vanilla-infused very creamy coffee with a souring tangy berry note. Fairly airy and mostly just creamy coffee-ish. Hint of cheesiness. An interesting and pleasant aroma. Some decent complexity. Body is watery. Taste is very low-impact, definitely a bit wishy-washy and flat (and this is my first of the evening). Again vanilla-infused bitter cappuccino. Lightly bready and musty oak. Lightly vegetal. Just so flat and watery on the palate. Bit of char on the finish but otherwise it’s not delivering much. Oh dear, not a winner. I fail to see what role this could play on my shelf, unfortunately. 3.1/74",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "RJKrueger",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "29 dec 2020 11:25 pm",
            "content": "I always found the Benromach 10yo very exciting and delicious, so expectations were definitely there at 5 years old and unfortunately they are not really met. Not a bad malt, a bit different but overall not a really significant increase either.",
            "nose": "Light fruits, lemon notes, a slight smoky note, some herbs and tobacco. Not bad, but overall I lack complexity after 15 years, I would have expected more.",
            "taste": "In the beginning, sweetness with light fruits, apples, mirabelle plums, lemons, then a bit of spiciness and the light but clear campfire smoke brings more spiciness into play.",
            "finish": "Medium to long with lingering herbal notes and smoke"
        },
        {
            "user_name": "BarleyMail",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "27 apr 2022 2:57 pm",
            "content": "",
            "nose": "Smoked meat (bacon) on the bbq, dates, chocolate, peach, cinnamon, (lotus) frangipani with a sweet cherry and apricots. A pinch of eucalyptus/mint. How good this smells!",
            "taste": "Oranges, dates, chocolate, peach, apricot, honey, frangipanne, cinnamon, ginger and salt.",
            "finish": "Oranges, ginger, peach, dates and chocolate. Compared to the 10 year old Benromach, this one is a bit sweeter and more complex, but not necessarily better."
        },
        {
            "user_name": "anter",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "19 oct 2025 12:15 am",
            "content": "Despite its 43% ABV, it has a completely unobtrusive dilution, embodying the phrase \"enjoyment whisky\" in a glass-and-cap form. The nickname \"Springbank\" from Speyside comes as no surprise. It has an exceptionally enjoyable funk and a truly unique character. It's no surprise to say it's one of my favorite Core Range bottlings. Price performance: Very Good! Would I buy it again?: Definitely.",
            "nose": "A nice light industrial, slightly funky, dung-like side with a lot of nice but soft sherry influence. Ash and earthy peat. A very light maritime note, perhaps from the peat, but it's a note in the details. A nice sulphurous meatiness, cooked red fruits; red plums. Light cinnamon and tarte tatin. A charcoal and slightly cheesy side within the funk. Vibrant cherries. White black pepper. Dried red plums and grapes with a light nutty back. A leathery side. An iconic nose. Super enjoyable.",
            "taste": "On the palate, it feels higher than its original level; in the sense that it's not overly diluted. The sherry and peat nuances have achieved an extraordinary harmony, marrying perfectly. There's an ashy, charcoal side, and notes reminiscent of a dried red plum, walnut, and cherry reduction. A slightly asphalt-like edge. The funk is still there, but not as pronounced as on the nose; the sherry has taken over a bit more. Confit orange peels. The scent of gasoline. This is truly a super enjoyable peat that remains \"low key.\" Dark chocolate and leather. Super balanced. A medium-high body. Super enjoyable.",
            "finish": "The velvety texture continues on the finish. No flaws are detected. Earthy, bark-like notes with peat. Vibrant, young red fruits and a slight hint of dried apricot. A very light ash towards the end. Exceptional complexity, indeed. A little above medium, with a sufficient intensity. Likewise, it has a finish that could be said to be a little longer than medium. Enjoyable!"
        },
        {
            "user_name": "fnk",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "09 may 2023 6:29 pm",
            "content": "I won't say that I really broke away from the 10...",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "MarcelWhiskyPanda",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "15 feb 2025 8:36 am",
            "content": "",
            "nose": "Light, nice smoke Dry Alte Praline Hong sweet Vanilla caramel Age can also be perceived well in the form of old oak",
            "taste": "Unfortunately a bit watery at the beginning Then the dry sherry aromas come directly and pass on to the honey sweetness/ vanilla and caramel and a mild nut Then come the beautiful oak aromas",
            "finish": "Classic finish Some honey with caramel and nuts Followed by the sherry and oak"
        },
        {
            "user_name": "Nosingbär",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "22 oct 2022 11:29 pm",
            "content": "Had a weak start but develops well in the glass. Has old leathery aromas in the aroma along with fruits and spices, in the taste it is very spicy and unique. I think little knowledge from the sample, but makes me want to discover it in the large bottle. I would say 86 points.",
            "nose": "The already very as and leathery for 15. Roasted coffee beans and candied orange peel. Apricot jam. Honey. Definitely cherries. banana and pineapple. Borrow me a note from Whiskyfun 'cause it's a good fit, curry.",
            "taste": "bitter, slightly oily, delicately smoky. Spiciness. Candied Fruits, Panettone, Coffee, Pepper, Salt.",
            "finish": "The smoke, the pepper and the salt are suddenly the main actors, but also peanuts and a little toffee."
        },
        {
            "user_name": "L_Gillian",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "30 jan 2023 4:31 pm",
            "content": "",
            "nose": "Freshly ground malt, mild green curry, soot, dark chocolate and cured leather.",
            "taste": "Salted pistachios, some honey and a variety of balms and waxes. Brown sauce, beef bouillon.",
            "finish": "Smoked ham, pleasant hearty herbs and slightly smoked wood. Great waxy coating and some waxy notes that linger on."
        },
        {
            "user_name": "Eisieisbaer08",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "01 mar 2021 9:51 pm",
            "content": "",
            "nose": "The first time I've had this Benromach in my glass. The smell has something of smoked bacon, dark fruits and a note of maple syrup and vanilla. A slight hint of mint. Overall very interesting.",
            "taste": "Red fruits, spicy and a gentle smoke. The body is not quite as strong due to the 43%, but a nice drinking strength. I would have liked it a bit better at 46%, but overall very well balanced.",
            "finish": "The finish is longer than I would have expected, the smoke settles nicely and lingers. There is a bit of woody spice and vanilla sweetness. From the initial odor profile to the finish, a very varied dram. I like it!!"
        },
        {
            "user_name": "Collegiate",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "08 aug 2024 4:25 am",
            "content": "Delightful nose. Not overwhelming, but one to take your time with to tease out the subtleties. Sherry, smoke, chocolate, some oakiness. I get a bit of this wet cardboard note I often get from the entry level Bowmores.Taste - surprising bite for a 43% abv. Flavours start with cascades of sweet chocolate, followed by burnt Sherry, astringent. Finish is a lingering smokiness and Sherry.Enjoyable, but I feel like I need to try more Benromach in exbourbon, as I find it a little difficult to get a clear picture of the distillery character amidst all the Sherry and smoke here.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "kramimatsimoto",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "20 feb 2022 9:48 pm",
            "content": "N- beautiful, ever-changing nose with ripe orange, eucalyptus, earthy aromas, dark berries, maple syrup, chocolate, cold stones, leather. Really great what's happening here. No alcohol perceptible, you can hold your nose quite deep in the glass. M- Very mild departure, fruit aromas with subtle oiliness envelop the mouth. Again, nothing super concise aromas, but rather a wide spectrum of berries, nuts, earthy aromas, warm wood. the smoke remains discreetly in the finish, but also gives the whole thing a little more expression",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Rudeboi5000",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "07 mar 2024 10:33 am",
            "content": "",
            "nose": "Feinty peat smoke notes, sweet sherry influence, spices, peppery, citric, apples, light stone fruits, very minimal peat smoke, slight charred cask smoke notes, leathery, zesty, tropical fruits-ish, floral, dried fruits, dark fruits, sweet cocoa , chocolate, vanilla-oak, white fruits, subtle tea-like, assortment of light & dark fruit burst, light medicinal peat",
            "taste": "Medicinal peat, smoky peat, smoky peat, seaspray peat, floral, sherry dark fruits, raisins/dried fruits, chocolate, light tangy, stone fruits, subtle tea-like, bittersweet dark stone fruits but leaning way more on the sweet side, possible sherrybomb with bourbon cask hints, leathery, oily, waxy, mid bodied",
            "finish": "Slight dry, stone fruits, dark fruits, sherry notes (PX), chocolate, cocoa, citric, woody, nutty, white fruit notes in the end, slight vanillin, long, very subtle soapyness"
        },
        {
            "user_name": "Sanma",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "07 nov 2024 1:06 pm",
            "content": "",
            "nose": "Caramel, peat, dried fruit, leather, chocolate, vanilla",
            "taste": "Prunes, Caramel, Salty, Vanilla, Smoky, Orange, Pepper",
            "finish": "Chocolate, earthy, smoky"
        },
        {
            "user_name": "Hsh",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "03 jul 2022 8:37 am",
            "content": "Light peat orange, caramel, slightly salted vanilla",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "PM_ROOT",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "15 oct 2025 10:41 pm",
            "content": "",
            "nose": "Typical Benromach aroma, the company's light smoke in the background, lots of sweetness, dried fruit compote, plums, leather, coffee chocolate with a touch of vanilla.",
            "taste": "Very mild and smooth, quite watery but creamy, with a hint of dried fruit sweetness, plum, and vanilla coffee. A bit of mustiness and oak bitterness.",
            "finish": "Quite long, smoke in the background, still dried fruit, a bit spicy and salty, more smoke at the end."
        },
        {
            "user_name": "CabezaMalteada",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "25 mar 2024 4:56 pm",
            "content": "Full, with development, smooth, very balanced. Shows your age. An excellent example of the distillery's seal. Predominant notes: bonfire, apple compote. Complexity: medium-high. An essential that, with a higher ABV, could be a vintage whisky. 83 - 85 | Very good",
            "nose": "Apple compote, wax, honey, subtle note of campfire smoke.",
            "taste": "Smooth attack, full in the mouth. Round. Light touch of pepper on white meat. Hazelnut notes. Below are the rest of the notes that were promised on the nose. Medium oiliness, high considering that it is barely 43% ABV. The smoke accompanies.",
            "finish": "Medium step, medium-long finish. Toasted caramel. Pepper and smoke linger along with notes of roasted apple, barbecue, and a touch of licorice."
        },
        {
            "user_name": "Stav974",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "06 jul 2023 11:24 am",
            "content": "Excellent drop, quality whisky. nice balance, with this Benromach meaty/leathery smoky funk, fruits and spices.Really enjoyed it but the medium finish let him down a little.At 46% or higher and not chill filtered, it would be fantastic.Love their single casks, usually not much more expensive.Still a very good value whisky",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "PlayerW3",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "03 aug 2024 2:19 pm",
            "content": "",
            "nose": "Unripe red berries, ground coffee, cinnamon, cream toffee, leather, raisin, butter.",
            "taste": "Sweet, toffee.",
            "finish": "Herbal bitterness, oak, cacao, rind of watermelon."
        }
    ]
}