{
    "info": {
        "ws_name": "Royal Brackla 18-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Royal Brackla",
        "ws_age": 18,
        "ws_abv": 46.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/1/8/5643/374965-normal.png",
        "ws_rating": 85.22,
        "ws_vote_cnt": 268,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/185643/royal-brackla-18-year-old"
    },
    "collected_count": 35,
    "reviews": [
        {
            "user_name": "Baanaanaabob",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "08 may 2022 7:20 pm",
            "content": "Yellow fruits, citrus, toffee, citrus, not bad",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "10 jul 2023 1:12 pm",
            "content": "Golden color. Oily whisky.",
            "nose": "Sweet. Fruit. Peach mass. Apricots. Honey. Pears. Apples. citrus. Fresh apples. Maybe even some menthol. Green apples. citrus. A bit of yeast over time.",
            "taste": "Caramel. Vanilla. Fruit. Peaches. Apricots. Ripe. Spices. Cinnamon. Honey. Sweet. Fruity but ripe fruit. Maybe some fruit. Light oiliness.",
            "finish": "Nuts. Then apricots and peaches. Oakwood. Caramel. Spices. Cinnamon. Fruit. Yellow fruits. Maybe some baked apples. Quite a long finish."
        },
        {
            "user_name": "Mapl",
            "user_rank": "Connoisseur",
            "rating": "89",
            "review_date": "18 feb 2022 8:13 pm",
            "content": "Palo Cortado Finish - You should be aware of this when buying this bottle. Palo Cortado is not \"mainstream\" The age, the distillery and the finish go well together for me. Give this whisky time. It probably won't work the first time you try it. Over days, drams and weeks it gets better and better and tastier. Well made, slightly special dram.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "pianoman",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "22 jul 2023 8:36 pm",
            "content": "",
            "nose": "Dry. firewood. summer meadow. Light Grapes. Stone wall. Lemon Thyme. Behind some honey.",
            "taste": "Burnt toast with blossom honey. Some pepper. Then banana and apricot. Vanilla cream. Walnut. Hay.",
            "finish": ""
        },
        {
            "user_name": "DistiLesha",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "25 mar 2025 10:06 pm",
            "content": "A magnificent 18, no worse, if not better, than a 21. Bright, fruity, with distinct touches of the past, of that magical whisky that came out a couple of decades ago. Difficulty of note breakdown: 7/10 22 23 21.5 21.5",
            "nose": "Aroma Dusty bag of grain, malt, green apple, crushed green pear, vanilla, solvent. Pleasant pepperiness, a little bit of metal. A dry board and dried apricots are revealed. Intensity: 7/10",
            "taste": "Thick and sour-sweet pear-apple juice, vanilla, the tip of hot pepper, old-school vintage profile of an old furniture salon, lots of wet wood, passion fruit. Pleasant tartness and a bit of wine dryness. Sweetness: 8/10 Saturation: 8/10",
            "finish": "Sweet and fruity juicy"
        },
        {
            "user_name": "MrGlenfarclas",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "18 aug 2023 11:00 pm",
            "content": "Malty on the nose. citric. Amazingly fresh. A lot of wood on the tongue. Again a very sparkling, citric note. For me closer to the somewhat unround 12 than to the really well-done and balanced 21. Not 100% my case.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "JoshNRW",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "24 jun 2022 12:14 am",
            "content": "The 88 points from my memories after an online tasting (see below) are confirmed again today with a 2nd try with a 5cl sample at home and in a quiet atmosphere. ----------------------------------- Just keywords from an online tasting where you only spend a few minutes with a whisky without properly analyzing it. This is an absolute highlight of today's online tasting. So nicely balanced after the discordant drams before. Oily, intense, broad, light - I really like it and find it super tasty.",
            "nose": "87.5 Simple but balanced and harmonious nose with a modern but not overpowering sherry profile with multiple flavors (sweet, spicy, dry, minimal fruity from dark berries). Not as smooth and round as a classic Speyside standard, for example.",
            "taste": "87.5 Nice, not particularly spectacular start, but with an interplay of spicy, sweet and berry-fruity aromas. As an everyday dram for less than 100 euros, it's definitely not a mistake.",
            "finish": "87.5 The mouthfeel is good, no significant disturbing factors, only slight bitterness from the wood at the end, minimal oily structure."
        },
        {
            "user_name": "DramALife",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "12 jul 2023 6:10 pm",
            "content": "S 7The wet tablecloth on the nose was disruptive, otherwise would have been a great dram. Luckily, it didn't carry onto the palate. The finish fell short of expectation as it came out towards the thinner side for such an age and cask finish.81-85 - Another dram welcomed",
            "nose": "Quite reserved at first. Fizzy sherried spices. Citrus fruits. A whiff of wet tablecloth. Some juicy oak is hidden beneath the prickling nose. Give it 15minsand now honeydew and a touch of morning cereals with golden raisins.Drops of water open up the fruits and suppressed the unpleasant tablecloth notes.",
            "taste": "Medium bodied. Floral essence. Dry and nutty. Crushed peppercorns and cracked nutmeg. Yellow fruits slowly surfacing. Wet malt mixed with oak chunks. It's getting sweeter, providing a good balance to the slightly dry and spicy mouthfeel.",
            "finish": "Medium, slowly drying finish. Cereal lingering with a touch of citrus wax. Quite light despite age reflected by the drying oak."
        },
        {
            "user_name": "2ndSip",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "05 jun 2022 10:54 am",
            "content": "Not super complex on the nose; some fruit, slight acidity. In the taste again fruit, more spiciness, the sherry share comes through well, but is not intrusive. Relatively weak exit for an 18-year-old. If you like light acidity with a certain fruit component, yeah, go, but that's not overwhelming for an 18 at the price. Get a sample first. That's enough for me... [86 - 82 = good whisky -> get (second) bottle? Maybe...]",
            "nose": "first closed, then fruity over time. Citrus tones, tangerine, grapefruit, tart orange, yellow-green apple. In the background vanilla and a little honey. Light malt character. After more time to breathe, a floral note emerges, but it reminds me of wilting flowers in a greenhouse.",
            "taste": "fruity, light spiciness and spices (the sherry comes through much better here). Here, too, the sherry produces more of the sour component to the fruit. Second sip: a lot of fruit, which is now becoming clearer (apple, tangerine, citrus...) and swings slightly sour again. A bitter moment comes into play at the back (coffee powder).",
            "finish": "Medium long... some spiciness from the barrel, the sherry moment with the sour touch of the cortado swings out quite quickly. Bisl fruit, but overall then fades quite quickly."
        },
        {
            "user_name": "Beaker65",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "31 dec 2024 9:02 pm",
            "content": "A subtle Royal Brackla finished on Palo Cortado cask. Fortunately it did not become a sherry-soaked whisky, which happens too much these days. Dried fruit, vanilla, oak and red fruit.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Defeatless",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "10 may 2024 12:16 am",
            "content": "Not that much experience with Royal Brackla, so let's see what this gives me.",
            "nose": "Sweet, bit of orchard fruit. Malt, hay and heather honey are more in the background. Not bad, not great nose either.",
            "taste": "Again sweet. Little bit oily. Very soft and silky. Again the orchard fruits are here, like plums apples and apricote. A tad vanilla is here too.",
            "finish": "Medium length. Silky smooth. A litte bit bitter in the later part of the finish, yet sweet and a little vanilla and cream are dominant."
        },
        {
            "user_name": "craide",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "04 nov 2021 9:12 pm",
            "content": "Very pleasant and fresh looking malt. The nose and the palate are really good, but the finish falls off a bit.",
            "nose": "Slightly sour beginning, a little citrus, grapefruit, plus honey, but is rather reserved at first, then comes more fruit sweetness, malt and grain. Some toasted nuts and almonds come through. But still looks very fresh even at a disadvantageous time.",
            "taste": "Fruity citrus, apricots and mandarins, somewhat dry, with a slightly tingling spiciness. A few exotic fruits like melon and peach mix with it. Fruitiness predominates here and is nicely complemented by wood aromas.",
            "finish": "Medium-long finish, citrus, gentle sherry, nuts and light oak spice."
        },
        {
            "user_name": "Crushed_ldH",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "31 mar 2024 6:23 pm",
            "content": "Feels like a very bright summer drink, even brighter than its 12-year-old. It barely feels like typical sherry (of course it is Palo Cortado finish, which is quite uncommon), so the low score considering its price is probably due to the absence of thick raisins and oakiness. Personally this is kind of a dram that I can be satisfied with the scent alone.",
            "nose": "Apricot, fresh plum, lemon, honey, candied green grapes, very bright",
            "taste": "Peach nectar, grapefruit, honey, black tea, green grapes, lemon, spice, a little bit perfume",
            "finish": "Floral scent, light oak, apricot kernel, apple puree"
        },
        {
            "user_name": "WhiskyBjorn83",
            "user_rank": "Expert Senior",
            "rating": "75",
            "review_date": "20 sep 2025 4:27 pm",
            "content": "07-09-2025",
            "nose": "pineapple, vanilla",
            "taste": "vanilla, pineapple, fruit, white pepper",
            "finish": "vanilla, pineapple, fruit, white pepper"
        },
        {
            "user_name": "Whisky Hamster",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "04 jan 2022 10:38 am",
            "content": "Good but not quite mainstream taste. Leaves a bit of an odd aftertaste for me that reminds of (perfume-free!) soap. Unlike the new 12 yo you need to be aware that the sherry finish comes from a light Palo Cortado so don't expect too much of Oloroso or PX in the taste. I like the ncf/nc/46% abv. craft presentation though this one is a bit rough around the edges and not overly complex @ 18 years of age. Overall still very decent, maybe try before you buy as it it not at all cheap for what it is. In a way you could say that its younger sibling is its strongest adversary. ;-)",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "etwa77",
            "user_rank": "Expert Senior",
            "rating": "89",
            "review_date": "12 nov 2023 12:15 am",
            "content": "with some whiskies, you only realize what great concoctions they are only when you’re down at the last few glasses at the end of the bottle.. not only because of the Palo Cortado, this has been a particularly sweet ending.. there is also some salinity, together with a tasty green apple tartness and spicy ginger.. the finish is less likeable, as a matter of fact, it is short, ending abruptly in a biiter, dry place.. that i feel like the magic has abruptly ended.. which, i guess, is the way magic usually ends.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "The_Osprey",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "29 apr 2023 10:03 pm",
            "content": "Royal Brackla HSMSW Palo Cortado Finish 18 year old 46%. 30ml sample, March 2023.Nice golden colour. Aroma is light but has some complexity. Musty oak, butter, orchard fruit peel, hint of orange peel, lightly flowery. Body is watery. Taste is light and soft, gentle. 18 years and yet only a hint of oakiness integrating with the soft spirit. Faintly fudgey. This was my second of the evening and in hindsight I should have remembered that Brackla should always be the first as it is so soft, clean and ethereal. Classic clean Brackla profile. Builds a bit of a white pepper, prickly saltiness on the linger along with a waxiness. I find it difficult to write tasting notes for clean, soft profiles like this but there is subtly bready spirit, biscuity oak, salt and pepper, and even more subtle spices fruits and flowers. I like this quite a bit and would definitely reach for it regularly if it were on the shelf. Really well put together. At £130 a bottle I’m not likely to invest though. 3.65/87",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "anter",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "17 mar 2025 12:14 am",
            "content": "It justifies its price a little less, roughly the same quality as the 12, but the price is a bit higher. The character is, of course, very different. It's certainly an enjoyable whisky, but it might disappoint those who expect a step up from the 12. A good example of the saying, \"Aging doesn't necessarily mean stepping up\"; age is \"just\" a \"parameter difference.\" Price performance: Medium-good. Would I buy it again?: Maybe.",
            "nose": "Very fruity, ester-like character shines through; pineapple, banana. Mint, walnuts. Nuts. A slightly mineral edge. Very light buttery biscuit again, maybe a slight lacticity; very light. Slightly oxidized green apple. Apple peel, even. Full of yellow fruit; apricot, peach. Yellow fruit jam. Really reminiscent of a hefeweizen with light cloves and cinnamon. A lighter sherry gives way to esters. Pleasant nose. Sufficient complexity, smooth nose.",
            "taste": "On the palate, light acidity, banana, and peach are prominent. Apricot are right behind. Pineapple is evident. Esters share the stage. Very light gray black pepper, with more pronounced cloves and a touch of cardamom. Medium-low sweetness. A nutty, slightly cashew-like nut. A touch more angular than the 12, but only slightly. Minerality is present. Light florality; white flowers; perhaps elderflower. Very balanced, again; suitable for the enthusiast palate.",
            "finish": "Medium intensity. Slightly longer than medium. A settled finish that starts with estery and ends with spice. Light black pepper and guava are added to the palate. Starfruit. Light vibrant green fruits. No flaws. The finish is more successful than 12. The nutty side disappears. Perhaps a bit monotonous in the finish. Good."
        },
        {
            "user_name": "KyleRiemen",
            "user_rank": "Expert Senior",
            "rating": "91",
            "review_date": "14 apr 2023 9:02 pm",
            "content": "",
            "nose": "Sherry, honey, vanilla, toffee, wood",
            "taste": "Sherry, chocolate, toffee",
            "finish": "Nut, nut & nut, wood, sherry, slightly bitter from the wood"
        },
        {
            "user_name": "sidqi",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "02 dec 2021 2:27 pm",
            "content": "",
            "nose": "Some ripe fruits like sweet tangerine and pineapple,creamy and spicy,honeydew,a little cinnamon.",
            "taste": "Sweet and cream,tannin dryness,pineapple,tangerines with some whipped cream,peppery.",
            "finish": "Long and strong spicy,tannin dryness,a hint of bitterness."
        },
        {
            "user_name": "morningside1000",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "21 dec 2024 7:19 pm",
            "content": "Comment: This is surprisingly zesty, fresh and challenging, quite different from the comfort blanket of the Royal Brackla 21YO, OB, and all the better for it. The Palo Cortado finish really brings something to the table in terms of a syrupy Pedro Ximénez red fruit sweetness, but also an elegant floral Fino yeasty freshness (Note to sherry aficionados: I know that Palo Cortado is a spontaneously created lightweight, delicate Oloroso, but the flavours at play here are syrupy vinous sweetness and roast nut salty bitterness). So, is this good whisky or just sweetened grape juice?Colour: Bright lemon gold",
            "nose": "Cereals, ginger biscuits and vinous sweetness, followed by baked apples, white chocolate and red berry, with a brief thread of spearmint at the end.",
            "taste": "White pepper spice, immediately cut through by syrupy ripe red fruit fruits – raspberry ripple? – and a peachy sweetness, followed by zesty floral sherry, medicinal herbs (wintergreen?) and hints of black tea – the palate shape-shifts quite entertainingly, doing an edgy bitter-sweet thing, eventually settling on spicey sweetness. A drop of water really focuses everything and strips out some of the syrup from the palate, without otherwise changing the flavours.",
            "finish": "Initially sherry sweet and then quite drying, followed by black pepper prickle and a final shot of salinity across the bows."
        },
        {
            "user_name": "drwx",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "03 apr 2025 3:36 pm",
            "content": "Nice fresh fruity nutty Brackla with a balanced Palo Cortado finish. Not much better then the 12yo though.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Whiskyisfordrinking",
            "user_rank": "Expert Senior",
            "rating": null,
            "review_date": "24 feb 2023 10:57 am",
            "content": "N: fruity, light pepper, citrus fruits, some sea, fresh breeze, also vanilla. G: light, malty, somewhat creamy. A: stronger here, rather short, quite bitter. Still very nice on the nose, but then it breaks down a lot and becomes much more bitter over time.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "omnts",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "07 aug 2022 9:22 am",
            "content": "tasted 07/24/2022 Sparring partner – Royal Brackla 12 yo Bottled 11/23/2021. Conclusions. A very respectable whisky. Nothing outstanding, but very well made with extremely delicate intervention of wood from under Palo Cortado. Somewhat upsetting is only the excessive influence of the barrel in the aftertaste. In general, a 12-year-old is more solid and harmonious, although I will not hide the fact that the latter also has a number of obvious advantages. Grade 86",
            "nose": "Aroma: restrained at the start, needs aeration. The influence of sherry here is much weaker than in the 12-year-old. Moreover, it manifests itself precisely as a refinement of spirits originally aged in bourbon wood, and not their radical reformatting, as happened in the case of a partner. As a result, we have noticeably more sweet fruits of bourbon origin (ripe peach, tropical fruits) and characteristic citrus fruits, quite a lot of vanilla, butter cream, honey and, in general, sweetness. But significantly less vegetable freshness, as well as spicy and wine shades. Discreet notes of almonds and sawn oak complete the picture. Unlike 12 yo, mature and better balanced. However, I cannot call it particularly complex and fully integrated.",
            "taste": "Taste: here the influence of the sherry cask is much stronger than in the aroma. Energetic enough, with a slight peppery tingle, some moderately hot spices, plenty of honey sweetness, and a decent portion of fruit. Raisins, canned peach, citrus peel, vanilla, light creamy motifs, sawdust aroma, decoction of tart-spicy plants, dry tannins at the end, bitter almonds. Quite embossed with good balance.",
            "finish": "Finish: medium length, sweet-spicy, bitter almonds, dry tannins, light bitterness. After two or three sips, an excess of barrel flavor appears."
        },
        {
            "user_name": "Iron_Calli",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "04 mar 2023 11:49 pm",
            "content": "A very pleasant malt. I actually like it better than the 21 year old. 86 points from me with an upward trend.",
            "nose": "Citrus fruits and honey, sweetness, light wood. Beautiful, very pleasant nose.",
            "taste": "Again, citrus fruits paired with honey, herbal notes join them. Very soft, mild, almost a bit thin. If you take a larger sip, it fills the mouth wonderfully and a pleasant woody spice enriches the picture.",
            "finish": "I really like the exit. Delicious honey waffle, a nice note of almonds, mild and fine. Nice!"
        },
        {
            "user_name": "Rudeboi5000",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "09 jan 2024 12:26 pm",
            "content": "",
            "nose": "Pears, zesty/citric, apples, white & tropical fruits, vanilla, woody (oak), nutty/creamy, prickly, sherry dark/dried fruits, subtle tea-like sweetness, candied fruits, fragrants/perfumy, medicinal spices/roots,",
            "taste": "Spicy, tea-like subtle sweetness, sherry bittersweet, zesty, tropical fruits, medicinal roots or spices, sherry musk, not so thick bodied,",
            "finish": "Quite dry, short to mid, sherry bittersweet, tea-like sweetness, spices, sherry muskiness,"
        },
        {
            "user_name": "KEngelaar",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "16 nov 2024 3:36 pm",
            "content": "Sweet, dried fruits, vanilla, tea, oak and red berries in the nose. Sweet and full-bodied in the mouth with more intense oak towards the end.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "djmaxliving",
            "user_rank": "Expert Junior",
            "rating": "82",
            "review_date": "17 nov 2021 10:09 pm",
            "content": "The nose is most peculiar, I don't dislike the nose but I'm not going to spend forever nosing it? and after the nose, the rest is all downhill.",
            "nose": "Pine leaves, peppermints, sugar, airways chewing gum, fresh and onion spicy mix?",
            "taste": "Spicy, pepper sauce, green mint, and light tree sap. definitely detect the influence of the new cask used, quite a vibrancy for 46%.",
            "finish": "Strong bitter pepper."
        },
        {
            "user_name": "munelicht",
            "user_rank": "Expert Junior",
            "rating": "87",
            "review_date": "01 sep 2024 12:51 pm",
            "content": "From the beginning to the end, it is a whisky that gives a soft and cozy impression like silk or cotton candy without any heavy taste. You may feel that the impact is a bit lacking, but every time that happens, a fairly strong sweetness of fruit appears and makes you feel good. At first, it had a stronger floral impression like perfume, but after drinking more than half of it, the floral scent seems to have lost some of its strength. I think the heyday of this liquor was when there were about 2/3 left. However, considering the purchase price of about USD 130, you may feel that it is a bit lacking in uniqueness or fun.",
            "nose": "Fresh orange or other citrus scent that makes your mouth water quickly. Similarly, elegant floral, rose-like floral scent greets you. Smelling again, other fruits, red berries, grapes, apples, etc. are not strong but distinct. Vanilla also shows up occasionally among the fruits. Only after getting used to the fruits to some extent, a pleasant cereal scent comes to mind.",
            "taste": "A rich and thick sweetness like eating a peach soup, like pickled peaches and honey. The fruity brightness felt in the scent blooms harmoniously in the taste. You can feel a strong sweetness like honey or plum extract, and this makes you feel good. There is a spiciness that is not felt in the scent, but I am not sure what kind of spice it is that seems a little burnt and earthy. Towards the end, a slightly bitter and luxurious grassy feeling like drinking black tea is impressive.",
            "finish": "Other flavors gradually diminish, but the black tea flavor gradually increases over time. Then, the peach preserve flavor from earlier pleasantly wraps around again. Overall, the finish is medium-length, but the black tea flavor lingers in the mouth for a very long time."
        },
        {
            "user_name": "Crovies",
            "user_rank": "Member Senior",
            "rating": "86",
            "review_date": "03 sep 2023 2:15 pm",
            "content": "Value for money score: 85, no obvious flaws but not amazing, simple and delicious without any burden.",
            "nose": "The aroma is fresh and elegant, without obvious alcohol vapor stimulation; At first smell, you can smell the sweet aroma of wheat and biscuits, sweet vanilla honey and cream, and juicy ripe yellow fruits; when you smell it carefully, you can smell light-colored candied fruits mainly composed of apricots, and fresh citrus, apples and pears; after waking up,",
            "taste": "The wine is thicker and fuller, softer and smoother, less greasy and less irritating, and has a fresh and elegant flavor; Top notes: soft and juicy apricots and plums, fresh citrus and fragrant pear, and milky vanilla honey; middle notes: compound spices mainly cinnamon and nutmeg, and spicy woody oak, with a slight Bitter chocolate; base notes, caramel cream and fruit cake.",
            "finish": "Long-lasting, balanced flavor, less greasy; The palate is enveloped by spices such as cinnamon pepper and woody oak, accompanied by ripe apricots and sweet preserved apricots, as well as sweet notes of vanilla honey and buttery caramel."
        },
        {
            "user_name": "pepsi",
            "user_rank": "Member Senior",
            "rating": "87",
            "review_date": "06 oct 2025 5:24 pm",
            "content": "",
            "nose": "Peach, apricot, grain, vanilla, apple, clove, nuts, ginger, green grape, flower",
            "taste": "Peach, apple, grain, vanilla, citrus, nuts, honey, herbs",
            "finish": "Vanilla, peach, cinnamon, woody bitterness"
        },
        {
            "user_name": "zhzhahaha",
            "user_rank": "Member Senior",
            "rating": "86",
            "review_date": "22 aug 2024 2:41 pm",
            "content": "elegant, silky, vanilla, soft fruits citrus, brightened.a bit spicy, the PC cask hides behind bourbon.fine but the PC cask is not shining, anyway, the flavors are there but not really into it. nose 8taste 7finish 7edited after 1 month, kinda good now...soft and citrus and some cakes, consider I bought it around 450 rmb, good",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "NanyangAqua",
            "user_rank": "Member Senior",
            "rating": "89",
            "review_date": "04 oct 2023 9:20 am",
            "content": "enjoyable vanilla, cream, apples, and some spice in this whisky, make people relax and drinkable",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "JJcharles",
            "user_rank": "Member Junior",
            "rating": "88",
            "review_date": "19 apr 2025 2:08 am",
            "content": "Completely different profile from Oloroso/PX matured style and very much different from nowadays’ sweetness highlighted whisky : savory, with yeasty sourness and subtle bitterness.",
            "nose": "Neat: Fresh, yeasty, green apple, fresh prunesWith water: fresh opened tabaco, walnuts, damp grass.",
            "taste": "Neat : apricot, white peach, green grape, mustard, pickled ginger, a little of barely sugar, and black chocolateWith water: fresh walnuts, tabaco",
            "finish": "Medium long, a little salty, the subtle bitterness remains, and some sweetness returned at the very end"
        },
        {
            "user_name": "Akiyama",
            "user_rank": "Member Junior",
            "rating": "86",
            "review_date": "18 may 2024 12:57 pm",
            "content": "balvenie comes to mind..",
            "nose": "",
            "taste": "",
            "finish": ""
        }
    ]
}