{
    "info": {
        "ws_name": "Deanston Virgin Oak",
        "ws_category": "Single Malt",
        "ws_distillery": "Deanston",
        "ws_age": null,
        "ws_abv": 58.5,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/2/3/8912/429337-normal.png",
        "ws_rating": 85.38,
        "ws_vote_cnt": 156,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/238912/deanston-virgin-oak"
    },
    "collected_count": 20,
    "reviews": [
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "26 apr 2025 5:54 pm",
            "content": "Golden color. Quite oily structure.",
            "nose": "Caramel. Toffee. Honey. Very fatty. Dark chocolate.",
            "taste": "Caramel. Toffee. Tropical fruits. Spices. Slightly hot. Ginger. Black pepper. Wax. Honey. Fatty.",
            "finish": "Tropical fruits. Caramel. Toffee. Yellow fruits. Candied fruits. Oranges in syrup. Quite a long finish."
        },
        {
            "user_name": "thijs100",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "08 nov 2023 1:34 pm",
            "content": "Should we conclude the Virgin Oak grabbed the steering wheel a little too agressively? Probably, yes.",
            "nose": "The new oak is rather dominant. Too much almost. Loads of vanilla-flavoured foam blocks, a good amount of ripe bananas and plenty of custard. There’s a tinge of honeycomb, some white chocolate and a few slivers of orchard fruits (apple peel and pear skin, mostly). All the while oak spices linger throughout.",
            "taste": "Creamy mouthfeel. It arrives with the oak spices taking centre stage. Plenty of pepper, some nutmeg, a few cloves. Hints of mulch too. There is an underlying sweetness, highlighted by honey and banana pudding. Just a sliver of beeswax.",
            "finish": "Medium length. Lingering oak spices. Subtle sweetness."
        },
        {
            "user_name": "Rosebank88",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "14 sep 2024 9:34 pm",
            "content": "",
            "nose": "Starts out quite reserved with lots of vanilla, toffee, cream liqueur and coconut. Also slightly spicy oak, some pepper and cooling mint. Needs water urgently. Over time, anise biscuits follow. With water: more open, lively oak, spicy apple compote with anise and cinnamon and a biscuit-like maltiness.",
            "taste": "Powerful start, dry oak, malt, caramel, hot spices, especially allspice and cinnamon but also notes of vanilla and anise. With water: juicy, lively and fruity, apple crumble, compote, brown sugar, oak, grainy malt",
            "finish": "Long, dry oak."
        },
        {
            "user_name": "TechnOBY",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "20 may 2024 9:38 pm",
            "content": "Forest honey, maple syrup, arccacia honey!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "DistiLesha",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "06 nov 2025 8:20 pm",
            "content": "It's hard to call this whisky complex and interesting. However, everything is quite nice, not young, just good and for the money. 21 22 21 20",
            "nose": "Vanilla, malt, cream, dusty grass, lemonade Citro, oak, white pepper, vitamins. Intensity: 8/10",
            "taste": "Sweet, fruity, sulfurous. Cream, vanilla, strawberry-apple marshmallow, menthol, pepper mix, zest, wood. Sweetness: 6/10 Saturation: 9/10",
            "finish": "There's even more menthol, and the finish is dry and woody."
        },
        {
            "user_name": "kawhi",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "20 jan 2025 6:18 pm",
            "content": "\"A sticky, sweet vanilla-flavored chocolate bar\" When I first smelled it, it seemed like it would be heavily influenced by virgin oak, with woodiness, vanilla, and spices. But when I started tasting it, it was a whisky that stood out the most with its rich and creamy sweetness. When I put a little bit in my mouth, the woodiness was a bit more prominent, giving me the feeling of a whisky tablet sold as a souvenir at the distillery, and when I put a lot, it was fun to feel the milk chocolate and rich sweetness more strongly.",
            "nose": "Woody / Vanilla / Simple Syrup / Honey / Orange / Ripe Apple / White Melon / Nutmeg / Milk Chocolate - It has a bit of a sour aftertaste. It feels a bit weaker than the alcohol content. - The woody scent unique to virgin oak is quite strong. The intensity itself feels like it is in the early 4s out of 5, but it feels a bit too strong for me. - Along with the woodiness, vanilla comes very strongly together, and it feels like vanilla syrup mixed with the simple syrup-like sweetness. It also feels like it approaches with a bit of a banana nuance. Also, the sweetness is mixed with a bit of floralness, giving a hint like honey. - A fairly strong orange citrus balances out the flavor with a moderate intensity. If you push the sourness a little, there is a lot of fresh and sweet scent of ripe apple mixed in, and a cool scent of cucurbits such as melon/watermelon. - The spice is not strong, but there is a hint of nutmeg, mixed with a slightly soft and bitter nuance of milk chocolate.",
            "taste": "Chocolate Energy Bar (Milk Chocolate, Caramel, Creamy) / Woody / Vanilla / Ginger / Pepper / Peach / Pineapple / Lemon - As soon as it enters your mouth, a very rich and sweet milk chocolate nuance spreads throughout, with a slight woodiness mixed in. When you are slightly accustomed to the nuance of milk chocolate, take a bite of a chocolate bar like Snickers, and the rich sweetness of caramel inside as if the milk chocolate has melted and disappeared, and the soft creaminess spreads out like a coating throughout your mouth. - Vanilla spreads richly, but it feels somewhat overwhelmed by the sweetness. As if to balance out the overly sweet flavor, ginger or pepper-based spices give a tingling sensation to the tongue. There is some spice, but it is still overpowered by the sweetness and cannot perfectly balance it out. - Once you get used to the sweetness, the peach-like flavor unfolds, and you can feel a slight, tangy, tropical sweetness of pineapple. The sourness of lemon passes by here and there, but it is not strong.",
            "finish": "Vanilla / Caramel / Creamy / Milk Chocolate / Peach Sugar / Pepper / Malt / Apple - The finish is medium to long. - At first, vanilla comes up briefly, but that feeling quickly diminishes. Then, a rich and creamy caramel sweetness similar to what I mentioned earlier comes out strongly. As the sweetness weakens, a milk chocolate with a bit of woodiness follows. - As you gradually get used to the sweetness, the nuance of canned peaches coated with sugar on top of the cake unfolds subtly. A slight peppery, tingly stimulation is felt on the tongue, and there is also a certain amount of sticky, savory, and sweet taste of malt syrup. The finish disappears as it heads toward the final chapter, leaving behind a slight apple-like fruit nuance."
        },
        {
            "user_name": "StefanKatonaXXL",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "13 jan 2024 7:15 pm",
            "content": "The aroma is turbulent, a little too woody and definitely alcoholic with sweet notes like honey plastic and vanilla pudding. The taste is a bit alcoholic, but very sweet, with a honey finish, quite pronounced nutmeg.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Casketje",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "09 oct 2023 2:42 pm",
            "content": "It's young, feisty but all in all has quite a lot of flavour. One of those \"I want to finish on something strong\" type of drams. A bit too turbulent (I guess that's the right word) to just sit down and enjoy quietly.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "rattenfanger",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "21 sep 2025 11:37 am",
            "content": "Simple and uncomplicated whisky, in addition to that it's rather sharp at full strength. Extra water tames its youthful character, but does not bring any complexity, the whisky gets even more woody and bitter. To my surprise I could not find so typical for virgin oak creamy and custard notes. Perhaps it is too young for such flavors to develop.",
            "nose": "spirity and punchy. Fresh wood, green grass, vanilla pastry, green apple. After 10 minutes or so it opens up with more honey, sweet floral notes, a touch of lemon. Malty when adding water.",
            "taste": "a bit sweet and burning feeling. More of alcohol kick, than spices. At full strength very simple and edgy. It improves a bit with water, but shows more bitter and oaky notes.",
            "finish": "chili, vanilla, walnut, citrus. Short to mid-long. With water eucalyptus freshness."
        },
        {
            "user_name": "aquataste",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "08 jul 2024 10:19 pm",
            "content": "",
            "nose": "Fresh, aromatic green apples, vanilla pudding, heather honey, cinnamon and pepper, barley malt, freshly cut wood, forest floor, nut nougat, dark chocolate, grassy, slightly citrus, ginger, minimally floral, spices, leather notes in the background",
            "taste": "Fresh, lots of aromatic green apples, a pinch of pepper and cinnamon, brown sugar, freshly cut wood, notes of forest floor and earth, slightly grassy, citrus, slightly floral, vanilla, heather honey, dark chocolate, delicate oak bitterness, spices in the background leather notes",
            "finish": "Long, dark chocolate, notes of freshly cut wood, some green apples, minimal citrus, a pinch of cinnamon"
        },
        {
            "user_name": "Peatyjohn",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "18 oct 2025 4:36 pm",
            "content": "Having tasted and got through a few bottles of the standard virgin oak I thought it time to meet its big brother. He turned out to be quite aggressive on the taste and needed water to bring out its character I enjoyed in the standard version. Vanilla, wood, caramels, honey, banana, green apple, ginger and barley. Not dissimilar to the standard version but that’s the problem, it adds nothing to the original standard version, just more alcohol aggressive. Not sure it’s worth the upgrade from the regular version.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "M_A_S_K_A",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "16 may 2025 6:59 pm",
            "content": "",
            "nose": "honey, green apple, fruits, vanilla, yeast dough, banana, pie",
            "taste": "dry, honey, vanilla, wood, fruits, ginger, spices",
            "finish": "above average, honey, fruits, ginger"
        },
        {
            "user_name": "Whiskymoravia",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "30 apr 2024 2:20 pm",
            "content": "More than a class better than classic virgin oak. Vanilla, strong and sweet drink. I will definitely have it again.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "plutoes",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "07 jan 2025 3:35 am",
            "content": "Deanston Virgin Oak CS Batch 1 stands out as a complex and well-crafted expression. Unlike its lower ABV counterpart, this batch delivers a consistent and pronounced green apple note across both the nose and palate. The interplay of fruity and spicy elements, along with the robust character of the higher ABV, makes it an intriguing and enjoyable dram. It offers a rich, layered experience that evolves with each sip, making it a delightful choice for those seeking depth and complexity in their whisky.",
            "nose": "Top Notes: Honey, green appleBase Notes: Ginger, banana, lemon zest, nutmeg, vanillaHint: Butter bread",
            "taste": "Top Notes: Banana, green appleBase Notes: Dried wood, chestnut (raw), ginger, Korean rice drink (Sikhye)Hint: Lemon peel",
            "finish": "Palate-Top Notes: Green apple, vanilla syrup-Base Notes: Malt extract, ginger, green chili pepperNose-Top Notes: Green apple, chestnut (raw)-Base Notes: Ginger, lemon zest"
        },
        {
            "user_name": "Daan2",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "05 jun 2025 7:17 pm",
            "content": "Mooie Deanston. Soort Bunnahabhain cask strength vibes",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "palo_klabnik",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "29 jul 2025 7:38 pm",
            "content": "Tropical fruits, black pepper, chilli, wood, vanilla. Not great, not terrible. Adding water brings out sweet pastry and brown sugar.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Qiefangbai",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "29 dec 2025 4:11 pm",
            "content": "The aroma is more important than the taste.",
            "nose": "Minerals, red fruit candy, honey, apples, pollen, peaches, wood.",
            "taste": "Honey, caramel, peach juice, apple, chocolate",
            "finish": "Woody notes, some alcohol, chocolate, caramel, tannins"
        },
        {
            "user_name": "Stouby",
            "user_rank": "Expert Junior",
            "rating": "81",
            "review_date": "25 nov 2025 2:48 pm",
            "content": "Light yellow. Nose: Honey, sweetness. Taste: Citrus, oil, slightly spicy, slightly smoky, light body. It doesn't get any better than CS. Vault.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "BWI",
            "user_rank": "Member Senior",
            "rating": "86",
            "review_date": "10 mar 2024 1:23 pm",
            "content": "Nose: Oak remains dominant over the distillate. Lots of spice, wax, vanilla, apple, and pear. A touch of chocolate to soften the wood. A nose that mellows with oxidation in the bottle. Palate: Creamy and spicy with notes of salted caramel, pepper, and nutmeg. Quite full-bodied and powerful. Melliferous and rather indulgent with orchard fruits and chocolate. Finish: medium. Spicy and fruity. Balanced whisky on the palate although a little too marked by wood, particularly on the nose. The effect of oxidation in the bottle works in its favor. The lower the level, the less angular the face of this whisky becomes. The waxy and spicy side stands out more.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "VizArd",
            "user_rank": "Member Senior",
            "rating": "84",
            "review_date": "05 aug 2025 11:48 pm",
            "content": "",
            "nose": "sweet; caramel, pear.",
            "taste": "sweet-peppery; caramel, pear, pepper, citrus, oak bitterness.",
            "finish": "short."
        }
    ]
}