{
    "info": {
        "ws_name": "Glen Grant 10-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Glen Grant",
        "ws_age": 10,
        "ws_abv": 40.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/2/3/51/56985-normal.png",
        "ws_rating": 78.12,
        "ws_vote_cnt": 292,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/2351/glen-grant-10-year-old"
    },
    "collected_count": 31,
    "reviews": [
        {
            "user_name": "Malzbrenner",
            "user_rank": "Photo Moderator",
            "rating": "84",
            "review_date": "20 may 2020 3:05 pm",
            "content": "In the afternoon I was given this whisky by a friend and yes, it amazed me. Although traded as a beginner's whisky, it was convincing as a casual dram, especially in view of a very fair price!",
            "nose": "Honey, ripe pears, sandalwood, raspberries and white vineyard peach.",
            "taste": "Very soft and fruity with a nice honey note. The palate contains pear, apricot, quince and vineyard peach.",
            "finish": "Rather short, but with a fruity sweetness."
        },
        {
            "user_name": "Dris",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "28 sep 2018 12:26 am",
            "content": "Absolutely nothing is outstanding about this dram. It doesn't give you much, but it's not half bad. Very tame.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Slàinte Mhath",
            "user_rank": "Super Administrator",
            "rating": "79",
            "review_date": "03 aug 2019 3:34 pm",
            "content": "Older, independently bottled Glen Grants can be of exceptional quality after having slept in oak barrels for a few decades. This 10-year-old expression, however, is a very simple and undemanding Speyside single malt. The aroma is understated, sweet and fruity with hints of pears, nuts and fresh hay. Spicy, young and spirity in the arrival, there are notes of lemon juice, red currants and honey before dry refill cask bitterness takes over. Wood tannins and faint vanilla characterize the rather short finish. A cheap beginners whisky without any complexity.RATING: 3.0/5.0 stars ≙ 79 pts → AVERAGE",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Cubey666",
            "user_rank": "Connoisseur",
            "rating": "77",
            "review_date": "15 aug 2019 9:41 am",
            "content": "really easy, perhaps a bit too easy. quite sweet and malty",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Andytka3",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "11 dec 2016 5:58 am",
            "content": "N- Breezes of flower garden, orchid, oak tree, fresh green leaf and orchard fruits. Hints of cool copper, touch musky wood and alluring tropical lychee. P- Crisp and dry. Subtle wood dust infuse with fruity fragrant. Gentle and elegant. T- Chewy and orchard fruits. Chilli spicy building up gradually and diminished with a trace of warming ginger. — at The Whisky Bar, Kuala Lumpur.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "markjedi1",
            "user_rank": "Connoisseur",
            "rating": "77",
            "review_date": "17 jan 2013 12:59 pm",
            "content": "This is as easy as the NAS-version The Majors Reserve (which I favour). Still less than 25 EUR.<?xml:namespace prefix = o ns = \"urn:schemas-microsoft-com:office:office\" />",
            "nose": "The nose offers white orchard fruit (green apples and pears), with hints of vanilla, immediately upholstered with oranges, toffee and clear hints of dried grass. Nutmeg and cinnamon. But it is all very lightfooted. A bit too light, to be honest.",
            "taste": "On the palate, it shows a light body with loads of vanilla, breakfast cereals and some woodspice. Even some sultanas. The sweet malt stays in the lead and again turns this into an effortless malt.",
            "finish": "The finish is short, light on pepper, apples and oak, with a slightly bitter finale."
        },
        {
            "user_name": "Tom na Gruagaich",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "30 jan 2019 10:40 pm",
            "content": "Sweet, mild, soft, pear and caramel. In the mouth then caramel, sweet fruit notes and some wood. Sweet finish with caramel and oak. A pretty round, but good all-day Speysider.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "karloff",
            "user_rank": "Specialist",
            "rating": "60",
            "review_date": "20 feb 2013 2:31 pm",
            "content": "Glen Grant is always cheap and that`s because it`s just your everyday malt, the sort you would give to someone who popped round to say hello. This isn`t to say that this is a bad malt, i enjoyed it and recommend it to someone starting their whisky journey.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "karloff",
            "user_rank": "Specialist",
            "rating": "60",
            "review_date": "20 feb 2013 2:19 pm",
            "content": "This is  your average joe malt which isn't a bad thing i still enjoyed it. This was a birthday presant off my daughters.",
            "nose": "Caramel straight away with a light fruity nose of apples pears and a wift of barley.Nice but nothing out of the ordinary.",
            "taste": "Quite smooth and creamy with bitter green apples and spice.Light in body.An everyday man malt.",
            "finish": "A light and refreshing smooth and creamy malty finish."
        },
        {
            "user_name": "Mr.Edradour",
            "user_rank": "Connoisseur",
            "rating": "75",
            "review_date": "25 apr 2016 3:45 pm",
            "content": "Simple mainstream dram, good enough for day to day use, if you like drinking whisky every day. ;-)",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "granella2003",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "13 jan 2013 4:58 pm",
            "content": "",
            "nose": "Full and intense aromas of sweet sherry and red fruit with very attractive notes of figs and dates",
            "taste": "Clear influence of sherry is noticeable with beautiful tones of oak and recurring red fruit, with a particular cherries emerge. Further hints of dark chocolate and yoghurt can be observed",
            "finish": "An aromatic aftertaste with hints of sweet sherry and vanilla"
        },
        {
            "user_name": "aby",
            "user_rank": "Connoisseur",
            "rating": "78",
            "review_date": "28 feb 2013 3:46 pm",
            "content": "retasted this one at the Glen Grant distillery. In my opinion it is not a `whisky of the year 2013` (Jim Murray), but i liked it better than last time i tasted it  78p.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Feusi",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "18 jul 2011 9:13 am",
            "content": "An easy drinking dram, sweet malt, honey and vanilla. Nice and warming finish. I guess you have not to look/search anything special in that whisky. Just enjoy it.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Defeatless",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "02 jun 2016 9:59 pm",
            "content": "Nose:Straight and hones bourbon-barrel Scotch. Vanilla, wood, toffee, and floral notes. Hint of confectionery citrus. Touch of marzipan and a feint of tannins.Taste: Classic taste, vanilla-ed toffee, fruit marmalade. Body:Smooth as silk, yet stripped of oilyness by chill filtration Finish: Medium; a bit dry, honey, mixed nuts, citrus and some toffee again.Price:Very fairly pricedPresentation: Sober but decentComments:A rather good daily dram, don't expect firework, just whisky in it's most plain form. Yet a very well balanced price-quality whisky.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Magnus Hillman",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "19 sep 2014 5:41 pm",
            "content": "It's not bad at all, wish it was bottled at a higher strength. Even at 43% ABV it would have been much more substantial.(Rating interval 79-82)",
            "nose": "Fruity nose, honey, soap, vanilla, subtle spices, I'm not sure what spices, but wood spice I think. Vanilla fudge and some floral element in this, feels quite complex.",
            "taste": "Light texture, weak on the palate, too weak to really deliver the flavors of the nose. Black pepper and confectory, sweet malt, some pear and malt sugar and raw sugar. The spices are there far, far back.",
            "finish": "The finish is short with black pepper and licorice together with some sweet malt."
        },
        {
            "user_name": "Numwierum",
            "user_rank": "Expert Senior",
            "rating": "75",
            "review_date": "04 jan 2017 9:52 pm",
            "content": "For the price okay, nothing more. I do not buy a bottle of it, because I, other cheap representatives, taste much better.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "AdelphosHume",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "10 jan 2019 7:46 pm",
            "content": "An easy to enjoy, uncomplicated malt. It's a bit young without being immature. The smells and tastes are enjoyable, but brief and fleeting.",
            "nose": "Creamy candied lemon peel and sweet osmanthus blossoms, light malt with a faint black pepper and menthol note, light vanilla and caramel, fresh plums and guava, and a touch of almond fading into the alcohol burn.",
            "taste": "Mocha and creamy raspberry liqueur , a touch of caramel, baked vanilla custard, candied orange peel, light floral honey and black pepper, and wave of fresh plums and apple liqueur.",
            "finish": "Dark chocolate and coffee, bittersweet floral (osmanthus), and drying oak tannins mixed with a very faint bitter-almond-esque maltiness."
        },
        {
            "user_name": "Rino Rotten",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "18 apr 2017 7:03 am",
            "content": "Very good daily dram, goes down really easily. Great price-quality ratio.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "chlinatele",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "12 mar 2017 5:59 pm",
            "content": "Good whisky for the price. But not as good as JM says. I agree....",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "D3US",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "09 oct 2012 6:54 pm",
            "content": "I really love the sweetness in this, it's rather lovely. A nice mix of floral and fruit, honey and vanilla. But the malt is really great in this whisky. Yummy.",
            "nose": "Very floral, malty and sweet. Vanilla and a bit of spice. A bit sharp, slightly nutty and some sour fruit.",
            "taste": "Intense sweetness, nutty. Floral, fruity and incredible malt. Vanilla and honey, some spice and coconut.",
            "finish": "Medium length. A slight bitter note but it's nice. Floral still, sweet fruit, vanilla and honey, and right at the end some subtle malt."
        },
        {
            "user_name": "Ben Bruikman",
            "user_rank": "Expert Senior",
            "rating": "77",
            "review_date": "01 dec 2022 9:49 pm",
            "content": "Glen Grant 'The Major's Reserve' is a single malt whisky from the Scottish Speyside region. It is one of the founders of single malt whiskys as we know them today. This whisky is very popular because it offers a refined taste at a good price. The color is light gold",
            "nose": "On the nose, the Glen Grant Major Reserve is soft with a relatively dry bouquet of aromas that includes fruity notes including green apple and melon. This drink has a delicious and fruity twist on the nose.",
            "taste": "The taste is a perfect continuation of the nose and has a creamy and fruity palate. The nose is wonderful, the taste is delicious so of course the aftertaste is also very tasteful and comfortable.",
            "finish": "The light dry aftertaste contains soft tones of nuts that come together wonderfully, creating a delicious finish that will not disappoint. The Glen Grant Major Reserve is a whisky that is definitely recommended for novice whisky drinkers to get to know with the beautiful distillate."
        },
        {
            "user_name": "Jonkers",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "03 dec 2012 4:29 pm",
            "content": "The nose is the best part. Taste and finish are disappointing.",
            "nose": "Vanilla, oak and malt. Butterscotch and some honey. Fresh like mowned grass. Intense and a hint of saltiness.",
            "taste": "Sirupy and spicy. Vanilla and malt and also a hint of liquorice.",
            "finish": "After the spiciness there is not much about the other flavours. A little sweet but that unimpressive."
        },
        {
            "user_name": "m884",
            "user_rank": "Expert Senior",
            "rating": "79",
            "review_date": "19 nov 2012 7:59 pm",
            "content": "Nose: fresh, apple drink, floral - greens + flowers, hay, hints of honey - all relatively subtleMouth: sweet, a bit honey, malt sugarFinish: honey, sourness of red berries like red currants, grassy, sweet applesComments: A very subtle dram, very light and summery, good for a hot day to enjoy. Not much wrong here but too superficial and one dimensional for a above average score.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "BottleBox",
            "user_rank": "Expert Junior",
            "rating": "71",
            "review_date": "02 dec 2014 4:54 pm",
            "content": "",
            "nose": "Malt, mandarin, pear, yeasty",
            "taste": "Green pepper, spicy, rather flat",
            "finish": "short finish without any special events"
        },
        {
            "user_name": "axanderpamm",
            "user_rank": "Expert Junior",
            "rating": "72",
            "review_date": "15 nov 2023 7:51 pm",
            "content": "Not a whisky that will make me happy, but a distillery that I want to explore further.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "aprager",
            "user_rank": "Expert Junior",
            "rating": "79",
            "review_date": "30 jun 2011 10:19 am",
            "content": "Easy to drink if you like sweet whiskies.",
            "nose": "Nutty, plenty of malt and honey",
            "taste": "Syrupy, walnuts, honey",
            "finish": "Long creamy finish with some dark chocolate"
        },
        {
            "user_name": "Travelller",
            "user_rank": "Member Senior",
            "rating": "74",
            "review_date": "23 sep 2021 8:18 pm",
            "content": "74/100",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "theo22",
            "user_rank": "Member Senior",
            "rating": "78",
            "review_date": "20 nov 2018 6:29 pm",
            "content": "This whisky is not bad. In his way he is almost perfect.  Only he is pretty boring.  I think that's the most boring single malt I've ever had.  The small \"Major's Reserve\" is a composite of joie de vivre and character compared to this one.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Austin.Foster",
            "user_rank": "Member Senior",
            "rating": "84",
            "review_date": "29 sep 2014 12:22 am",
            "content": "",
            "nose": "Apples and pear on the nose, intensely fruity.",
            "taste": "Butter crème, and bourbon-y sweetness on the palate.",
            "finish": "Light cocoa and almonds that turns to fruit on the finish."
        },
        {
            "user_name": "hansreitzema",
            "user_rank": "Member Senior",
            "rating": "80",
            "review_date": "14 jan 2017 12:50 am",
            "content": "July 2, 2016  Aroma  Spirit, melon, leather, grass.  After water: buttercup  Taste  Sweet red fruit, raspberry, anise  Finish  Medium, dry, it becomes somewhat salty  Particularities  No",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "ga815648",
            "user_rank": "Newbie",
            "rating": "80",
            "review_date": "14 oct 2024 2:13 pm",
            "content": "apple, honey, vanilla, sparkling, butter, nutty finish",
            "nose": "",
            "taste": "",
            "finish": ""
        }
    ]
}