{
    "info": {
        "ws_name": "Glenallachie 15-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Glenallachie",
        "ws_age": 15,
        "ws_abv": 46.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/2/4/8393/446579-normal.png",
        "ws_rating": 85.91,
        "ws_vote_cnt": 202,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/248393/glenallachie-15-year-old"
    },
    "collected_count": 23,
    "reviews": [
        {
            "user_name": "robain",
            "user_rank": "Specialist",
            "rating": "84",
            "review_date": "09 jun 2024 1:22 pm",
            "content": "For me, i dont think it tastes like a classic sherry. It tasted like a first fill new oak",
            "nose": "Spicy, oak, some tropical notes",
            "taste": "elegant spicyness",
            "finish": "elegant oak, sweet"
        },
        {
            "user_name": "thijs100",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "17 jul 2024 3:29 pm",
            "content": "It's not subtle, but sometimes that's okay.",
            "nose": "Big, dusty sherry notes initially. Plenty of oak and lots of raisins, plums, figs and blackcurrants. Just a sliver of cough syrup too, followed by a hazelnut puree, burlap and maple syrup. Rather delicious, I’d say.",
            "taste": "Syrupy and plenty of dark, intense red fruits. Much like the nose, really. But oak spices are slightly more present. There’s pepper, cinnamon and cloves, as well as touches of mocha, some ristretto and bung cloth.",
            "finish": "Medium to long. Dark chocolate, a hint of eucalyptus and syrupy berries."
        },
        {
            "user_name": "wisekyofcourse",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "24 jun 2024 10:34 pm",
            "content": "nose: cooked and candied fruits, sweet, with black grapes, figs, very sweet dates malt, buttered caramel and strong rancio; on sweet spices, tea mouth: peppery spices, the cooked caramel returns, toasted sensation, the creamy sherry, the custard, the edge of the pan, cooked fruit, poached pear, sweet cooked peach, then grapes and sweet fig return of strong coffee, dark chocolate, bitterness final: on rancio, roasted caramel, bitterness, peppery spices, nutmeg; velvety cooked fruits, strong coffee, wood shavings; simple but lasting finish and scents that remain at the bottom of the palate.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Sporx",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "23 oct 2024 10:09 pm",
            "content": "aroma sherry, plum, raisins, wood spice The taste Creamy, sweet, sherry, wood spice aftermath Medium length, pepper, sherry sweetness 86++",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "glen efze",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "04 oct 2024 9:17 am",
            "content": "Glenallachie has changed the design, which, as always, has caused mixed reactions in the community. I think the design is successful, it was high time to banish the Flintstone font. However, the whiskies in the core range should not have been changed. The 2024 bottling has a dark mahogany color, which shows that this is indeed a whisky with a focus on sherry. But that is exactly Billy Walker's core competence. glen-efze.de",
            "nose": "In the nosing, this is a nice sherry whisky that has a strong alcohol content, but also a mixture of fruit and spice. The fruit has sweet peach, also a little canned peach, and there are also a few cherries and raspberries. This is contrasted with a slightly dusty spice, the dust is reminiscent of real cocoa powder. There are also nutty aromas, but they are not too strong; the fruity-sweet component is in the foreground.",
            "taste": "A tart-sweet fruit component unfolds in the mouth. This is not the massively boiled plum jam - but the plum is there with notes of grated orange peel and a little sweet orange juice. A few drops of water open up the whisky further and dampen the alcohol, it then becomes more caramel with notes of chocolate and a little nougat.",
            "finish": "The aftertaste of the whisky is not too sweet, there are still bitter aromas with a little spice - but the sherry notes are not forced and penetrating, but combine well. The wood is not noticeable. My taste memories are not the best and the old bottling is empty. So I can't say whether the bottlings have changed. Overall, it remains a very good whisky, drinkable, heavy on sherry without being overloaded, simply delicious. How long will it be around, because it will end at some point or change when the old stocks of barrels are used up and the whiskies distilled under Billy Walker's direction are bottled? They will be different, the capacity has been massively reduced and the fermentation time massively increased. That will change the character - but of course it will be massively exciting. Until then, this is a wonderful whisky that is easy to sip. For a price that starts at €67 in summer 2024, you can do that."
        },
        {
            "user_name": "junyvyao",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "24 jan 2025 1:02 pm",
            "content": "Miss the pure sherry cask-aged version before 2021",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "2ndSip",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "17 mar 2024 10:04 am",
            "content": "Overall, the flavors are all a shade or two darker and significantly more complex and balanced than the 12er. But it also needs a good while to come out of the kink, i.e. contact with air is good for the malt. You can certainly take it apart in terms of flavor - but you have to/should take your time; I think the PX barrels take a little longer because the sweetness increases over time. The taste is great again, everything you can expect from a 15er sherry malt. For me, worlds better than the 12. [91 - 87 = extremely tasty -> it's best if I get a second bottle]",
            "nose": "dark aromas, fresh fruits and dried fruits in a balance, raisins, cherries, apricots; Blossom honey, light caramel, toffee, butterscotch, milk chocolate. Typical sherry seasoning and spices. Floral bouquet, sweet heather. A fresh orange aroma appears with a delay along with a note of marzipan. There is a little more spice from the sherry cask, generally the sherry needs a little time to develop, but then it is really good. You can also notice a slight cellar musty note (a positive aroma for me), and it also has a slightly dusty, old leather binding. Then a nice note of marzipan appears again, it becomes increasingly sweet... so it changes again and again over time and pushes different flavors forward.",
            "taste": "spicy, dark fruits, figs, raisins, dark red cherries, tannins on the tongue, cocoa, blossom honey, dark chocolate - complex in the mouth... always new impressions. 2nd Sip: fruity, sweet (brown sugar, marzipan), dark flavors again, spice from the sherry cask, sherry spices; The Oloroso takes the lead and nut aromas emerge (especially hazelnut and oily Brazil nut).",
            "finish": "long finish, dark aromas, lots of spice from the barrel, lots of sherry spices stick to the tongue and palate; Leather, tobacco, dark chocolate, lots of cocoa content."
        },
        {
            "user_name": "waldwhisky",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "02 may 2024 6:35 pm",
            "content": "On the border of 87, very good barrels, good aromas, but rather short in the finish, in cask strength this should be Yew Temptation",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Crushed_ldH",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "04 may 2025 2:27 am",
            "content": "It went renewal in 2024 (maybe only the label?), but it shows minimal taste differences compared to the old presentation. Even though someone says that Glenallachie range is the result of re-racking, the aroma and taste is superb and it is the best whisky for beginners who want to try heavy sherry whisky.",
            "nose": "Quite winey, plum jam, honey, yellow peach, clove, date, guava, vanilla, alcohol",
            "taste": "Distinct tannic influences, raisins, chocolate, dried plum, cinnamon, clove, meadows, slightly peach",
            "finish": "Chocolate, vanilla syrup, raisins, walnut shell, some flower petals"
        },
        {
            "user_name": "KIMCHIBaby",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "07 jan 2026 4:44 pm",
            "content": "Light yet intense, flat but still carrying a quiet depth.",
            "nose": "Chocolate, tobacco, leather, cherry, pistachio, nuts, spicy",
            "taste": "Chocolate, sherry, leather, nutty, cocoa powder",
            "finish": "Coffee, chocolate, espresso, nutty, soy sauce"
        },
        {
            "user_name": "kawhi",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "19 mar 2025 11:28 pm",
            "content": "Dark chocolate nuance is prominent. The aroma is weak, but the taste and finish are good. 2025.03.20 Immediately after opening",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Erik1702",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "02 mar 2024 9:47 pm",
            "content": "Nose: Sweet, cherry, spices, oak, malt, some orange, some cinnamon ••• Taste: Sweet, cherry, oak, spices, malt, slightly mineral ••• Finish: Medium long, sweet cherry with slight spice remains ••• Conclusion: On the nose you can expect sweet cherry juice with spicy notes. The taste is very sweet cherry in the foreground. There are also spicy notes and oak. A nice whisky. Intense cherry and spicy notes. However, not much more. Not too complex for 15 years. The 46% fits very well.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "saiii",
            "user_rank": "Expert Junior",
            "rating": "85",
            "review_date": "08 dec 2025 7:51 pm",
            "content": "",
            "nose": "Strong paint note with vanilla and a heavy malt-syrup sweetness. Improves slightly with air, bringing out some jammy fruit.",
            "taste": "Noticeable alcohol yet feels watery and a bit rough. Raisins and dried fruit, dark chocolate, berry jam with raspberry and blackberry, dark and light brown sugars, nuts and a strong tannic edge.",
            "finish": "Medium to short with pronounced tannin, thick syrupy sweetness, vanilla, spice and a touch of white pepper."
        },
        {
            "user_name": "maximewouters",
            "user_rank": "Expert Junior",
            "rating": "86",
            "review_date": "27 may 2024 3:02 pm",
            "content": "first sight this whisky looks deep and dark, almost watered coffee with a red shine to it. oily in texture with slight pigment stains on the glass. medium legs and a clear rim.the nose brings oxidized red fruits and chocolat bitters. some dark overripe prune, and some alcoholic notes.the palate brings dark sherry, caramel, dark chocolatemaple and stewed red and black fruits. some roasted nuts aswell thanks to the PX.almost as if you would dip a dark cherry under a chocolate fountain, and sprinkle it with some roasted nuts.finish brings warmth and tpwards the end more spices: cinnamon, vanilla, white pepper.in my opinion, could have used a bit more freshness or aroma complexity to make it to the 90 point categorie.very warm and perfect for the Christmas holiday if you love un-peated, and want something to share with the whole family.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "_Unknown_",
            "user_rank": "Expert Junior",
            "rating": "82",
            "review_date": "12 apr 2024 6:54 pm",
            "content": "Our heather honey hallmark, alongside orange peel, cocoa and ginger, with caramelised brown sugar on the finish.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "whiskywynn",
            "user_rank": "Member Senior",
            "rating": "77",
            "review_date": "26 mar 2025 8:39 pm",
            "content": "Great nose - floral, caramel, cherries. Palate is more caramel, toffee, dark chocolate, oak spice. Great dram.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Mefiu666",
            "user_rank": "Member Senior",
            "rating": "84",
            "review_date": "20 may 2024 4:33 pm",
            "content": "z- gingerbread, dried fruit, dates, pepper, raisins, dark chocolate, nougat, a bit of alcohol, not well hidden, but of good quality; s- cohesive; f- quite long -84",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Firefly113",
            "user_rank": "Member Senior",
            "rating": "85",
            "review_date": "01 dec 2025 7:04 pm",
            "content": "",
            "nose": "Sweet, creamy, jammy, candy, vinous, nutty",
            "taste": "Less sweet than the aroma, there are pepper, toffee, candy, black berries (currant, blackberry, cherry)",
            "finish": "Medium, sweet, sherry-like, with some spice. Good balance. Age has made it calm and mature."
        },
        {
            "user_name": "barscience",
            "user_rank": "Member Senior",
            "rating": "86",
            "review_date": "10 jan 2026 6:59 pm",
            "content": "On the nose, very spicy, heavy, and dark with notes of blackberry, caramel, and toffee, as well as a multitude of spices. The palate is equally intense and complex. I detect dark fruit notes, including prunes, blackberries, and dark cherries, along with raisins and a hint of orange peel. The sherry influence is pronounced and almost heavy on the whisky. Alongside a pleasant sweetness, the whisky has a distinct bitterness. Tingling, spicy oak, ground pepper, and cinnamon give way to notes of herbal tea, chocolate, roasted nuts, and hints of coffee. An exciting whisky with so much to discover and a lot of enjoyment. But also a whisky you can't pour yourself every day. Sometimes the sherry notes are almost a bit too heavy for me, almost a bit too dark.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Denis_Ljubisavljevic",
            "user_rank": "Member Senior",
            "rating": "78",
            "review_date": "29 jun 2024 11:01 pm",
            "content": "Interessante Farbe da  fehlen  10% dann hätte er echt Potential Ich finde ihn eigentlich zu dünn",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "VizArd",
            "user_rank": "Member Senior",
            "rating": "88",
            "review_date": "06 aug 2025 12:44 am",
            "content": "This is a very sherry malt. Sherry casks (Oloroso & PX) add rich chocolate notes, especially on the palate.",
            "nose": "chocolate-raisin, creamy caramel, candied fruit.",
            "taste": "sweet with confectionery spices, caramel, dark chocolate.",
            "finish": "medium; oaky, nutty and chocolatey astringency."
        },
        {
            "user_name": "physeter",
            "user_rank": "Member Senior",
            "rating": "94",
            "review_date": "10 jan 2025 8:03 pm",
            "content": "The aroma has a wonderful floral bouquet, with dark fruits and syrup, which spreads without being overbearing. The taste is complex, the blend remains, but ginger is added. A soft, full feeling in the mouth that lasts until the finish, when the bouquet lingers.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "rrombouts",
            "user_rank": "Newbie",
            "rating": "82",
            "review_date": "28 dec 2025 7:11 pm",
            "content": "A lot of spice on the nose, Christmas spices just the way you like them. With notes of chocolate—not bitter, but rather the sweeter milk chocolate. This combines with sweeter apricots. A clear hint of European oak/sherry on the nose. On the palate, the sweetness, combined with the spice, dominates. The finish is medium. Not my favorite whisky, very accessible without being overly complex. Personally, I prefer a bit more layering.",
            "nose": "",
            "taste": "",
            "finish": ""
        }
    ]
}