{
    "info": {
        "ws_name": "Glen Grant 18-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Glen Grant",
        "ws_age": 18,
        "ws_abv": 43.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/2/1/9297/494975-normal.png",
        "ws_rating": 85.29,
        "ws_vote_cnt": 216,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/219297/glen-grant-18-year-old"
    },
    "collected_count": 15,
    "reviews": [
        {
            "user_name": "Izzino",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "04 aug 2025 7:47 pm",
            "content": "Aroma: Very fresh, malty, yellow, with orchard fruit honey, stone fruit profile, but also vegetables in the background - it feels very summery to me Taste: however, the whisky is very woody, tannic, unbalanced, with a bitter finish - this is not my cup of coffee - the finish is so honeyed, fruity, but I'm still bothered by the musty box the fruit was in * If you don't know what things taste like in an old cottage, we've just broadened your horizons.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "minialkoff",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "09 dec 2023 9:28 pm",
            "content": "20,5+20,5+20+20,5",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Whisky Hamster",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "25 apr 2024 11:34 am",
            "content": "One of the most wonderful malt whiskies I have ever had this is not. But wonderful enough, an honest ex-bourbon work horse of an 18 year old. The working man's 18 so to speak with enough complexity and (surprisingly but satisfyingly) enough aroma density reg. its 43% abv. If this came with the 48% of the 12 or 50% of the 15 it would surely score a bit higher even. Highly recommended if you find the 1 liter bottle sub 100 EUR, unless you are a sherry snob. ;-) For me this is the \"sleeper 18 yo\" counterpart to the recent Speyburn 18, which should cater more to the sherry snobs. XD",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "kawhi",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "19 apr 2024 11:20 pm",
            "content": "At the bar.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "novachenko",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "01 dec 2023 11:51 am",
            "content": "I liked the 15-year-old better",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "bl0wb4ck",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "10 oct 2023 10:26 pm",
            "content": "Disappointing. Citrus and bitter oak. Blindly I would have given him a maximum of 13 years.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Raistlinmejere",
            "user_rank": "Expert Senior",
            "rating": "89",
            "review_date": "29 nov 2025 3:00 pm",
            "content": "It can be said to be the best bourbon kibble food, and considering the price, it's hard to find a competitor. However, compared to the older version, the sense of enjoyment and harmony has slightly diminished, and the woody tone is more pronounced and stiff. Rating and suggested retail price: CNY 550/1000ml",
            "nose": "There's absolutely no alcohol taste; although it's a bit mild, you can smell ginger, apple juice, honey, vanilla, and butter bread. The sweetness becomes more pronounced in the latter half, making it incredibly pleasant.",
            "taste": "Almost no alcohol scent. It's like apple soda, but with noticeable tannins and woody notes. It carries some spiciness from oak and mixed woody notes, a hint of new wood acidity, and a touch of lacquer.",
            "finish": "It has a distinctly acidic and slightly sweet dry woody note, with pronounced tannins and hints of orange peel and apple core. Bitterness is not prominent, and the overall style is neutral to slightly serious. The finish includes a touch of apple flesh with peel, which becomes increasingly noticeable. The intensity is moderate, and the length is medium."
        },
        {
            "user_name": "Peatyjohn",
            "user_rank": "Expert Senior",
            "rating": "78",
            "review_date": "26 sep 2025 7:30 pm",
            "content": "For the price, did not meet expectations. Watery and thin, not unpleasant but for price. Light and fruity but almost tastes like an entry level. A better option is the 15year old and it’s a lot cheaper.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "anter",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "18 sep 2025 5:25 am",
            "content": "A truly enjoyable Core Range bottling; delivering the distillery's character in a sessionable and flawless manner, without overwhelming the consumer, is ultimately one of the most important things one can ask for from a Core Range bottle. While there's no mention of chill filtration, it's likely that it was used, and the finish is somewhat tinged with it. Despite this, it's quite enjoyable. Price performance: Good, Medium-good Would I buy it again?: It's a bottling I'd definitely keep at home for around €70-€110. The fact that it connects single malt lovers with both novice and casual drinkers is a big plus.",
            "nose": "Light vanilla, cracker, and full red apples. A very slight spice, perhaps black pepper. A slight banana-like esteriness. Pears. A creaminess that fades over time. The breadiness also fades over time. Light clove. A full, elegant nose with sufficient complexity. Nectarine and green stone fruit nuances unfold over time. Light toast. Quite enjoyable.",
            "taste": "A light, juicy body on the palate. Lively, slightly sour green apples. A subtle florality and a nice wood spice; black pepper. Brioche-y texture and a slight lemoniness, perhaps cedrat. Tangerine Turkish delights. While truly elegant, it doesn't feel overly watered down. While not the world's most complex whisky, it's quite interesting and sessionable. Beautiful!",
            "finish": "The finish is medium-short, with a medium-low intensity. The spicy notes intensify a bit here, but notes of green stone fruit and green apple linger on the palate until the end. Again, slight lemony, perhaps lime-like accents. It's quite smooth, without any flaws, but it all dissipates a bit too quickly."
        },
        {
            "user_name": "Mugis",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "09 feb 2025 5:19 pm",
            "content": "",
            "nose": "Sweet, vanilla ice cream, pear, brown sugar. A little wood on the nose for an 18-year-old. Apple. Lemon cake.",
            "taste": "The flavor reveals a spiciness from the wood, accompanied by a malty sweetness that transitions into slightly sour pear. Very mild.",
            "finish": "Sour-sweet fruit, delicately spicy. Butter pastry."
        },
        {
            "user_name": "Sanma",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "06 nov 2024 12:23 pm",
            "content": "",
            "nose": "Apple, pear, flower, malty, vanilla, honey",
            "taste": "Vanilla, floral, malty, apple, honey",
            "finish": "Malty, toffee, vanilla, floral"
        },
        {
            "user_name": "mirkomick",
            "user_rank": "Expert Senior",
            "rating": "91",
            "review_date": "04 apr 2025 3:03 pm",
            "content": "Sits right in between the 12 and a 25 in terms of what you get out of it. If you think the 12 is the vanilla king, this one beats it out of the park, and it also has the great floral quality a 25 has, just not as expressed as a 25 year old",
            "nose": "A full nose of vanilla sugar, floral lawn, fresh green fruit (a mixture of apple and pear). Settles down and becomes sophisticated after 10 minutes in the glas. The vanilla goes in the background and the floral, grassy notes come to the front. After 18 mins there is a light oak note appearing",
            "taste": "Oaky, soft vanilla, green apple, candied apple, grain",
            "finish": "Vanilla, candied apple, creamy barley sugarmedium to long finish, suager, barley, malt stays quite a while"
        },
        {
            "user_name": "KlausBlaueDer",
            "user_rank": "Expert Junior",
            "rating": "96",
            "review_date": "07 may 2023 3:20 pm",
            "content": "",
            "nose": "+++",
            "taste": "++",
            "finish": "++"
        },
        {
            "user_name": "Eug300",
            "user_rank": "Expert Junior",
            "rating": "85",
            "review_date": "27 jun 2023 10:54 pm",
            "content": "B: 43%, filtered, colored, watery texture, pale gold color. 18N: apple syrup, citrus, vanilla, floral, ginger. 23P: vanilla, citrus, spice, apple. 22F: citrus, vanilla, spice. 22I must say that the overall impression is good but not more than that. No information about the absence of chill filtration and coloring. Dispite the watery texture, there is an intense fruity vanilla nose and a sweet well balanced palate. The finish is quite long with a citrus aftertaste. Everything depends on the price (recomended till 90€). Reviewed 5.8.2022",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "ziggy1104",
            "user_rank": "Member Junior",
            "rating": "61",
            "review_date": "02 sep 2025 7:28 am",
            "content": "It failed to impress on its own during the whisky club tasting. Of the 24 participants, only one scored over 80 points. The vast majority even went down to 45 points. Complaints included the overly pronounced alcohol note for a 43% alcohol content and the lackluster aroma and flavor. This was further reinforced by the comparison with a Skapa 19 (WB 261639 = 71.7 points) and Clynelish 15 (WB 279183 = 75.7 points), which performed far better with younger whiskies and higher alcohol content. The alcohol content was significantly less pronounced, and the nose and aroma had a lot to do with it.",
            "nose": "",
            "taste": "",
            "finish": ""
        }
    ]
}