{
    "info": {
        "ws_name": "Glenmorangie 12-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Glenmorangie",
        "ws_age": 12,
        "ws_abv": 40.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/2/7/2123/490380-normal.png",
        "ws_rating": 82.29,
        "ws_vote_cnt": 164,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/272123/glenmorangie-12-year-old"
    },
    "collected_count": 15,
    "reviews": [
        {
            "user_name": "thijs100",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "16 sep 2025 1:42 pm",
            "content": "Sweet and largely balanced, the oak does tend to come out ever so slightly on the palate.",
            "nose": "Subtle, gentle and polished, this leaves a very creamy, custard-esque first impression with an indubitable orange-y element. More like candy oranges than the fragrant oils from an actual orange peel, but pleasant nonetheless. Then a soft note of underripe bananas and jammy apricots.",
            "taste": "Bottled at 40 per cent but a somewhat buttery texture still. I was going to write cloves and oranges, but I might as well say orange pomander – not that I’ve ever eaten one. Anyway, a slight oaky bitterness as well, followed by a touch of ginger and a hint of shortbread.",
            "finish": "Short to medium. Creamy vanilla, a touch of grain and somewhat leafy."
        },
        {
            "user_name": "pianoman",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "11 apr 2025 8:58 pm",
            "content": "",
            "nose": "Mild. Butter cookies, a hint of honey, a touch of vanilla. Dried mint. Sawdust.",
            "taste": "Light. Butter cookies. Bright grapes, a hint of peach. Walnut. Cocoa nibs.",
            "finish": ""
        },
        {
            "user_name": "Mugis",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "29 mar 2025 7:46 pm",
            "content": "",
            "nose": "Lavender, malt, honey, mint, light fruit",
            "taste": "Sweet, a little ginger, malt, spicy, sparkling",
            "finish": "oak, drying, grain"
        },
        {
            "user_name": "Whiskopij",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "07 sep 2025 4:10 pm",
            "content": "A simple whisky for every day.",
            "nose": "Fresh. Simple. Refreshing. Pleasant. Apple. Pear. Orange peel. Lemon peel. Vanilla. Honey. Minerality.",
            "taste": "Orange. Pear and apple. Vanilla. Honey. Cream. Flowers appear, meadow. Delicate spices.",
            "finish": "The sweetness of the fruit quickly fades. Bourbon and floral notes remain. Dryness appears. Oak. Pepper."
        },
        {
            "user_name": "AgentMunky",
            "user_rank": "Expert Senior",
            "rating": "70",
            "review_date": "15 dec 2025 1:32 am",
            "content": "7/7/7",
            "nose": "Perfectly classic nose.",
            "taste": "Vanilla cream, malt grain, fruit/leather spice, sweet, and fun.",
            "finish": "DON'T add water."
        },
        {
            "user_name": "CellarToberi",
            "user_rank": "Expert Senior",
            "rating": "91",
            "review_date": "29 sep 2025 4:28 pm",
            "content": "Satisfying at 40% ABV. Matured in 1-st and 2-nd fill American white oak ex-bourbon casks. Chill-filtered. Coloured. Slowly forming straight primary legs. Thick slow secondary legs. Droplets.",
            "nose": "Fruity: citrus: orange; fresh fruit: apple, pear, quince; stone fruit: peach, apricot, dark cherry; tropical fruit: overripe banana. Cereal: barley malt, hay, sweat bread, grain. Floral: heather, lemongrass, fragrant. Spicy: pepper, mint, baking spices, cinnamon, clove, tea. Sweet: honey, caramel, vanilla, orange chocolate. Woody: toasted oak, oak spices. Nutty: almond. Earthy: must. Herbal: leaves, grass, straw. Oily: cream. Rich: crisp, clean. Full body: balanced, delicate. Water pushes up fruity notes.",
            "taste": "Sweet: honey, vanilla, toffee, caramel, maple syrup; Fruity: fresh fruit: apple, pear, quince; citrus: orange, lemon, tangerine; stone fruit: peach. Maritime: salted caramel. Spicy: pepper, cinnamon. Woody: white oak. Nutty. Cereal: malt. Floral. Herbal: leaves, delicate herbs. Oily: cream, mouth coating, dairy note. Full body: balanced, fresh. Rich. Water extends the development.",
            "finish": "Long. Sweet: honey, vanilla, caramel. Oily: cream. Woody: oak. Nutty. Spicy: pepper, clove, baking spices, salted caramel. Fruity: citrus: ripe orange; candied fruit. Cereal. Full body: satisfying. Water pushes up sweet and fruity notes."
        },
        {
            "user_name": "Tony007",
            "user_rank": "Expert Junior",
            "rating": "85",
            "review_date": "17 aug 2025 8:48 am",
            "content": "In the context of a 12-year old 40% it is good, actually better than Glenlivet 12, a notch lower than Glenffidich 12.Notes are simple yet fruity and vanilla all over. Being part of LVMH makes it great addition to your Ardbegs to start a flight with it.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "JustAngelos",
            "user_rank": "Expert Junior",
            "rating": "83",
            "review_date": "12 aug 2025 7:26 am",
            "content": "Great! I don't miss any of the elegance and vibrancy of the old 10-year-old; I even think the extra two years suit it well. In my opinion, this is probably the best starting point for anyone who wants to get to know whisky.",
            "nose": "Initially, it arrives surprisingly quickly, with crème brûlée and orange peel at the forefront. After the alcohol evaporates, softer aromas of vanilla, ripe summer fruits and golden kiwi emerge, with a very delicate wood spice in the background.",
            "taste": "Wonderfully clean, with honey, orange, and malt sweetness, then developing into an ethereal, aromatic, floral, and tropical aroma. It's a good wine for its 40% ABV, very flattering.",
            "finish": "The palate doesn't linger long, leading into a smooth, elegant finish. Summer blossoms, citrus zest, and lychee linger on the palate, fading with a slight dryness."
        },
        {
            "user_name": "Repas",
            "user_rank": "Member Senior",
            "rating": "81",
            "review_date": "09 dec 2025 8:50 pm",
            "content": "Nice nose. Good for beginners. Nothing extra for experienced whisky drinkers.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "jakubpoltoraczyk",
            "user_rank": "Member Junior",
            "rating": "81",
            "review_date": "29 dec 2025 7:59 pm",
            "content": "Aroma: Sweet and gentle, with clear notes of vanilla, honey, and green fruits, apples and pears, followed by peach, orange, and delicate hints of caramelTaste: Exceptionally smooth and beautifully fruity, peach and orange come through clearly, accompanied by a distinct vanilla sweetness and a subtle hint of cake, the finish is gentle and creamy, vanilla fruity in character, with a pleasantly spicy touch at the endOverall Impression: A very pleasantly surprising whisky, the price is highly attractive considering the quality, making this an ideal whisky for beginners",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "konung",
            "user_rank": "Newbie",
            "rating": "72",
            "review_date": "01 may 2025 9:40 pm",
            "content": "Kind on a sweet side. A lot of peach with a hint of honey and pear. And much less floral if compared to 10 year version.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "samvdleek",
            "user_rank": "Newbie",
            "rating": "70",
            "review_date": "15 jun 2025 1:29 pm",
            "content": "More subtle and less present",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "DanielDmx",
            "user_rank": "Newbie",
            "rating": null,
            "review_date": "19 aug 2025 12:06 pm",
            "content": "Not a fan. Hints of pineapple, lemon on the nose, but the taste is rather weak for that kind of price.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "pain_0",
            "user_rank": "Newbie",
            "rating": "75",
            "review_date": "22 apr 2025 9:07 am",
            "content": "",
            "nose": "Dark chocolate, stone fruit(apricot or peach), orange peel, nuts(not as dry as almond or walnut, more like pistachio?), grape, a little bit of petrol",
            "taste": "spicy(not like pepper spicy, more like dried red pepper or sth), milk chocolate, very oaky(personally doesn't prefer morangie's oaky taste. So it could be over estimated),",
            "finish": "short Finish. grape, spicy, a lttle bit of cucumber or oriental melon or unriped melon."
        },
        {
            "user_name": "Janus1974",
            "user_rank": "Newbie",
            "rating": "75",
            "review_date": "16 oct 2025 1:53 pm",
            "content": "Lekkere en toegankelijk whisky waar de sinaasappel goed merkbaar is met een prettige nasmaak van carameltonen",
            "nose": "",
            "taste": "",
            "finish": ""
        }
    ]
}