{
    "info": {
        "ws_name": "anCnoc 12-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "anCnoc",
        "ws_age": 12,
        "ws_abv": 40.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/2/3/9/54814-normal.png",
        "ws_rating": 80.35,
        "ws_vote_cnt": 1326,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/239/ancnoc-12-year-old"
    },
    "collected_count": 54,
    "reviews": [
        {
            "user_name": "Dris",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "02 jan 2016 10:04 pm",
            "content": "A fairly simple dram in highland style. Heather and dried hay are prominent along with honey notes. Very light in body. Savoury and drying  finish. Classic highlander at a young age.No explosive flavours here. Simple and easy-drinking.SGP:3612016.01.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "lincolnimp",
            "user_rank": "Connoisseur",
            "rating": "78",
            "review_date": "22 dec 2015 6:42 pm",
            "content": "Very easy to drink, too easy to be honest. A good session malt, as Karloff says its cheap and I think it is good value too.This should be bottled at 46% all the time not 40%, I know there is some at 43% and 46% which i would like to try to compare.",
            "nose": "the most obvious notes to me are honeydew melon mixed in with lemon sherbet sweets.There is also icing sugar, lemon soft fruit sweets.Slight notes of grapefruit and after a time in the glass some banana (some may describe it as vanilla)",
            "taste": "Its a little bitter and a little thin initially and cardboardy, nothing like the nose suggests?There are some bubblegum notes and after a while some sweetness at the back of the palate.There is something creamy also, like buttercream. There is some fruit in there on fresh bitter pineapple along with slight wafer notes.",
            "finish": "Approaching medium, still on bubblegum but the bitterness has faded."
        },
        {
            "user_name": "Slàinte Mhath",
            "user_rank": "Super Administrator",
            "rating": "83",
            "review_date": "03 aug 2019 4:51 pm",
            "content": "Distillery names can be a bit confusing: Knockdhu, Knockando - so let's just call this single malt anCnoc which is Gaelic for 'black hill'. Fruity acidity, sour berry mash and lemon zest are first to arrive on the nose, but there is a diverse mixture of fresh, floral and malty notes lurking in the back. The taste is spirit-driven, spicy and mildly dry with tropical fruits, heather honey and brown sugar. Just shy of medium length, the finish evolves with a touch of cinnamon, oak and licorice. A good 12-year-old entry-level malt which is flawless, easy-drinking and reliable.RATING: 3.5/5.0 stars ≙ 83 pts → ABOVE AVERAGE",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "peatbogger",
            "user_rank": "Specialist",
            "rating": "80",
            "review_date": "24 mar 2016 12:45 am",
            "content": "mild, light, pleasant, easy drinkable",
            "nose": "strong on citrus, very ripe honey melon, apples",
            "taste": "feels initially very thin, then very spicy at the back of the tounge, chilli, then citrus, turning sweet and more fruity at the end",
            "finish": "dandelion petals (yes, I eat them...) a little pepper, some malt, dry medium lenght"
        },
        {
            "user_name": "Dre73",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "05 apr 2021 1:47 pm",
            "content": "Easy drinker, and quite some taste for a 40% Abv whisky, not thin or watery. Don't expect a very full or complex dram, but for its money it's just good to go.",
            "nose": "Nose starts off fresh and fruity, floral, citrus, vanilla. Not very intense, but good to go for a 40% Abv.",
            "taste": "Sweet, orange, honey, floral again. Not too thin or something, quite some bite for a low Abv.",
            "finish": "Sweet, some orange, pretty smooth now, and pretty short as well."
        },
        {
            "user_name": "maltaholic",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "15 may 2016 8:30 am",
            "content": "A good mix, spicy and fruity, but a bit weak on the chest. Not much to discover.  For the price but quite ok.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Andytka3",
            "user_rank": "Connoisseur",
            "rating": "76",
            "review_date": "03 dec 2016 2:35 am",
            "content": "2nd Tried:- March 2016N- Potpourri of sour berries, petals and floral. Grassiness and earthiness at spines with charming vanilla and caramel.  Soft and lightly thin on the muscle, but a friendly dram nonetheless. P- A contrast to the nose, solid liquid on mouthfeel. Zesty with soft honey and airy burnt sugar texture, crepe suzette. F- Short - medium, light flaw on the entry. Caramel sticking around with gentle build up on pepper spiciness. — at The Whisky Bar, Kuala Lumpur.***First Tried: Sept 2015 / Weighted Rate:- 76ptNose:- Promising start, aromatic, honey and fruity with hints of bell pepper. But thin and light, aroma didn't hold well, faded away. Palate:- Touch of caramel and creme brulee, toasted. Quite robust and zesty. Lightly spicy, spices, hold well on palate. Finish:- Medium length. Sweet barley follow by gentle warm of pepper. — at The Whisky Bar, Kuala Lumpur.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "30 may 2023 2:22 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2023/05/21/yet-more-loose-ends-spring-2023/With this non-theme still going strong, here’s four more for the tasting archives. First up, a seminal malt all whisky enthusiasts would do well to have on their perma-shelf.N: At first, freshly cut [orchard] fruits, soon followed by offerings along the lines of stewed fruits and sweetened well-ripened melons with a floral honeyed aroma over straw,… and from Serge – dandelions! I’ll further add: broad beans, peas in the pod, corn flour, and daisies to this subtle yet beguiling brew.T: Reminding me somewhat of Balblair of a similar age and strength, this is not disappointing at 40%. Indeed, there’s plenty of fight from this minimum-strength-bottled malt with a more than reasonable distillate/cask balance that holds onto some weight and texture. Adding just a drop of water provides grapefruit notes and more of that dandelion bitterness. Neat, stewed fruits, caramel, waxy maltiness,…. either way, it’s never dry or drying.F: More caramel and light milk chocolate towards the tail over a charred oaky mash. Could there be more age to this than the 12 stated? C: It’s been a fair while since I visited this one but it still remains a firm favourite and a strong alternative to Balblair 12. Either way, Inverhouse are happy.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "19 sep 2016 8:47 pm",
            "content": "Four An Cnoc’s by the sea include the ‘Cutter’ WB, 12yo WB, 16yo WB and the 22yo WBN: Assured, sweet, cereal nose. There's a little more sherry in the standard An Cnoc 12yo now [2016] than i remember compared to the lighter, bourbon led bottlings from the 1990's. Descriptors include fuzzy sawdust, a little char and melon & elderflower wine. GoodT: Aah yes, that's the An Cnoc house style i identify with. It comes in lighter on the palate than indicated on the nose. Starts on honey then with a true honey-malt-sweet journey. Then sweet, yet sour too. Behaves impeccably.F: Cereal sweet with a little waxy-dry mouthfeel and a touch nutty. Medium lingerings.C: Fine in its own right, although the 16 seems to have MORE,.. of the same. WBScores a C+",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "30 nov 2015 10:48 pm",
            "content": "N: Pineapples and bananas begin the fruit parade with a honeyed, yeasty, malty, grainy and floral nature with biscuit notes. Overall a mild-sweet Speyside number with a not unexpected floral, citrus [lemon] freshness, T: Sweet and light floral, although muted [a little weak] with some freshness and a cloying body but overall sweeter than its closest Speyside neighbours. Also theres a chalky maltiness. F: More sweetness leaning to bubblegum, a touch of freshness, caramel, pistachios and chalky lemon.C: Im really enjoying this bottle as i did the first dram I tried as a novice - at the Station Hotel in Stonehaven. Back then it seemed so sublime with its clean, mild sweet profile and light, white wine colour. Years later I translate this as a non offensive, honest, simple, value Highland/Speyside [Eastern Highlands] dram. Shame about the abv.Scores a C+",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "13 mar 2014 4:32 pm",
            "content": "N: Pineapples, bananas, honey, yeasty, malty, grainy, floral and biscuit notes. Mild sweet Speyside number, floral, citrus [lemon] freshness, T: Sweet, although muted [a little weak] with a cloying body, light floral and some freshness but overall sweeter than its close Speyside neighbours. Also theres a chalky maltiness. F: More sweetness, this time bubblegum, a touch of freshness, caramel, pistachios, chalky lemon.C: Im really enjoy this bottle as i did the first dram I tried it at the Station Hotel in Stonehaven as a novice. Back then it seemed so sublime and i remember it being lighter in colour, cleaner and less sweet. Now I receive this as a non offensive, honest, simple, value Speyside/Highland dram. Shame about the caramel and abv.Scores a C+",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "dRambo",
            "user_rank": "Connoisseur",
            "rating": "76",
            "review_date": "31 oct 2018 10:38 pm",
            "content": "on the whole - bahh - you can just drink like that but I think the price is much better",
            "nose": "Pear drops, citrus zests, mineral acid, roasted flour,",
            "taste": "slightly alcoholic, mineral, citrus notes - but not necessarily of a delicious variety, nutty bitterness - only light, slightly metallic, fruity pricklend  with the second sip something more pleasing",
            "finish": "Liquorice, citrus, malty, sour, here comes some nice oak tones"
        },
        {
            "user_name": "thijs100",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "04 aug 2022 10:52 am",
            "content": "Overall the anCnoc 12 Years is a perfectly fine, affordable single malt, but it also feels like there's so much more potential there.",
            "nose": "Opens up on notes of honey and sweet barley husks, as well as a touch of lemon zest, chalk and warm butter. That's followed by apple skin and an assortment of white berries. Finally a candy-esque touch of marshmallows.",
            "taste": "Somewhat sweet and rather easygoing with plenty of similarities to the nose. Some chalk, but mostly barley husks, lemons and also some bitter grapefruit this time around. There are some oak spices as well, but they are kept in check.",
            "finish": "Short to medium with some vanilla custard, pears, wood and chalk."
        },
        {
            "user_name": "KB201",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "21 jan 2022 6:37 am",
            "content": "This sweet, fresh single malt comes from the Knockdhu distillery.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Totoro",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "30 aug 2018 2:27 pm",
            "content": "Beats many other entry-level 12-year-olds. The minimum strength doesn't feel, the casks involved were nicely active, and a touch of leathery liquorice elevates what might otherwise have been a somewhat too middle-off-the-road, mainly ex-Bourbon-cask whisky into a higher stratum. Decent finish as well.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Tom na Gruagaich",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "30 jan 2019 10:11 pm",
            "content": "light fruit, light mineral notes, beautiful licorice notes, slightly dry, oaky finish. Easy Drinking, but with draft. Nice.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "dramspotter",
            "user_rank": "Connoisseur",
            "rating": "67",
            "review_date": "19 feb 2019 1:57 am",
            "content": "",
            "nose": "Golden oaty",
            "taste": "poor - reminds me of those awful Glenfiddich in the mouth",
            "finish": ""
        },
        {
            "user_name": "karloff",
            "user_rank": "Specialist",
            "rating": "78",
            "review_date": "21 dec 2015 2:45 pm",
            "content": "This is a really fine whisky and for the price you pay for it, it's for nowt.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "karloff",
            "user_rank": "Specialist",
            "rating": "78",
            "review_date": "01 dec 2010 9:07 pm",
            "content": "Another every day every occasion malt. An anniversary presant off my wife Clare x",
            "nose": "What hit me first was the smell of plastic then toffee, followed by honey and lemon, green apples and refresher sweet, some peach in there and a pinch of white pepper.",
            "taste": "Smooth with new wood and hints of citrus fruits, some tinned peach juice and a fine white wine.",
            "finish": "Amedium but very smooth finish"
        },
        {
            "user_name": "Malthead19",
            "user_rank": "Connoisseur",
            "rating": "69",
            "review_date": "06 mar 2020 8:17 am",
            "content": "- an honest straightforward single malt with slight corners and edges  - not necessarily suitable for beginners, because the taste is still too alcoholic, despite 40% it looks very strong and powerful,  - In terms of character, he looks significantly younger than 12 years  - Unfortunately there are many better 10 and 12 year standard bottlings in the price segment",
            "nose": "slight fresh character, citrus, pineapple, grapes",
            "taste": "lax approach, then strong, strong development on the palate (alcohol pressures), fruit (grapes, tropical fruits),",
            "finish": "strong, short finish;  alcoholic, dry fruity aftertaste, this is where the oak comes out again"
        },
        {
            "user_name": "HammerHead",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "01 mar 2015 4:54 pm",
            "content": "A very fruity and floral nose with marzipan, turkish delight and honey. The taste has honey, vanilla, turkish delight and a cane surgaryness to it. The finish is short with a mild and soft honied liquorice feel to it.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Calmar",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "26 may 2017 11:08 am",
            "content": "Again, the basic silence, from which you do not expect anything, proved to be quite good - the light and airy aroma turned out to be very rich and varied, the taste / finish is not so good, it's very unassuming, but the negative middle class does not cause a negative. In its type reminded the top ten Glenmorangi.",
            "nose": "Open, light, the first nose - grain, wet tree; flower-lemonade, lollipops, light minerality, again grain and wood, but already in the background as a frame; light citrus notes - tangerines, red oranges; and a few exotic fruits - mango, lychee, pineapple.",
            "taste": "Oak, with sourish fruity notes, light peppery wave, sweet caramel, grain tones, it's very simple.",
            "finish": "Spicy, cereal, with light moonshine notes, orange peel, sour caramel."
        },
        {
            "user_name": "Allandale",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "02 apr 2017 11:37 am",
            "content": "Very drinkable and enjoyable.",
            "nose": "Very aromatic,smooth,fruity. Pineapple?",
            "taste": "Smooth,creamy vanilla notes. Very soft note of fruit. A light but smooth body. Easy drinking.",
            "finish": "Creamy, oaky. Sweet herbs."
        },
        {
            "user_name": "granella2003",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "25 dec 2012 3:23 pm",
            "content": "",
            "nose": "Soft but intense aromas of honey and lemon and subtle notes of oak, dried fruit and sugar",
            "taste": "A sweet taste with a pleasant fruity flavor and a lively bite of lemon, lively but not overbearing. Caused by ingredients like honey, green pear and star fruit.",
            "finish": "Long, smooth finish"
        },
        {
            "user_name": "DistiLesha",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "05 feb 2021 7:45 pm",
            "content": "Nice floral bourbon light whisky. It will appeal to both beginners and sophisticated whisky lovers. An unassuming approach to dram in an evening setting will brighten up your cozy evening with a glass. A little water will do the trick, but it will slightly open this malt.",
            "nose": "Bananas, home brew, dust. Breathed: flowers, wet young willow twig",
            "taste": "Bittersweet, lollipops, caramel. Breathed: a little pepper, lemon, creamy-creamy, floral-bourbon.",
            "finish": "Bitter and intensely woody."
        },
        {
            "user_name": "tribe",
            "user_rank": "Connoisseur",
            "rating": "76",
            "review_date": "06 jun 2021 11:02 pm",
            "content": "Was a bit boring, nutty and woody, not my thing",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "hsmithjr",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "02 sep 2011 12:50 pm",
            "content": "",
            "nose": "Cereals and malted barley.  Fresh heather.  Hints of sherry.  Dried fruits.",
            "taste": "Bold and sweet.  More malted barley and cereal.  Honey and almonds.  Spiced breads.",
            "finish": "Medium.  New oak.  Malty.  Fresh, with some fruit."
        },
        {
            "user_name": "Robinzon25",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "30 sep 2019 11:26 pm",
            "content": "You can drink, but the release is rather weak. Too simple and plain whisky.",
            "nose": "Spirituous, with hints of wild garlic, pickles and yeast dough. Deeper - cardboard and dusty hay.",
            "taste": "Watery, brackish, peppery, with notes of stale bread, ginger and dry oak.",
            "finish": "Short. Rye crackers, salt, nutty bitterness, dry tannins."
        },
        {
            "user_name": "Thermidor",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "07 mar 2021 9:33 am",
            "content": "Simple and nice, but not one without flaws.",
            "nose": "Pears. Oodles of pears, really, and some notes of fresh bread. Simple, sweet, pleasant.",
            "taste": "Pear soda, really. Unfortunately a spirity side comes in later.",
            "finish": "Sweet and short, faintly spirity."
        },
        {
            "user_name": "Max70",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "25 sep 2019 6:22 pm",
            "content": "",
            "nose": "Vanilla bourbon is the main flavor, then cake and an hint of fruit",
            "taste": "Sweet, like a spicy candy.",
            "finish": "Light, not so durable"
        },
        {
            "user_name": "DramALife",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "28 mar 2023 10:06 pm",
            "content": "Had it in a vertical tasting with anCnoc 12, 18, 24.S 7light but sharp81-85 - Another dram welcomed.",
            "nose": "A light touch of chemical oil. Slightly pungent with honey and fairly sharp. Ripe fruits. A whiff of malt. Caramel. Digestive biscuit.",
            "taste": "Creamy but again, sharp. Autumn leaves. Honey drizzled fruits. Astringent on the edges.",
            "finish": "Short finish. A mild touch of beeswax and bitter oak."
        },
        {
            "user_name": "DramALife",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "06 mar 2022 11:04 pm",
            "content": "S 6A whisky with characters! The citrusy is simply unforgettable. Overall spirit-driven, definitely deserves some more years in cask. Give the dram around 10 minutes to fully develop its flavours.N 24Lemon juice. Mildly peated. Touch of new leather. Some fresh honey. Spicy and young malt. More confectionary sweetness and malt develop over time.P 23Overall young, sweet, and spicy. The spices quickly smoothen out after the initial kick. Gradually the boiled honey with barley sugar sweetness dominated the palate, while the citrusy was carried through in the background.F 23Short-Mid finish. The mildly peated malt flavour lingering with a touch of lemon zest citrusy to end.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "drkrylov",
            "user_rank": "Connoisseur",
            "rating": "76",
            "review_date": "23 nov 2011 11:36 am",
            "content": "",
            "nose": "Very aromatic, smooth, fruity. Pineapple",
            "taste": "Smooth, creamy vanilla notes. Very soft note of fruit. Very drinkable and enjoyable.",
            "finish": "Creamy, oaty. Sweet herbs."
        },
        {
            "user_name": "Damek",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "20 nov 2023 4:30 pm",
            "content": "",
            "nose": "Nose: very fresh, light and pleasant, vanilla, honey, a bit of wax, citrus, toffee, cocoa, fruit, ripe apples, peaches, apricots, a bit of spices, pepper and astringency of wood.",
            "taste": "poppy seeds: extremely thick for only 40%, creamy, vanilla, burnt caramel, chocolate, bitter citrus, grapefruit, pomelo, herbs, wood pungency, spices, white pepper.",
            "finish": "Finish: unfortunately short and fading quickly, vanilla, again bitter citrus fruit, astringency of wood, cocoa and, unfortunately, slightly alcoholic."
        },
        {
            "user_name": "Damek",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "18 jul 2023 1:53 pm",
            "content": "Nose: very fresh, light and pleasant, vanilla, honey, a bit of wax, citruses, toffee, cocoa, fruit, ripe apples, peaches, apricots, a bit of spice, pepper and astringency of wood. Taste: extremely thick for only 40%, creamy, vanilla, burnt caramel, chocolate, bitter citrus, grapefruit, pomelo, herbs, astringency of wood, spices, white pepper. Finish: unfortunately short and quickly disappearing, vanilla, again as on the tongue bitter citrus, astringency of wood, cocoa and unfortunately slightly alcoholic.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "kikist",
            "user_rank": "Connoisseur",
            "rating": "77",
            "review_date": "26 jun 2021 11:41 pm",
            "content": "Light, shy ,summer drum.Really fine nose of fresh opened bottle by the time it disappears.Classic bourbon cask character with significant honey and citrus notes.",
            "nose": "Honey, herbal, caramel, malty",
            "taste": "Caramel, lemon",
            "finish": "spicy, nutmeg"
        },
        {
            "user_name": "Kaltduscher",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "12 dec 2014 4:14 pm",
            "content": "",
            "nose": "Light sherry. Tangerines. Juicy tropical fruits. Some malt. Vanilla. Green apples. Honey.",
            "taste": "Mild. Light acid. Some malt. Almost liqueur-like.",
            "finish": "Medium. A light start with a bit of malt and some oak. Grapefruit."
        },
        {
            "user_name": "Feusi",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "06 sep 2011 3:55 pm",
            "content": "That's definitiv an easy drinking dram.",
            "nose": "Honey and lemon, malt and barley.",
            "taste": "Fruity, grassy, sweet and warming, easy to drink.",
            "finish": "A rather short finish, with sweet vanilla and honey notes, some spicy notes."
        },
        {
            "user_name": "Koning",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "08 oct 2023 12:23 pm",
            "content": "A honest bourbon matured Speysider. A nice fresh, floral and fruity nose, followed by sweeter palate and an ultimately drier finish with a trace of smoke.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Tuco1972",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "09 apr 2021 4:45 pm",
            "content": "83",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "boy_genius_ck",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "15 dec 2015 9:18 am",
            "content": "nose: (very similar to hakushu nas)vanilla/almond extract, musk, very light floral, light citrus malttaste: vanilla, almond extract, slightcream, slightly bitter oakfinish: short-medium, fruit, vanilla,bitter nuts at the back",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "cfosterk",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "04 jan 2016 12:21 am",
            "content": "Great value speyside whisky. Tried a recent bottle @ 46%.Peat wafts in and out, along with quite a few white fruits inc conference pear, then grainy with some citrus. I thought about fizzy pear drops! Seems sweet but also quite drying. Quite sweet again but drys very quickly.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "waldwhisky",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "28 jul 2022 8:25 pm",
            "content": "Sweet, a little vanilla, dessert, after a while all that remains is some maltiness and a little bitterness, not exciting. Opens much better in the bottle. The malt and light, beautiful spice come through better. The bitterness is painful.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Master Quill",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "10 oct 2012 2:36 pm",
            "content": "Seems very consistent in quality. Rating is for a batch from 2006: 82 and 2012: 83",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Ivynor",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "28 mar 2014 11:17 am",
            "content": "Easy to drink, fresh and fruity. Well if around 25 €.  In the 81 + / 82 -",
            "nose": "Wood, cut grass, lots of green apple, some lemon juice. Notes of caramel and vanilla.",
            "taste": "It's fresh, fruity, on ripe apple, vanilla, honey, some wood. Not too dry.",
            "finish": "Short, on vanilla and sugar. At the end of the tasting, I found more and more wood."
        },
        {
            "user_name": "Barney9359",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "20 oct 2025 9:35 am",
            "content": "AnCnoc retaste + some new OB bottles 18.10.2025anCnoc 12-year-oldhttps://www.whiskybase.com/whiskies/whisky/23981anCnoc 18-year-old (2019)https://www.whiskybase.com/whiskies/whisky/17163386anCnoc 18-year-oldhttps://www.whiskybase.com/whiskies/whisky/6301786+anCnoc 2007https://www.whiskybase.com/whiskies/whisky/25278387-anCnoc 2005https://www.whiskybase.com/whiskies/whisky/8703687+anCnoc 24-year-old (B: 08.02.2022)https://www.whiskybase.com/whiskies/whisky/20720587+anCnoc 24-year-old (B: 10/11.11.2022)https://www.whiskybase.com/whiskies/whisky/22586687+",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "George_Martin2",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "25 aug 2022 9:24 am",
            "content": "The AnCnoc 12 is the purest fruit salad in a glass, I find it perfect for warm days or summer evenings. Very light and pleasant, also suitable as an aperitif.",
            "nose": "Light, lots of flowers, citrus fruits, light acidity, pear, pineapple",
            "taste": "Very fruity, sweet, pineapple, vanilla, acidity",
            "finish": "Medium long, very mild and pleasantly fresh."
        },
        {
            "user_name": "Montezuma",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "29 may 2023 12:07 am",
            "content": "I believe that search for a typical and well-made ex-bourbon with good value for money culminates in anCnoc 12; So far the most citrusy whisky I've had, I'd like to compare it to the infamous Glenfiddich 12. Don't go with a blend, go with anCnoc 12!",
            "nose": "Very pleasant with notes of pineapple, cassis, vanilla, yellow flowers like in a rapeseed field, honey, practically no alcohol, just a pinch of pepper to break the monotony. Resting at 1920 for minutes, it has malt, yellow cream of dream (Brazilian sweet); the smoked is as light as if it were 1 ppm, which is certainly not due to smoking but due to the water that ran in some bog (guess), very subtle indeed. With water it gets sweeter, more vanilla; I risked an ice and it's still sweet.",
            "taste": "In fact, I was delighted with this single malt, despite being delicate it doesn't have that fleeting quality of a blend, perhaps due to the absence of alcohol. Sweet, vanilla, malty, the slight alcohol turns into a hint of pink pepper, citrus. With water it has more vanilla and tannins from the barrel, in addition to the pepper on the tongue. I couldn't resist and added ice to compare with a scotch blend and it turned out to be a beautiful alternative, becoming tannic and sweet.",
            "finish": "Medium, sweet and with a little bit of smoke in the background, something like 1 ppm just for the record."
        },
        {
            "user_name": "Alex Fridays",
            "user_rank": "Expert Senior",
            "rating": "78",
            "review_date": "24 jun 2018 9:50 am",
            "content": "Sweet, duchess pear, vanilla, oak, honey and floral notes on nose.Spices, apples, oak and citrus notes on taste.Short finish with spices, oak, vanilla notes.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "claymore84",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "02 mar 2022 4:24 pm",
            "content": "Blind tasted on 03-02-2022.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "claymore84",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "15 apr 2020 5:30 pm",
            "content": "blind tasted on 04-14-2020.(83/84/82)",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "J.K.Ch",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "10 apr 2016 10:48 pm",
            "content": "The price of about CZK 600 per bottle makes it a fairly affordable companion who has enough to offer the smell. Mainly, if you like fresh or less ripe fruit. If it tasted as good as the smell, it is my favorite of the Highlands.",
            "nose": "A fresh scent resembling a freshly sliced ​​apple with a faint vanilla in the background, something freshly cut in grass and fresh hazelnuts, perhaps still unripe. Traces of pineapple. Very smooth and delicate. The smell is probably the strongest side of this whisky.",
            "taste": "Weak vanilla passes into taste, but without apples. Pineapple alternates mandarin and peel. Sweet taste is the hints of flowers and grasses and fine licorice.",
            "finish": "Dozvuk is weaker, relatively short on bonpares. It is finished with a slightly more vulgar aroma of fruit brandy with a soft bitterness and a spice of bitterness."
        },
        {
            "user_name": "Shane_IL",
            "user_rank": "Expert Senior",
            "rating": "60",
            "review_date": "18 nov 2017 3:44 pm",
            "content": "I’d heard that anCnoc needs some age on it and this kind of proves this. The young character here didn’t really go down too well with me and above that there was this very dominant and unbalanced taste of ethanol all the way through. The chill filtration and 40% abv didn’t help either.Reviewed in my blog:iwriteaboutstuffilike.com/2017/11/18/ancnoc-and-balblair-tasting/",
            "nose": "Green banana. Malt. Honey. Wild flowers. Beeswax. Nutmeg.",
            "taste": "A little ethanol heavy here. Bit of naphthalene. Wet grass. Green herbs. Bitter honey.",
            "finish": "Short. Sharp. Ethanol. Woodspice. Honey."
        },
        {
            "user_name": "Wtrstrnghlt",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "18 feb 2016 11:06 am",
            "content": "Tasted at a local whiskyshop tasting:Nose: clean, sweet, vanilla, oak, malty.Taste: sharp arrival, burst of pepper. Sweet and sugary. Finish: long, peppery oak",
            "nose": "",
            "taste": "",
            "finish": ""
        }
    ]
}