{
    "info": {
        "ws_name": "Clynelish 14-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Clynelish",
        "ws_age": 14,
        "ws_abv": 46.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/3/8/229/372681-normal.png",
        "ws_rating": 84.88,
        "ws_vote_cnt": 2689,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/38229/clynelish-14-year-old"
    },
    "collected_count": 164,
    "reviews": [
        {
            "user_name": "dram-drinker",
            "user_rank": "Photo Moderator",
            "rating": "91",
            "review_date": "04 jun 2016 9:45 pm",
            "content": "This one is actually much better than expected for a regular bottling",
            "nose": "Fruity, pears, citrus fruits, malty",
            "taste": "oily, smooth, fruity sweetness, apple pie, nice wood notes",
            "finish": "Medium long and smooth"
        },
        {
            "user_name": "Slàinte Mhath",
            "user_rank": "Super Administrator",
            "rating": "86",
            "review_date": "03 aug 2019 2:26 pm",
            "content": "Known for its waxiness, Clynelish 14 is a Highland single malt primarily matured in ex-bourbon casks. Scotch mist gives an indication that it is non-chill filtered. Creamy honey, candle wax and lemon juice are prominent on the nose, while rich floral notes with a hint of peppermint lurk in the background. The arrival is warming and aromatic, unfolding a distinctly dry and oily character. Oak bitterness with a touch of salt dominates the medium-length finish. Altogether, it is an engaging and intense malt that requires time and is not suitable as everyday dram.RATING: 3.9/5.0 stars ≙ 86 pts → FIRST-CLASS [-]",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Archer",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "29 jan 2016 3:14 pm",
            "content": "A decent all-day dram.",
            "nose": "An earthy nose. Beeswax, vanilla, orange peel. Quite spicy with cinnamon and cloves.",
            "taste": "Full and malty. Further spices, now rather pepper and salt, where there is no salt taste, which one would associate with \"sea air\", but the emphasis is too much on the earthy character.",
            "finish": "Rather short, while malty with vanilla, some oak in the finish."
        },
        {
            "user_name": "KayMeertens",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "24 jan 2014 2:36 pm",
            "content": "This is one of the best whiskies I know in this price category.",
            "nose": "Honey, citrus, beeswax, floral notes, caramel, almond and smoke. A tad of fishy saltiness as well.",
            "taste": "Citrus, honey, caramel, smoke, almond, malt and a little salt & pepper.",
            "finish": "Caramel, beeswax, smoke, malt and nuts."
        },
        {
            "user_name": "Dre73",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "02 feb 2018 7:58 pm",
            "content": "",
            "nose": "Floral and perfumed as a first impression, fresh. Also slightly salty, and earth / forest. Fruity, orange, banana. Also spicy, and something tobacco.",
            "taste": "Very light pepper, sweet, honey, creamy structure. Later very soft, and fruity: peach and citrus.",
            "finish": "Still light peppers initially, sweet, honey. Peach. Mid-length. Somewhat bitter undertones, wood."
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "03 apr 2020 10:23 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2020/04/03/bottle-polishing-2020-back-to-scotch/Initially disappointed by this bottle on opening [like the Nevis], I managed to drink most of it before taking a note. Clearly a session dram then!N: Let’s dive right into the descriptors. [Bourbon-esque] waxy husky > cereal-y and citrusy – zest & pith oranges > unripe lemons, but mainly in essential oil form. This leads to suggestions of syrup-ed apples, melon and [candied] bananas even, with a moreish huskiness surrounding them. Secondary notes bring almond macaroons served with a salty mineral-y funky-gluey [slight aspirin=detergent/Caroni-esque – in a good way] sage tea, sipped whilst sat on upholstered furniture whilst nearby is a jug of single cream placed on a teak coffee table, the room adorned with velvet curtains. I obviously got carried away by this one! Fringe notes include lychee and a touch of [walnut & chestnut]-dunnage-light vanilla oil. Excusing the emotional outpour, that secondary ‘sweet husky waxy gluey’ note rings true.T: Sweet-sour, bourbon-aged citrusy waxy almost gloopy spirit. Hard to pin down the citrus makeup given the husky-creamy vanilla-ey bourbon cask influence is driving so adamantly. Prickly at times [neat] with suggestions of crab meat – there’s a first – the conclusion talks of a fruity citrus waxiness in the main, seasoned with pepper from the mill.F: Salivatingly-dry, waxy and husky with mildly sweet=sour grassy runny/melted vanilla icecream. That fusty husky waxiness < remains,… then more buttery,…..C: The contemporary ‘bourbonisation’ of this classic expression was a little grating though all things improved as the bottle went down. Furthermore, it’s still one of the best entry-level malts from any Scottish distillery.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "07 jan 2018 8:59 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2018/01/07/odds-ends-jan-2018/I like these 20cl bottles. An ideal volume for assessing/judging without the burden of a full bottle. Then again, when the whisky is good, it’s not enough.N: Instantly likeable, well rounded, well balanced barley spirit suitably aged. Waxy sweet-savoury with sweet lemon putty, wholemeal pitta, paratha bread, a touch of sweet veg mash, cake dough with cooked raisins, tonic water and a [Malden] saltiness. Add a sprinkle of meaty [gammon] soot to that.T: Firm/controlled-sharp peppery-citrus attack. Very soon the mouthfeel gets to work, enveloping the palate and focusing in on waxy, chilli lemon. More saline with water, towards a fluffy-dry-soft barley direction. Water subdues the chilli no end, allowing the fine distillate with an even finer mouthfeel coating to get to work.F: Sustained mouthfeel oozing. Waxy to oily buttery before eventually concluding with the kind of finish you’d expect from a G&T. Hints of chilli & pepper keep the barley subtlety seasoned & sustained.C: On this occasion, it turns out 20cl wasn’t so optimal. A full bottle is currently going for under €40 in Germany & Holland, lucky neighbours.Scores a B",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "31 jul 2017 12:45 am",
            "content": "https://whiskylovingpianist.wordpress.com/2017/07/30/brora/N: Fruity cereals with a concrete/firm mineral bed and salty-farmy suggestions.T: The decency continues. Tasty, interesting, beefy, layered, poised. 14 years seems an ideal age for this spirit.F: Good length and sustained power. Keeps its form & profile throughout.C: One of the strongest core [aged entry-level] expressions from any distillery.Scores a B",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "02 jul 2025 9:12 pm",
            "content": "2020 Rating",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "21 jul 2021 11:47 pm",
            "content": "",
            "nose": "Fruit. Ripe fruit. Ripe peaches and apples. Slightly smoky. Honey and caramel. There is a little alcohol. Beeswax knives.",
            "taste": "Ripe fruit, but also there is a distinct smoke. Spices. pepper. Citrus. Peaches. Honey. Vanilla.",
            "finish": "Sweetness at first. Caramel, vanilla and honey. Some ripe fruit. Peaches. A trace of smoke. A pinch of spices. A trace of a barrel. Medium-long finish."
        },
        {
            "user_name": "robain",
            "user_rank": "Specialist",
            "rating": "85",
            "review_date": "19 apr 2025 8:34 pm",
            "content": "9(!) years later for an updated review. 82-85-90 in 2016.Lets see what experience bring to the table.",
            "nose": "Aromatic, metallic, leathery, wood, citric and fruity, green grapes, sandalwood.",
            "taste": "Nice oily, fruity, vanilla and oaky taste in a nice compott of complexity and still simple.",
            "finish": "Good woody, vanillic finish."
        },
        {
            "user_name": "robain",
            "user_rank": "Specialist",
            "rating": "85",
            "review_date": "13 may 2016 4:45 pm",
            "content": "",
            "nose": "nutty, fruity,",
            "taste": "Vanilla, powerful abv - it feels higher then 43%, sweet caramel.",
            "finish": "Vanilla is coming out strong on the finish, finish is medium long."
        },
        {
            "user_name": "markjedi1",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "26 nov 2017 8:58 am",
            "content": "I do not exaggerate when I say this is one of the best standard bottlings on the market. Only 40 EUR. This should be in every cabinet. Thanks, Pat!",
            "nose": "Clynelish is known for its waxy nose. We have that here for sure. A nice complexity of salt, sweet and mild smoke. Think pipe tobacco, liquorice, banana, Earl Grey tea that was left too long in the teapot, loads of mint and a surprising hint of mustard seeds. On top of that some fruit appears in the guise of oranges, apples and raisins. Maybe even a blueberry that made a wrong turn. Like I said: complex.",
            "taste": "It starts on malt, quickly followed by vanilla, fresh fruit, honey and lots of tropical notes. Think mango and papaya. This is very good. Caramel and honey keep it sweet, while a big note of woodsmoke give it depth. Ginger, pepper, beeswax. All flavours work well together to presented a beautiful malt on the palate.",
            "finish": "The finish is medium long on apples and tropical fruit, but both smoke and wax run off with the medals."
        },
        {
            "user_name": "dRambo",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "30 mar 2017 11:43 pm",
            "content": "Nose: candle wax, lemon zest, exotic fruits, peppery wood, sweet malt, voluminous nose  Taste: Strong, slightly maritime accents with seaweed and salt, oily and round, syrupy, honey-sweet, strong woody notes, spicy-dry but not bitter, very intense and distinctive    Conclusion: wow really delicious, strong independent super PLV",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "MaltVader",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "11 mar 2022 7:34 pm",
            "content": "This is what a stand should taste like, and this is what whisky should taste like up to 40 euro. Honey, citrus notes, vanilla, apple, a bit of wax. A bit oily on the tongue, the aromas from the nose coincide, I would add some dried fruit that I did not smell on my nose. A very solid position",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "ThorstenH",
            "user_rank": "Connoisseur",
            "rating": "76",
            "review_date": "05 mar 2023 5:30 pm",
            "content": "71-80 – Fine, like to drink by time",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "ARDBERG",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "20 may 2018 6:51 pm",
            "content": "Quite surprised by this standard that I had circled around for some time. Tastings have positive effects, especially on this one;-) Give it a try - a nice bang for your buck bottling.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Tom na Gruagaich",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "03 sep 2022 12:03 am",
            "content": "I always found Clynelish a bit bulky, but the 14 was interesting with its waxiness. This batch is a little smoother and easier than I remembered. Malty, sweet, somewhat mineral. Far from bad, still a good standard with great PLV but also a little less exciting.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "LeChiffre",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "29 jan 2023 2:08 pm",
            "content": "For me one of the best standards in the price segment 30-45 euros next to the Talisker 10y. Great intense waxy-fruity-sweet aromas, with great power thanks to the alcohol strength. What more do you want?",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Sweetspot",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "27 feb 2023 9:58 am",
            "content": "it's a hit or miss with these 14y old's",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Noface83",
            "user_rank": "Specialist",
            "rating": "81",
            "review_date": "10 feb 2017 7:29 pm",
            "content": "Nose: what a satisfying nose for such a favorable standard. Lots of citrus but also orange juice, beeswax, malt sweetness and vanilla, a touch of tropical fruits and peppery oak, the 46% are felt with a slightly tingling alcohol.  Taste: creamy and slightly tingling - wonderful! Now with beautiful honey and nut flavors, again vanilla and barley malt, beautiful woody notes from the oak, very smooth and harmonious it goes into the short to medium-long finish which is dominated by the oak without drifting into the bitterness. It stays creamy and sweet until the end.  Wonderful whisky in the lower price segment which is very pleasant to drink and never gets boring. Too bad that there is added dye",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "brandyhill",
            "user_rank": "Connoisseur",
            "rating": "90",
            "review_date": "07 feb 2016 1:21 pm",
            "content": "Price / performance ratio is great!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Malthead19",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "06 jan 2021 2:13 pm",
            "content": "- a classic good strong whisky from the Highlands with power and volume - PLV with approx. 38€ fully in order",
            "nose": "pleasant aroma with light notes of wildflowers and herbs, malt and sherry",
            "taste": "interesting, powerful acceleration (thanks to the 46%), oily body; mouth-filling, sherry, bitter chocolate",
            "finish": "medium length, heavy, drying finish ; long warm and slightly burning aftertaste, the oak sounds again clearly"
        },
        {
            "user_name": "pianoman",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "02 jul 2016 3:27 pm",
            "content": "",
            "nose": "Begin restrained. Bright fruits. Beeswax. Pencil. Some mustard.",
            "taste": "Again bright fruits. Wax. Grain. Olive oil, mustard, salted peanuts. Some bitterness.",
            "finish": ""
        },
        {
            "user_name": "HammerHead",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "01 jul 2018 7:33 am",
            "content": "This is possibly my current favourite of the classic malt bottlings, it even tops recent Lagavulin 16 batches. Waxy and slightly salty, tropical fruits and citrus, floral with honey and a nice mild spiciness in the finish.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Mr.Edradour",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "11 jan 2016 10:28 am",
            "content": "Well balanced whisky, quiet good.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Astrid",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "12 feb 2021 10:23 am",
            "content": "A top standard with wonderfully interwoven aromas.",
            "nose": "Subtle sherry with thick vanilla and salted beeswax, some nutmeg and mineral coastal air, banana chips, liquid honey, oily-buttery with flaxseed and grain notes, caramel with chopped hazelnuts, apple, orange and apricot, fine wood dust and yeast, strawberries, cinnamon",
            "taste": "Oily honey sweetness with sherry notes and spicy oak, clove and cinnamon, beeswax and hints of candle wax, raisins, maritime and mineral, slightly malty, vanilla and caramel, apple, earthy with traces of cocoa and pepper, orange syrup and banana, cardamom",
            "finish": "slightly dry, oak wood with mint and ginger, beeswax and candle wax, malt and tobacco, vanilla, clove and pepper, slightly oily, buttery and salty, some leather and earthy cocoa, apple, almonds"
        },
        {
            "user_name": "Stanzeflasche",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "23 aug 2019 2:18 am",
            "content": "Candle wax, unless it is ointment, camphor, glue. Then the influence of wood is felt, it becomes almost fruity, like barley syrup or white plum. Varnish, mint candy, a touch of iodine. It's quite maritime in the end. Peat and sherry, quite a bit. A light sherry, more raisins than red fruits. Elastic, leather, straw, we finish with a farmhouse touch. On the palate, it's quite mature, suitably spicy, woody, with apple and beetroot, a little lemon. A very malty finish, with slight hints of caramel and yeast. In retro-olfaction, you would think you had drunk stout, it is very cereal and somewhat earthy. Overall, very subtle and rather pleasant, long finish. A very original and pleasant whisky. Its waxy and subtle side makes it a classic, available at a completely acceptable price. https://ilikesky2020.blogspot.com/2020/05/clynelish-14-yo-46-original-bottling.html",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "DistiLesha",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "05 may 2023 10:34 am",
            "content": "A charming whisky, quite understandable and very open to its consumer. 21.5 21.5 21 20",
            "nose": "Dusty, fruity, very herbaceous. The grass here is not fresh, but mown, lying down in the dampness of the night. The second nose is creme brulee and other lemonade notes, quite a bit of solvent notes, at the level of traces. Intensity: 7/10",
            "taste": "The first meeting is a salty-sour taste immediately turning into a bright fruity sweetness, giving way to lemonade shades of soda and creme brulee. With air, more toffee or even butterscotch comes out. It all ends with citrus zest and a powerful kick of peppery sharpness, turning into an aftertaste.",
            "finish": "The main theme is barrel tannins and pure oak, a little bit of pepper and fruit."
        },
        {
            "user_name": "Saftkenner",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "28 feb 2021 4:35 pm",
            "content": "A great standard bottling with a great price-performance ratio and a nice summer whisky. Ideal as a gift for whisky newbies.",
            "nose": "Nice flowery and grassy nose. Very pleasant (in a positive sense). Honey, delicate oak, heather, pears, quinces, spring flower meadow, juice orange, light vanilla and a pleasant freshness.",
            "taste": "Powerful start and slightly oily. Citrus notes and vanilla. Oak spice, forest honey and a touch of pleasant bitterness.",
            "finish": "Medium length. Juice orange, vanilla, honey and the delicate oak spice remain in the mouth and throat."
        },
        {
            "user_name": "ffmdino",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "26 apr 2018 9:54 pm",
            "content": "yes the wax or better Parafinnote is there  TOP PLV",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "tribe",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "26 jan 2024 10:54 pm",
            "content": "Always a good standard so far",
            "nose": "Apricot, vanilla, lemon, some wax, malt",
            "taste": "Apricot, wax, oranges, vanilla, honey, malt, ginger, get better the longer the bottle is open. At the beginning it is still a bit peppery and with old bottlings there was even more wax.",
            "finish": "Nice fruity, silky finish...wax remains with yellow fruits"
        },
        {
            "user_name": "_Dziki_",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "24 dec 2022 9:16 am",
            "content": "A perfectly balanced whisky, light, sweet, slightly smoky.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Boletus",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "12 dec 2022 9:43 pm",
            "content": "An all-round successful and ideally balanced single malt. No hit-and-run flavors, just nicely coordinated and balanced. For me a flagship of the \"Classic Malts Selection\" and a real reference among the Scottish standard bottlings.",
            "nose": "Lemony freshness flirts with honeycomb, from which large quantities of wildflower honey flow, some grapefruit, plus a light pastry note, sponge cake with lemon zest, white grapes, the supple oak is subtly restrained and exudes a few toasty nuances along with vanilla, a crisp red apple becomes Freshly cut, a few grated coconut are scattered, in the background there is a subtle maritime and slightly mineral impression together with the scent of a dried bouquet of flowers",
            "taste": "An appealing interplay of honeyed sweetness and refreshing citrus fruit starts on the palate, the waxy mouthfeel spreads immediately, a sea buckthorn berry is sucked out of juice, the oak has both toasted sides and a few charred spots, with a minimal hint of wood smoke, lemon cake with icing sugar, one or the other blanched almond creeps in, set barley aromas testify to a well-developed brandy, the apples now seem to have ripened a little longer",
            "finish": "Pronounced medium length, toasted oak and expressive malt initiate the finish, a piece of milk chocolate is melted with a sip of milk coffee, an appealing note of wild honey lines the mouth with wax, dried apple chips are embedded in it, in the background apricots, gooseberries and white grapes complement a subtle one Fruitiness, the floral note of a dried bouquet of summer flowers unfolds, delicate vanilla and a mixture of almond flakes and coconut flakes remain as an aftertaste"
        },
        {
            "user_name": "thomasjx",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "06 nov 2024 7:50 pm",
            "content": "Excellent value for money. Around €44 per bottle (November 2024) is a steal considering the current market.",
            "nose": "",
            "taste": "",
            "finish": "(84,5)"
        },
        {
            "user_name": "Expraesi",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "22 dec 2018 9:51 pm",
            "content": "",
            "nose": "Honey sweet, floral note, intense nose for 46%.",
            "taste": "Creamy on the palate, sweet and spicy.",
            "finish": "Mittelang, sweet and oak. Two-dimensional, but tasty. PVL top."
        },
        {
            "user_name": "Othorion",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "19 jun 2016 10:09 pm",
            "content": "Great PLV, a nice standard",
            "nose": "Pear compote, citrus fruits, herbs, vanilla",
            "taste": "Caramel, roasted nuts, honey, malty, pepper and a hint of apples",
            "finish": "Medium, more malty, a thought of salt and a nice bittersweet note"
        },
        {
            "user_name": "alectron",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "05 jan 2015 5:53 am",
            "content": "Single dram, blind tasting @ Regionals 2014_02",
            "nose": "estery, malty, citrus, yellow fruit, salty, wet cloth, musty, slight soapyness (84).",
            "taste": "salty, sweet, faint sherry, waxy, some cardboard (82).",
            "finish": "more salt, sweet, apricots, dry, some faint smoke (84)."
        },
        {
            "user_name": "DramALife",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "14 jul 2022 10:52 pm",
            "content": "S 8The “very pleasing texture (to me it’s the rich waxiness) which is highly regarded by malt whisky connoisseurs” that’s stated on their tin since its birth is 90% gone if not completely lost. What’s left is a fruity coastal dram that’s light, clean and enjoyable, but nothing more. Got it on sale for £34, which remains an exceptional bargain in 2022 given all the hypes in the whisky world. [83-85] I'll get a bottle unless my bank account says otherwise.N 26 Overall light and delicate on nose. Floral and coastal. Fresh ginger paste. Citrus fruit. A whiff of smoke and almost unidentifiable wax, or is that just nostalgia? P 26 It all started with a slightly waxy and oily mouthful but quickly evaporated. Fruity and spicy. Sea breeze. Zingy citrusy. Butterscotch. Very lightly smoked malt. Dark wood shaped the entire palate by adding extra body to it. Warm spices (cinnamon, cardamon). Green apple. F 23 Short-mid finish. Malt. Drying spices. Summer oak. A light touch of fruit sweetness lingering. A very mild touch of wax lingering in the background like ghosts.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "DramALife",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "16 apr 2022 4:45 pm",
            "content": "Complex on the nose, characterful on the palate. Afterburn was a bit overwhelming.In my pre-historical scoring method, it's an 8.8/10.",
            "nose": "Refreshing menthol. Coastal influences. Zesty lemon peel developed to mild honey and a touch of wax. Orchard fruit. Smoke at the back.",
            "taste": "Quite light. Oak. Saline. Orange. Honey & vanilla. Waxy.",
            "finish": "Short, dry finish. Spices (pepper) quickly evaporated. Vanilla lingering"
        },
        {
            "user_name": "Whisky.Hedonist.MY",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "29 oct 2024 2:42 am",
            "content": "A very introductory Clynelish, ticks all the boxes.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "larswehmeier",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "08 mar 2022 10:02 pm",
            "content": "Great standard with great value for money.",
            "nose": "Vanilla, hay, cream.",
            "taste": "Caramel. Cream. Toffee. Oak. Pepper.",
            "finish": "Spicy, dry."
        },
        {
            "user_name": "Moses",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "27 jun 2019 12:43 pm",
            "content": "A good journeyman who looks quite complex according to his age. Unfortunately, colored and filtered. But the PLV is perfect. However, the new make is still very present. But still good standard. Respect.",
            "nose": "Some of them smell peppery, I say dribbling alcohol. But with a little water, he immediately shows what he can do. Lemon fruit with lots of vanilla, with hints of orange peel and even some cinnamon. Well done.",
            "taste": "Full-bodied creamy with tidy wood spice but harmoniously interwoven with peppery sea spray. Even some honey notes from Glenfiddich mingle underneath. Everything feels earthy. Drying mouthfeel. Probably from the new make.",
            "finish": "Medium to rather short. But he stays sweet and creamy until the end. Nice that he has held out. Brevity is the soul of wit :-)"
        },
        {
            "user_name": "WhiskeryTurnip",
            "user_rank": "Connoisseur",
            "rating": "77",
            "review_date": "11 jul 2022 9:28 pm",
            "content": "I have frequently compared this malt to the Arran 10, a personal favorite, and after finally sitting down and writing up some notes, I will continue to do so. Clynelish 14 is a gateway whisky for many people, and for good reason. Its flavors are well-balanced and well-structured, while the medium to light mouthfeel gives it a delightful smoothness— there are no significant off-notes or prickly points. It is the kind of malt that really introduces someone to the possibilities of scotch (for me, that was Green Spot— not scotch, but it got me into whisky)— scotch does not have to be an unpleasant spirit bound to burn the palate, lingering with an odd bitterness and destined as no more than a mixer. The Clynelish 14 does make a great highball, but it is also excellent to sip straight-up at the end of the day.",
            "nose": "Mellow sweet citrus, clovers, grassy sugars, old-fashioned lemonade, hints of beeswax and chalk.",
            "taste": "Medium to light body, citrus zest, minerality-chalk, beeswax, clover honey & chamomile tea, Nilla wafers, hints of butterscotch and pepper, ginger at the end.",
            "finish": "Medium-length with citrus and mineral (like zinc-based sunscreen)."
        },
        {
            "user_name": "SC3",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "12 nov 2022 6:34 pm",
            "content": "Very balanced and pleasant whisky",
            "nose": "Wax, hay, honeycomb, honey, yellow apple, pear, powdered sugar",
            "taste": "Bright, dense, honeycomb, vanilla cream",
            "finish": "Tart, long, warming, spices, candle"
        },
        {
            "user_name": "kikist",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "11 jun 2023 11:53 pm",
            "content": "Nice value for money considering it's ABV age and what it offers... although some IBs offer much more they also cost much more",
            "nose": "Sweet, creamy, hints of mint, fresh dough, onion, leafy",
            "taste": "fresh, slightly floral, meadow, malt, cereals",
            "finish": "little bit dry, dry grass, hay"
        },
        {
            "user_name": "robbert88",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "26 mar 2022 5:34 pm",
            "content": "",
            "nose": "N: Immediately wax that Clynelish is so famous for. Candle wax, lemon, wilhelmina peppermint, bread, floral, fruity and I would almost say a small puff of smoke.",
            "taste": "P: wax, pepper, salty, citrus, wood, oily and creamy mouthfeel. Peach at the end.",
            "finish": "F: vanilla, peach, honey, wood bitters, oak, peppers, wax. medium long"
        },
        {
            "user_name": "Sandman",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "15 feb 2015 5:15 pm",
            "content": "A nice whisky, with a good complexity and a enjoyable drink.",
            "nose": "A lot of citrussy notes, like mandarin, oranges and lemon, a hint of smoke and with water pears and honey.",
            "taste": "Light fruity notes, orange, oak, bit of smoke and with water it becomes creamier and sweeter.",
            "finish": "Medium, dry, some oak, sweetness"
        },
        {
            "user_name": "Defeatless",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "23 mar 2014 11:09 pm",
            "content": "Nose: sweet, hint of red wine, raisinsTaste: lots of sweetness, again red wine shows upBody: medium a little oilyFinish: medium-long, a bunch of flowers, a little sweet, dries your mouth.Very good price-quality. A little pity about the presentation with the new label: you cannot find the year of produce back.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Titi94",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "08 jan 2014 9:48 pm",
            "content": "Bottlers Notes:Aged for 14 years in specially selected oak casks then bottled at full 46% abv, this is a light yet firm-bodied maritime single malt. Fresh and creamy-smooth on the palate, it has a smoky, sea-spicy character and a very pleasing texture which is highly regarded by malt whisky connoisseurs.The nose starts with light candle wax, some sugar and a faint floral fragrance. Adding a little water brings this into focus, the candle wax is now more richly scented as if, when strolling near the beach, you have come across sun-dried flowers among the sand dunes.On the spicy palate there is a signature oily, mustard-cress crispness, which is underscored by some maritime saltiness in the satisfying, drying finish.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Goethe",
            "user_rank": "Connoisseur",
            "rating": "90",
            "review_date": "29 apr 2017 10:49 pm",
            "content": "Amazing Clynlish. What a performance from a standard bottling. The malt is getting more fruits and tropical fruits by adding some water. What a stunner.Concerning price/performance ratio: 10/10",
            "nose": "Oily mustard barley, some grain, citrus fruits (ripe and unripe), ripe apples, vanilla, some honey, some sugared flowers (haven't tried it yet), raisins, minerals, way in the back some berries (gooseberry, blackberry), gingerbread with oranges.",
            "taste": "Oily mustard barley, vanilla, creamy citrus fruits, sweet herbs, apples and overripe apples, some tropical notes (for example some papaya), caramel and toffee, sweet ginger.",
            "finish": "Long. Apples, tropical fruits, gingerbread and oak."
        },
        {
            "user_name": "Hegu",
            "user_rank": "Expert Senior",
            "rating": "74",
            "review_date": "15 dec 2024 10:27 pm",
            "content": "Diageo's \"quiet\" classic distillery. The wax master, the ghost of Brora.",
            "nose": "Wax, vanilla, raw lemon peel, Creme brylee, herbs.",
            "taste": "Sweet, milky, soft, oily,",
            "finish": "Citrusy, herbal and oily finish, long. Not exactly my favorite whisky but this one has a lot of fans."
        },
        {
            "user_name": "YD84",
            "user_rank": "Expert Senior",
            "rating": "89",
            "review_date": "09 apr 2020 12:59 am",
            "content": "Pineapple, orange cream biscuits, dried apricots, ginger, pepper, earth, tobacco, more fresh tropical fruits, salt, freshly chopped capsicum. Occasionally a whisper of peat. Oily texture. Complex and delicious. A classic for a reason.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "KIMCHIBaby",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "21 may 2024 2:39 am",
            "content": "A whisky with an interesting apple flavor",
            "nose": "- Rich apple scent, reminiscent of a moist, ripe red apple rather than a refreshing feeling.- It feels like apple juice.- Rich honey scent",
            "taste": "- Waxy- Refreshing apple flavor- Feel of charred oak barrels- Malty flavor with a nutty taste",
            "finish": "The malty taste remains.- Green apples? Tastes like carbonated apple juice- A slight oak scent remains."
        },
        {
            "user_name": "Eun1",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "27 may 2019 5:29 pm",
            "content": "In the nose unfolds a fruit cocktail with apples, pears and apricots, leavened with lemon juice and honey sweetened. In the background some bees wax polish and freshly cut grass. Everything is silky and finely woven.  The taste is a bit woodier; Although the taste sensation begins with forest honey, herbs and citrus tones, it quickly slips off into bitter bitterness.  The finish is medium-long, oaky spicy and dry.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Montezuma",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "02 sep 2025 6:19 pm",
            "content": "08/15/2025 - 33 ml - L4022CM012 One of the most bitter-tasting whiskys I've ever had. The peat on the nose is nice, but it doesn't show up in the mouth unless it's that bitterness. And very sweet too. Intriguing, you deserve a bottle...",
            "nose": "Sweet vanilla and caramel enveloped in a subtle, dry but consistent woody peat, reminiscent of baked fruit with cinnamon. Honey, sugar, propolis, and a measured heat, like chocolate and pepper. Malt and red fruits, suggesting hidden wood, perhaps emerging as toasted old wood and sherry. It feels young or high ABC, but without flaws. As it settles, cereals, some yeast, and herbaceous notes emerge, with some sulfur. With water, the burn diminishes, becoming sweeter, with bursting vanilla and plenty of sugar. The peat has disappeared, and if there was any sherry, it's gone, leaving traces of candied fruit. A beautiful ex-Bourbon to enjoy, very sweet. Oh, and I almost forgot to mention the lingering woodiness, as well as a light leather finish.",
            "taste": "Sweet, but with astringency from new and white wood, reminiscent of Virgin Oak. Very spicy, with old wood. The sweetness is of vanilla, honey, and white sugar, but there's a bitterness from propolis and dark green leaves. Sulfuric and tannic, intriguing. With water, the spiciness decreases, leaving a minty taste, but the tannic sweetness and bitterness persist.",
            "finish": "Medium, with new wood, old wood, bitter and astringent. Some sweet malt."
        },
        {
            "user_name": "Abadon05",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "18 nov 2023 9:21 am",
            "content": "Lots of fruit and lots of green apples. Minimal distillery-typical waxiness.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "PunxsutawneyPhil",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "05 aug 2015 9:03 pm",
            "content": "Very good. Awesome nose, great taste, good finish.",
            "nose": "Thick, full, honey, bees wax, like holding a piece of honeycomb to your nose, banana, vanilla, spicey",
            "taste": "Full bodied, fresh initially, then the vanlila and honey sweetness, yellow fruits, slowly developing into a slight barley bitterness",
            "finish": "Lingering barley sweetness. Slightly bitter."
        },
        {
            "user_name": "Gloin",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "25 may 2015 12:15 am",
            "content": "Delicious. Good everyday whisky",
            "nose": "Red apple, cinnamon, vanilla, a little spiciness, sawdust, a hint of smoke? Delicious",
            "taste": "Gentle onset and soft mouthfeel, fresh grassy notes and again the apple, some oak and malt",
            "finish": "Unfortunately a bit short, light bitterness, malt, and slightly sour notes"
        },
        {
            "user_name": "eselsim",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "09 nov 2024 11:46 pm",
            "content": "my fav go to whisky",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "markfeit",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "16 jan 2019 5:23 am",
            "content": "spicy on the tongue, but a creamy mouthfeel. A really nice highland malt. A solid whisky, really nice.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "wbarchive_104650",
            "user_rank": "Expert Senior",
            "rating": null,
            "review_date": "13 aug 2016 5:12 pm",
            "content": "A solid, delicious malt. Very nice aromas of spice paired with sweetness. Really tasty.",
            "nose": "sweet honey with a decent portion of seasoning; with cereal and straw flavors; a little raisins are there; with oranges and apples; Caramel; with some time, citrus aromas are added; light pepper; now comes a light wood note; the sweetness disappears and it gets spicier",
            "taste": "spicy and peppery; slightly creamy; Oak and vanilla; Apples and caramel; dark forest honey; the alcohol is easily noticeable;",
            "finish": "short to medium length; neatly peppery; spicy at first, then it gets sweet; Oak and caramel; Apples and raisins with chocolate; Spice and a little chocolate are left on the palate"
        },
        {
            "user_name": "Wtrstrnghlt",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "21 feb 2015 1:48 pm",
            "content": "Waxy nose, citrus, brine, some smokey hay. Malty cereal.  Full, warm taste. Sweet at first, later somewhat dryer. Oranges, biscuits. Very easy for 46%.One of the greatest entry-level OB's",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "lapinbilly",
            "user_rank": "Expert Senior",
            "rating": null,
            "review_date": "18 nov 2017 7:47 pm",
            "content": "A very good whisky, not too simple or too complex.",
            "nose": "The nose is very pleasant, fragrant with flowers, spicy, malted barley is very present.",
            "taste": "On the palate, it's fresh and creamy we find immediately wax and spices, bitterness too, with orange, I find traces of star anise, and a little honey.",
            "finish": "The finish is average on bitterness with a hint of honey."
        },
        {
            "user_name": "rich_93",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "11 may 2022 7:56 pm",
            "content": "Superb value for money. Malty but mixing delicious, thick dessert notes with tart, bitter citrus and orchard fruits. Would drink this any day. I don’t think the waxiness is comes across much in this bottling though.",
            "nose": "Lovely lively nose, clearly good quality of maturation. Clear signs of select oak casks… ok, just kidding, that’s what the tin says. Really, it seems like a good balance of mostly refill, with some first fill bourbon for roundness and sweetness. Juicy, ripe tropical fruit. So fresh! Zesty with grapefruit, orange and other citrus fruits. Spices starting to develop as well. Not as much waxiness as I’d hope, but especially with water it does appear. Interestingly, I had this in parallel with a JW gold, and that was more distinctly waxy. With water, I also get more pronounces sweetness, in the form of rich milk chocolate and caramel notes.",
            "taste": "Nice, thick texture. Fruity, sweet, fresh, bitter. Continuing on the same theme as the nose. Very highland, very malt-driven. Plenty of cereal-rich biscuits, honey, citruses (bitter grapefruit), orchard fruits. Develops fairly spicy, with ginger and black pepper. Perhaps even a hint of chilli leading into the finish, but not unpleasant.",
            "finish": "Dry, medium length and rather simple. This is where the casks make themselves known. Slightly woodier than I’d prefer. There’s fruits and herbs, but the wood drives it."
        },
        {
            "user_name": "Syleo",
            "user_rank": "Expert Senior",
            "rating": "77",
            "review_date": "13 jan 2019 9:37 pm",
            "content": "I could not fully convince myself ...",
            "nose": "In the nose dominate the flowery impressions, Hubba Bubba chewing gum and artificial strawberry flavor and pear juice. A few butter cookies with whole hazelnuts are still present after all.",
            "taste": "In taste, these impressions of fruit - now mirabelle and peaches -, pastries, summer flowers and mead are strangely intensified again.",
            "finish": "In the finish remain fruit sweetness and a few fresh oak staves hang, but rather short."
        },
        {
            "user_name": "riegerjonas",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "19 sep 2021 7:23 pm",
            "content": "2021-09-19",
            "nose": "it needs some air, then delicate smoke, apples, cookies, vanilla, surprisingly complex",
            "taste": "I taste something that makes me suspect a sherry touch that shouldn't be there, slightly peppery, herbal, salty, mint, menthol, honey, waxy",
            "finish": ""
        },
        {
            "user_name": "Casketje",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "26 aug 2023 4:39 pm",
            "content": "Even though contemporary batches are missing the trademark \"waxiness\" I still think this is a great whisky and, for now, still available at an affordable price. Yesterday evening I killed my bottle which had been open for at least 2 years and had been sitting at a low fill level for a good couple of months, and I was once again impressed with the quality of it - great mouthfeel, a good touch of oak which makes it feel older than it is, and just overall a very well made bourbon matured Highlander that is predominantly on the sweet end of things, but balances it out with a savoury/salty side. I still have an unopened one in the \"stash\" but I'll definitely buy another one if I see it on offer again.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "bl0wb4ck",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "16 jan 2025 2:21 am",
            "content": "Great standard. The distillery's typical waxiness with honey and a hint of citrus. There is also a fine, light fruity note in the background. The 14 years suit it well, the 46% ABV is also great. One of the absolute showcase standards from Diageo.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "The_Osprey",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "19 jun 2021 5:06 pm",
            "content": "June 2021 - Clynelish 14, 46%. Attractive colour but could well be coloured. Aroma is definitely bready. Certainly a malty malt. Some baked apple. Yep apple pie for sure. Bread and butter pudding. Taste is again bready with crystalline super minerally spirit and the slightest suggestion of peat, like burnt bread and butter pudding. Bitter peaty notes increase over time. Impression of tar for roads. 3.4/81============Dec 2024 - Clynelish 14 Year Old, 46%, SMSW. 30ml sample from Mr Dram Man. Dark golden. There may well be a spot of colouring in this, but not much if so. Aroma is initially delicate, soft Opal Fruits sweets, bitter orange, burnt buttery wax (if that makes any sense at all) and celery – and the development takes place in that order for me. There’s a leafy/vegetal note coming through every so often but I stopped getting it after a few minutes in the glass. A little bit spiky. Some complexity, quite light and delicate initially until it seems spiky and burnt. Pretty good on the nose all told, as long as you’re really concentrating on it. Body is on the watery side of lightly oily. Taste has some subtle lime-like citrussy notes and light husky barley before a big punch of peat. The peppery peat hangs around along with an acrid waxed lime vibe. The bitterness and acrid waxy lime build with time, almost to soapy levels by the end of the dram. Has a little bit of complexity throughout. Plenty going on though and it has some enjoyable aspects, although it got a bit wearing for me. Maybe too acrid for me on the whole. If I had to guess I’d say the waxy spirit is meeting a few too many refill casks here. I don’t think I’d reach for this that often if I owned a bottle, though there are aspects I do enjoy. 3.4/81",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "StephanB",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "20 jan 2019 10:18 pm",
            "content": "special malt with recognition value for fair price",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "sengaia",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "26 sep 2020 8:20 pm",
            "content": "Today I did a head to head between the Clynelish 14, the Ben Nevis 10 and Kilkerran 12 year old. All of them coming at 46% and from distilleries with a reputation for producing excellent highland whisky. My notes for all of them are below.The Kilkerran 12 is the least mineral and most peaty of the three, and also the least complex. On it's own it's excellent to nose and drink, but in a glass next to the Ben Nevis and Clynelish I get the impression the purpose of the peat is to hide this lack of complexity. The Ben Nevis 10 has the most obvious sherry cask influence of the three. On the nose this is an asset, on the palate not so much. On the nose it has great complexity, balancing waxiness with oranges. On the palate the dry sherry quickly takes over and is entirely too dominant for my taste. This dryness carries on into the finish which is the weakest part. Overall this is good but also uneven and I am left with the impression this could and should have delivered more on it's initial promise.The Clynelish 14 offers a harmony of flavours and a consistency across nose, palate and finish that are easy to overlook, but in a head to head like this it really stands out. The nose is like walking into an old library where the floor has just been waxed. The palate makes no attempt to score easy goals by adding sherry sweetness or peat. It is actually pretty salty and bitter, and wonderfully waxy and complex. The Clynelish 14 has been a standard in my whisky cabinet for many years. It has always been good, maybe its quality has improved over the years, my appreciation for it certainly has. Today I was impressed with how convincingly it beat its opponents.Of the three compared here, the Clynelish is -in my opinion- the best. It is also the cheapest and the most easily available. The others are by no means bad, and exploring and debating such differences is what makes the whisky world a fun place to be.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Woodsmoke",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "01 dec 2017 7:24 pm",
            "content": "A Mix of Arran 10 and Craigellachie 13. I like it!",
            "nose": "Blind Tasting:He has arran touch. I smell bright fresh fruits. Little bit redwine. Little bit Orange. Dates and dough. Grain.",
            "taste": "Sweet with grain and fruits. Little bit dry. Soft and creamy.",
            "finish": "Grainy and fruity."
        },
        {
            "user_name": "Crann feàrna",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "10 jan 2015 4:48 pm",
            "content": "Complex. Interesting. Buy.",
            "nose": "No water : Complex. Honey. Cookie dough (?). Hint of brine and smoke.With water: overwhelming, pleasant honey. Still hints of brine. No smoke.",
            "taste": "No water: deliciously complex. Heathery sweetness in the mouth, peppery heat on the palate, dry development towards licorice.With water: creamy sweetness of heather, bananas. Dry and warm on the tongue.",
            "finish": "Long, soft, lingering. With hints of honey, banana, locorice."
        },
        {
            "user_name": "aquataste",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "14 oct 2024 8:45 pm",
            "content": "",
            "nose": "Perfumed at the beginning, fresh, aromatic honey and aromatic herbs, delicate citrus, beeswax, lots of apples, ripe oranges and peaches, a bit of milk chocolate, a bit floral, a bit malty, light notes of old oak, a light breeze of the sea in the background",
            "taste": "fresh, lots of honey, malty and slightly citrusy, a small pinch of spices and herbs, vanilla, green apples, some peaches, slightly floral, notes of old oak with a slight bitterness. a bit of dark chocolate, orange peel, slightly nutty, a pinch of salt",
            "finish": "Medium length, citrusy, salted dark chocolate with nuts, tiny pinch of dried herbs, slightly malty at the end"
        },
        {
            "user_name": "uap304",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "09 aug 2022 4:41 pm",
            "content": "This is my second bottle and same score this time around. If I’m being honest, unfortunately I still don’t get that classic waxy note that I’ve heard so much about. And that’s fine, I certainly can’t blame the whisky for that. However at the same time I’m just left feeling that this is a bit bland overall.",
            "nose": "Apple juice, spices, and floral, with lavender at times. Bright, soft, and sweet in nice balance with the palate. At times, charcoal appears. Other times, lager. Cinnamon and vanilla bean. I do sense some plastic at times on the nose. With water, much more tame, which is saying a lot because this is not a whisky which speaks out loudly.",
            "taste": "Sweet and very effervescent. Dry and floral. Welch’s grape juice. With water, cinnamon candy. Again, soft and sweet in good balance with the nose.",
            "finish": "Fruits, chocolate, cream, and toffee and caramel at times. Again some lager tones. If I’m being hasty with this dram, the finish becomes hot with ginger and pepper along with bitter oak. Something in the early finish feels like orange soda which is very pleasant when present."
        },
        {
            "user_name": "uap304",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "08 oct 2017 10:01 pm",
            "content": "Old fashioned style I guess.",
            "nose": "Malt, honey, chocolate, faint sherry.",
            "taste": "Thick and syrupy but somehow does not take water well.  Flat arrival, sweet, becoming spicy.",
            "finish": "Bitter oak finish."
        },
        {
            "user_name": "EinSpatzUnterVielen",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "09 aug 2017 11:03 pm",
            "content": "There is a lot in it, beautiful standard with many facets, always tastes a little different.",
            "nose": "Lemon, beeswax, apples, oranges, herbs, honey, a hint of smoke",
            "taste": "waxy, tingling, creamy - strong malty and spicy, oranges, apples, pineapple, mango, nutty, dark chocolate, ginger, white pepper, slightly salty (salt sticks?), slightly sweet, light acidity",
            "finish": "rather short, dark chocolate, spicy, tart-sweet"
        },
        {
            "user_name": "BarleyMail",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "05 dec 2021 10:39 pm",
            "content": "",
            "nose": "Zest of oranges, mandarins, green apples, lemon, honey and wet stones. Then a salty sea breeze.",
            "taste": "Very nice, thick mouthfeel. Apples, mango and citrus fruit, candle wax, honey and ginger.",
            "finish": "Mangoes, orange and lemon zest that remains. Price/quality a top! Very tasty!"
        },
        {
            "user_name": "Opeth83",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "04 jul 2015 10:15 pm",
            "content": "Caramel, sea salt, wax, lemon and ripe fruit on the nose in the mouth even more of that ripe fruit (pears, apples). In the aftertaste again the wax, malt and light bitter (not annoying). Pretty complex malt, very nice whisky for a good price!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Peatyjohn",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "27 mar 2025 6:42 pm",
            "content": "One of the classic malts, good value. Creamy, waxy, honey lathered spices with sours , fruit and sweet wood smoke, caramels, spicy and turns sweet with bare sugar. Quite short finish of sweet zesty tea and florals. A lovely tasty ex bourbon cask dram that appreciates time in glass to fully appreciate. This will be on my permashelf.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Glennie",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "08 jun 2016 12:03 am",
            "content": "N: Very fruity. Pears. Some citrus like citrus bon-bons. A faint hint of smoke. Malty and herbal.T: Fruity again. Pears and other white fruits. Some sweet citrus and honey notes. Spicy. Substantial and beefy.F: Very much an extension of the taste. Dries out towards the end with some Wood spices. Not bitter at all.A really good bottling from Diageo. Can be found for around €40 pr. bottle. Proves that it is still possible to find good and affordable whisky out there.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "vojt466",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "15 aug 2016 7:20 pm",
            "content": "So I recall what appealed here - this is not bad drinking at all, maybe spice could be a little smaller, but so",
            "nose": "Beautiful fruity scent - butter pears, oranges, bananas, honey, wax",
            "taste": "Slightly sweet and gentle to moderately spicy - honey / wax, cinnamon, malt, some fruit, a little salty here.",
            "finish": "Medium / long - reverberant woody tones, melt and spiciness again"
        },
        {
            "user_name": "praisethepasta",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "11 oct 2016 10:47 am",
            "content": "To me, a versatile and complex whisky that takes me by surprise every time I have a dram. Not your everyday scotch, maybe even somewhat of an aquired taste, but very much worth the effort. It promises wax, and it delivers, but it also brings the typical coastal elements to the nose and initial taste.  Then, a rich, warm and medicinal body opens up, strong tastes of grass and oil kick in, with a strong and lasting, slightly smoky finish. considering  its price, this is a very, very fine and complex whisky.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Larry411",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "17 jul 2023 8:12 pm",
            "content": "Orchard fruits (some waxed), vanilla, cloves, bananas and their peels, grapefruit, some florals, and white pepper. It has a nice chewy mouthfeel and is a super-solid easy-pleasing whisky. This is exactly how I imagined it would taste like - prototypical Clynelish at its most Clynlishy.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "KyleRiemen",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "15 nov 2023 9:02 pm",
            "content": "",
            "nose": "Caramel, vanilla, sour green apple, pear, the whisky's older age is hidden under this sour coat, pineapple, malt.",
            "taste": "Oily waxy, honey, vanilla, sour apple, grassy, potatoes, toffee, caramel, a really very slight saltiness, although I like it a lot, there isn't much more here, but it's not always just the complexity that is decisive for the evaluation.",
            "finish": "Medium long, warm, honey, vanilla, toffee, round, with a slight bitterness at the end."
        },
        {
            "user_name": "Nomorewh",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "03 dec 2023 5:49 am",
            "content": "",
            "nose": "Rich apple jam, honey, grapefruit, floweryConcentrated and pleasant nose.",
            "taste": "Little saltiness and rich sweetness of honey, followed by bitter taste of lemon zest, grapefruit and sweet persimmon.A good, pleasant waxiness.",
            "finish": "A bitter, savory aftertaste of persimmon and grapefruit. Complex, medium-lingering."
        },
        {
            "user_name": "Matthias80",
            "user_rank": "Expert Senior",
            "rating": "77",
            "review_date": "02 oct 2022 10:09 pm",
            "content": "In itself quite ok in terms of aroma, still dominated by the distillery character after 14 years. Still a bit sharp and hardly present in the finish, so not a really good rating.",
            "nose": "Apple, some vanilla, very slightly spicy, hardly definable, overall fresh, some zest at the end If longer in the glass, then more citrus aromas",
            "taste": "Fruity-fresh, but with a bang, a certain spiciness is still there, decreases and becomes sweeter. Apple, yes, but less dominant than on the nose, ripe fruit with citrus, some vanilla, very light notes of honey. The second, slightly larger sip then reveals a small flaw, slightly spirity / solvent-like, but really very little.",
            "finish": "Not so rich, there remains a little fruitiness (banana, melon) and honey aromas, but not really much and only briefly."
        },
        {
            "user_name": "dissonance",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "24 jun 2021 9:35 am",
            "content": "RATING: 87pts – |87 – 89 (B+) → Great| — Always nice to have a bottle of this.",
            "nose": "The nose is fruity and sweet with subtle spices and pronounced waxiness with touches of peaches and pears.",
            "taste": "The taste is slightly sweet and has a domination of honey followed by wool, lemons in honey and lamp oil.",
            "finish": "The finish is medium lenght with lots of coffee, vanilla and has hints of wet granite, honey and pear pie."
        },
        {
            "user_name": "AX1654XA",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "19 may 2023 7:11 pm",
            "content": "Genekern",
            "nose": "Nose fruity, peach, grain tones,",
            "taste": "Dry, viscous, calm, pungent",
            "finish": "Dry, bright, astringent"
        },
        {
            "user_name": "Victor_Harri",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "25 dec 2021 8:43 pm",
            "content": "You cant beat that price for a classy 14 year old. And classy it is. A bit oily but great aftertaste. Just dont know why the colour is a bit dark since they claim no artificial colouring has been used.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "AdelphosHume",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "12 may 2019 7:37 pm",
            "content": "Good complexity that develops with time in the glass. Malt and vanilla grow while the lemon-citrus recedes on the nose and palate when left to open. The finish is wonderfully long.",
            "nose": "Malt and lemon oil infused wax, a touch of vanilla, sea-salt and aged-oak, lemon bars, candied lemon peel and orange blossom, bay-leaf and sandalwood, freshly zested lemon peel on lemon meringue pie.",
            "taste": "Malt and a touch of vanilla custard, waxy lemon candy and candied lemon peel, fresh (fuji apple and pear) and dried (papaya and pineapple) fruits, cinnamon and nutmeg and oak, and mix of fresh and candied citrus peels.",
            "finish": "A bit of vanilla in unsweetened macchiato, faint orange blossom water, Dong Ding oolong tea, and oak tannins and oatmeal with a pinch of cinnamon and brown-sugar."
        },
        {
            "user_name": "Whisky101",
            "user_rank": "Expert Senior",
            "rating": "90",
            "review_date": "01 apr 2018 10:52 pm",
            "content": "A fantastic dram for its age, price and great to see it at 46%. This is a dram that is way more complex than you expect and if you keep re visiting it you just find more and more. You need to spend time with this whisky and come back to it as your palate develops more. I always have this in my collection.",
            "nose": "Citrus Fruit: oranges, marmalade, slight toffee.",
            "taste": "Orange, zesty, some fruit and a very light vanilla but not toffee sweet (like in the nose), and it is quite drying from the oak. Leather notes, and some light oils.",
            "finish": "Long, staying dry and leading into spice and dried fruits with quite some nuttiness."
        },
        {
            "user_name": "Thatch",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "27 feb 2022 6:56 am",
            "content": "And the Clynelish 14 - how pleasantly different! It will definitely come to me as a large bottle - it's amazing that there is something like that for 40€.",
            "nose": "Vanilla, sweet floral aromas (orange peel, mint, flower meadow). And then this wax aroma, somehow beautifully integrated. Smells like a fresh scented candle. With water comes such a powerful change! Banana and other tropical fruits, ginger and a slight sweetness. Hammer!",
            "taste": "BANANA! I've never smelled 50 cent jelly bananas so directly. Apple and mint also come out, vanilla and wax again, but this time more beeswax. Bitter notes that become stronger over time. Much milder with water, a balanced fruit and malt remains.",
            "finish": "medium length, fruity-bitter. A wonderful, mild conclusion to the varied aromas."
        },
        {
            "user_name": "tommy12",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "11 apr 2022 11:47 pm",
            "content": "pleasant fragrance, full, round, sweet, long finish, good aroma pressure and delicious. Overall a good standard whisky aged 14 years. Ideal drinking strength. Just a pity that it is colored.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "CaskNLeaf",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "10 dec 2017 6:12 pm",
            "content": "First impression / color / consistency: The 14-year-old Scotch was given a nice outer packaging with a subtle watermark of the \"Highlands Tiger\". I like it! The marketing blah blah on the can and bottle reads nicely and sets the mood for the whisky. The cork is pressed and after removing it it smokes from the bottle. Coool! The malt has been colored, so there is no need to say anything about the color, but for the sake of completeness - “Saffron” was the choice of the Diageo experts. Wow! Very, very, very oily the tears run down the glass wall. Something creamy awaits me in my mouth! Aroma / nose feeling: The official notes don't promise too much. A flood of honey, flowers and a light acidity comes out of the glass. Nothing stings your nose here. The 46% ABV seems to be optimal so far. Fine, harmonious mineral notes fill my nose. Indeed, the subtle maritime character cannot be concealed. Is there sherry involved? The \"whisky wanker\" had noticed this too. For me there is a lot that suggests it. Anyway, a slightly nutty, oily sweetness would also suggest it. But where is the candle wax that Diageo itself and many, many other connoisseurs want to see so strongly. So far it remains hidden from me or I have no association with it. After sniffing and smelling a real candle for a long time, I have to say that the wax scent still doesn't cross my mind, but the nose feel has changed significantly. So I now imagine I have a feeling in my nose which is similar to the feeling when you actually smell a candle. The impression that sherry had an influence on the single malt is getting stronger and stronger. Aroma from the empty glass the next morning: Calm and not worth mentioning. Taste / mouthfeel: Really fantastic oily in the mouth with sweetness and the onset of bitterness. The wood can be clearly tasted. In my opinion, this is not a pure entry-level malt. I could imagine that the roller coaster ride in the mouth could be too intense for some new connoisseurs. For my part, I find the first drops in the mouth very interesting and promising, although I also don't like the acid that is present. The scotch just keeps getting better. It has really well controlled corners and edges, which make it a rather unusual malt in this price range. Behind everything there is a certain salty taste, which can also be felt in the aftertaste. Finish / aftertaste / length: Noticeable acidity right from the start of the finish to the taste. A medium to long finish is accompanied by orange zest, some pencil abrasion and mild sweetness. Strong mineral saltiness gives the single malt a strong character. At the very end it feels like I'm licking a still. Sounds strange, but that's how it is. I'm licking off a spirit still. And how! Awesome! Well, while proofreading, I also have the wax with its full width in my mouth. I understand everything now! Later, but still ... The next time I have this malt in the glass I will probably have to think about it immediately. Overall impression / comment: The scotch is actually kind of a cornerstone in some ways. If I had to name a maritime Highland Malt, I would probably come back to the Clynelish 14yo. Very characteristic! I'm not completely speechless now and I'm not blown away by this experience, but this is a well-crafted single malt Scotch whisky that you can either sip away easily or examine over a longer period of time. I like it! Points: 87/100 # Clynelish #SingleMalt #Scotch #Scotland #Highland #Whisky #EnjoyLife #Enjoyment # DrinkResponsiblyfb.com / wagneralextastingnotes",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Corso_theRed",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "20 aug 2014 1:27 pm",
            "content": "It’s nothing punchy, or overly fringy. Rather austere and mild-mannered. It is enjoyable, but also nothing special in my book.",
            "nose": "Subdued, light, and floral. This translates to citrus, like orange-grapefruit sorbet; then pollen, and balanced nose between sweet and dry. Candle wax? A certain strand of refill sherry butts perhaps?",
            "taste": "Sweet and briny. Quite full, with honeyed menthol and mild licorice.",
            "finish": "Medium. Remains briny, yellow-fruity, and the oak finally speaks a little."
        },
        {
            "user_name": "Mugis",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "10 nov 2024 5:22 pm",
            "content": "",
            "nose": "Candle wax. Herbal or grassy notes. All in all, a pleasantly light scent.",
            "taste": "Incredibly oily and thick. More of the herbal notes already present on the nose. Added to that are maritime flavors towards the end.",
            "finish": "Maritime finish, somewhat reminiscent of Bunnahabhain. Very dry."
        },
        {
            "user_name": "hogsheadwhisky",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "28 jun 2021 10:24 am",
            "content": "A really nice and well-made standard. Great whisky. Excellent nose and also knows how to please in taste. As long as there are such OA standards, the whisky world is still reasonably okay, despite all prophecies of doom.",
            "nose": "Dark yellow or light gold is reflected in my Premium Snifter and numerous legs run oily down the edge of the glass. The first impression is very appealing. Lightly perfumed, a flower meadow or, specifically, a lilac bush in full bloom. In addition, a potpourri of ripe yellow fruits such as pears and apples as well as apricots. Paired with a good portion of honey that is still hanging on the honeycomb and slowly dripping down. Alcohol is not felt, well integrated. With time in the glass you can still see some honeydew melon. The oak in the background is very aromatic.",
            "taste": "A creamy, very waxy mouthfeel at the beginning. Interestingly, the Clynelish opens with a tangy, spicy and aromatic oak note which then quickly turns into a honey sweetness. There are also various fruit components from the nose, such as pear and melon. Now there is also a slight acidity, not unlike lemons. The 46% alcohol content is also very well chosen in terms of taste. The slightly peppery note at the beginning can be clearly assigned to the barrels.",
            "finish": "This tasty combo of tangy, peppery oak and honey-sweet fruit continues towards the finale. The oak now also gets a little bitter touch, like a little brown or dark chocolate. But not with too much cocoa, the flavors always stay well balanced. All in all, the finish is medium long."
        },
        {
            "user_name": "Gearmailteach",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "12 oct 2019 8:48 pm",
            "content": "Excellent PLV. A standard that should not be missing in any bar.",
            "nose": "Beeswax and furniture polish. Iodine and a gentle hint of smoke. Behind summer meadow and bright fruit. Green apple, apricot, orange and quince. Also vanilla and herbal flavors. Very complex, very pleasant.",
            "taste": "Oily, creamy. Peppery on, chili. Then again fruit and some oak. Spices and coffee. Somewhat less complex than the nose.",
            "finish": "Mitel long. Oak, coffee, vanilla."
        },
        {
            "user_name": "morningside1000",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "21 oct 2023 11:37 pm",
            "content": "Tasted on Fri 21st Apr 2023 as part of an East Coast Whisky ‘Clynelish 2 - The Cat Strikes Back!!’ 14-dram vertical (https://www.eastcoastwhisky.com).Comment: A great bang for your buck malt and a wonderful base from which to venture into some older bottles. The Clynelish 14YO OB blend has been a bit variable over the years, but this from mid 2023 was a nice example.Colour: Mustard yellow.",
            "nose": "Yellow citrus, spearmint menthol and developing note of wintergreen.",
            "taste": "Fresh yellow fruit, apple and citrus sweetness, with a touch of bourbon richness.",
            "finish": "Medium coastal salt and fading spice."
        },
        {
            "user_name": "smolar231",
            "user_rank": "Expert Senior",
            "rating": "79",
            "review_date": "31 aug 2023 1:24 pm",
            "content": "",
            "nose": "citrus, herbal, more dry than sweet, cellar, honey",
            "taste": "peppery, bitter, warming, oily, a bit of smoke",
            "finish": "quite short, warming, dry"
        },
        {
            "user_name": "MarcelWhiskyPanda",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "03 dec 2024 11:21 pm",
            "content": "",
            "nose": "A bit more complex for a beginner Flowers in a glass Vanilla with honey is also available Waxy Several fruits together Pineapple / Peach / Pear / Mirabelle Overall very fruity / floral Alcohol is also well integrated Not too much and not too little After some time herbal Super nose",
            "taste": "Direct fruity to floral Pineapple / Peach / Pear Vanilla follows Honey Some available Oak at the end The bright fruit remains present all the time",
            "finish": "Medium length Vanilla Green pineapple (slightly sour) Finally, the wood prevails"
        },
        {
            "user_name": "afrb",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "22 apr 2015 8:16 pm",
            "content": "A fairly complex, desireable whisky. I give this whisky 84 marks",
            "nose": "Vanilla, Oak Wood. Pineapple, leather, Pears, honey and Menthol",
            "taste": "Light. Fiery. Fruity, Oranges and Pears. Creamy",
            "finish": "Medium to Short. Dry. Honey and some Pepper"
        },
        {
            "user_name": "Svjatogor",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "27 mar 2022 9:31 pm",
            "content": "n: citrus, fruity, lemon, grassy, green apples, meadow, clover, sour, honey, pollen, wax, seaweedt: oily, smooth, citrus, grassya: pleasant, herbal, pollen, lemon peel, candy",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Dram Brigade",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "22 mar 2023 3:27 pm",
            "content": "I believe this is a 2018/19 bottle, pretty great for a core range bottle.Tried this many times but just realize I never put a review. However sadly the new batch I tried aren't as complex nor balance.",
            "nose": "Good ol' bee wax, mead, fresh apples, malty, some minerals.",
            "taste": "A little salty, beewax, camphor, some fresh apples, some minerals, then honey again. Pretty balance!",
            "finish": "Medium long, with some good saltiness and honey.. if only this finish longer"
        },
        {
            "user_name": "wbarchive_879608",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "06 nov 2021 6:57 pm",
            "content": "Nice soft yet fairly complex dram.",
            "nose": "My first impression was.. bourbon.. clear bourban casks matured whisky, behind that is the waxy character of this dram, with sweet florals in the background and the malt",
            "taste": "There soft entrance, sweets are dominant, the mouthfeel is that waxy in combination with powdered sugars that dissolve",
            "finish": "The finish is medium, sweet with some light green herbs and a little mint"
        },
        {
            "user_name": "wbarchive_149037",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "22 oct 2015 10:54 am",
            "content": "A very good one. Excellent price quality ratio. It reminds me Dalwhinnie on some parts (honeyed and vegetal notes) and Springbank on some others (wax and mineral aspects). Very good nothern Highland Whisky.",
            "nose": "Oranges, fruiter than expected. Then more vegetal notes, with some heather, flowers (violets). Becomes more maritime and mineral with the aeration. Salty. Nice nose, quite expressive.",
            "taste": "Thick, nice boody, good attack with good ABV. A bit honeyed and vegetal, wax, and become saltier and saltier with the time. I also get some oranges like in the nose.",
            "finish": "Medium long, on nice salty and bitter end."
        },
        {
            "user_name": "Captain.Islay",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "29 sep 2018 11:44 am",
            "content": "Very complex, fantastically different, no beginner's malt",
            "nose": "Green apples, bitter green tea, floral, candle wax, dried hay, chalk, herbs, honey, mineral, apricot, lemon",
            "taste": "Fresh, mint, creamy, honey, apple, lemon, green banana, pear, apricot",
            "finish": "Medium-long, bone-dry, walnut skin"
        },
        {
            "user_name": "L_Gillian",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "15 feb 2021 8:46 pm",
            "content": "The perfect gateway bottle to learn to appreciate more challenging whisky. My teacher dram. The bottle reviewed here was a 2019 bottling.",
            "nose": "Fruits and candlewax, leather, a touch of salt. Dry grass and a hint of paint thinner. Sour fruits, some apricots, pears, plums, all of which drizzled in honey.",
            "taste": "Medium body, oily texture. Chili powder, sour grapefruit juice and bitter oak. Later on the fruitiness from the nose returns.",
            "finish": "Medium long. Sultana sherry note when going down. Waxy texture coating the mouth, subtle oak now less bitter and more dusty and dry. Coffee grounds and saltiness."
        },
        {
            "user_name": "Malinois",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "25 apr 2018 7:54 pm",
            "content": "Good whisky for this price! On the nose some sherry notes with honey, pear. Quite waxy taste with honey pear and some soft salt. The finish short and a bit fruity. Good value for money, especially the waxy mouth feeling isn't something you get for this price.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "zholthran",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "02 nov 2014 1:44 pm",
            "content": "An outstanding and well-balanced malt with no real corners and edges.",
            "nose": "To ripe fruits (pears, apples) joins a light and fresh citrus note.",
            "taste": "Sweet and mild onset with fruit, then soft oak tones are added, wrapped in light smoke. Overall slightly oily texture, the alcohol is very well integrated.",
            "finish": "Medium-length and warming finish. In addition to herbs, the oak is now clearly dominating without becoming really unpleasant."
        },
        {
            "user_name": "EnjoyLife89",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "05 mar 2019 9:43 pm",
            "content": "Definitely has character, very interesting mix of sweet and maritime. Find it very well matched and is a top malt for me.",
            "nose": "Sweet, ripe fruit, honey / wax and citrus",
            "taste": "Sweet, oak, maritime note in the form of salt",
            "finish": "Medium long, citrus -> later turns out to be orange, oak, maritime"
        },
        {
            "user_name": "Angelos",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "20 jun 2015 9:28 pm",
            "content": "Ideal summer dram and a really good drop",
            "nose": "Wax with honey flavor, caramel and pineapple, pleasant vanilla note, also a certain floral / floral note I like to feel, as well as something maritime / salty.",
            "taste": "Again, the caramel and the saltiness, so slowly makes the oak noticeable, here also the exotic character with peach, pineapple and a few oranges",
            "finish": "Medium long, almost short; But it does not have to be bad. A lovely oak note remains with the maritime / salty character"
        },
        {
            "user_name": "anonymerlemur",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "01 jan 2021 9:13 pm",
            "content": "very nice to drink, really balanced through and through. perfect daily dram.",
            "nose": "A little alcoholic at first, wax, cashew nuts, malt, peanuts, wine gums, freshness, mint, cream",
            "taste": "The mouthfeel is waxy and syrupy. The taste is also determined by wax, malt, milk chocolate, oak wood, salted caramel. Not cute at all.",
            "finish": "slight bitterness, full-bodied and very sweet with cashew nuts."
        },
        {
            "user_name": "keizerjos",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "06 feb 2020 11:15 am",
            "content": "Softly sweet Speysider. Honey, vague banana, slightly sharp, soapy - and that's not good, I think. A long time ago, at the start of my career, but in 2015, I bought a bottle. I then wrote: Smell sweet, candy, honey. Fresh, light, soft wood. Vanilla, minty, raisins - waffles? If you have it in your mouth for a little longer, it is English licorice. All in all I thought it was too light. Everyone's friend with soap flavor in the distance that doesn't make me happy.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Dramrunner",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "27 dec 2024 4:10 pm",
            "content": "Average whisky that doesn't stand out",
            "nose": "Light and fresh, weak, chocolate, floral",
            "taste": "Cool, green flavors. nutty, grainy",
            "finish": "Medium length"
        },
        {
            "user_name": "Don Cassi",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "29 jul 2021 11:35 pm",
            "content": "Nose and mouth still convince with apricots, citrus and honey, but in the finish it has a bit too much dry wood, a shame Length: 4/10 Edit: a few moons later the wood doesn't come out that abruptly and the malt is much smoother in the mouth 78-> 80 Grade: 2",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Classic",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "16 apr 2017 5:23 pm",
            "content": "N: Light fruits, slightly floral, slightly spicy  T: First green apples, then pears, pleasantly spicy, slightly sweet  Q: Medium long, the fruits are going and it gets a bit peppery, then comes the barrel with its spice and tannins",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "NightRainb0w",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "21 apr 2025 6:01 pm",
            "content": "",
            "nose": "Lemon peel, vanilla custard, buttery cookies, apple pie, beeswax, floral honey, canned pineapple.",
            "taste": "Cornflakes, lemon, toasted bread with butter and honey, applesauce, tangerine, dried elderflower.",
            "finish": "Honey, cornflakes, buttery shortbread, dried elderflower, light orange pith, lemon peel."
        },
        {
            "user_name": "CellarToberi",
            "user_rank": "Expert Senior",
            "rating": "91",
            "review_date": "15 oct 2023 4:45 pm",
            "content": "Coloured. Chill-filtered. Thick slowly forming primary legs. Narrow straight secondary legs.",
            "nose": "Fruity: fresh fruit: pear, apple; citrus: orange, lemon; stone fruit: apricot. Cereal: dough, hey. Sweet: honey, confectionery, vanilla. Feints: wax, tang. Floral: heather, citrus bloom. Smoky: char, fusel oil note. Spicy: mustard, ginger. Herbal. Savoury. Maritime: salt, seaweed. Woody: oak, cedar. Oily note. Earthy note. Full body: complex. Rich. Water brings up sweet and waxy notes.",
            "taste": "Sweet: honey, syrup, . Fruity: fresh fruit: mellon, pear; Stone fruit: apricot; citrus. Spicy: ginger, pepper, mint. Woody: oak, cedar, oak tannins. Herbal: bitter herbs. Smoky. Maritime: salt. Feints: wax. Cereal: sweet bread. Earthy note. Full body: dry. Water brings up fruity notes.",
            "finish": "Sweet: honey, confectionery. Spicy: ginger, tea. Herbal. Fruity: fresh fruit, citrus, candied fruit. Winey: IPA beer. Cereal: bread, cereals. Maritime: salt. Woody: oak tannins. Feints: wax. Oily note. Full body: dry. Water brings up spicy notes."
        },
        {
            "user_name": "Jonkers",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "14 nov 2016 3:46 pm",
            "content": "The balance of this whisky is reasonable. The taste is the best part (and in the end it's all about that ...). This whisky is a perfect aperitif.",
            "nose": "Sweet from tropical fruits such as banana, pineapple and mango. A hint of butter. Vanilla and oak.",
            "taste": "First sharp and peppery, which makes the taste buds \"awake\". Then very sweet with notes of banana, pineapple, papaya and mango.",
            "finish": "A medium finish with a very pleasant combination of bitter and sweet."
        },
        {
            "user_name": "Remko",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "12 dec 2015 7:52 pm",
            "content": "I'm a Clynelish fan for quit a while now, but untill recently I never took the time to judge this OB 14Y quite well. What a same... This 14Y really enjoys me and is surprisingly complex. Clean, flowery, fruity, citrusy, meaty, waxy, oaky, malty, mineraly, salty, oily, slight peaty, all in one. Not all at the same time but nicely alternating. It really develops in the glass.Only 1 minor: the finish is a bit short.Wish it would be avaible at higher ABV...",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Sanma",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "06 nov 2024 12:21 pm",
            "content": "",
            "nose": "apple, honey, vanilla, citrus, floral, toffee, malty and johnny blue",
            "taste": "Apple, apple, malty, citrus, honey, toffee",
            "finish": "Honey, floral, malty, apple, toffee, beeswax"
        },
        {
            "user_name": "moogician",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "29 feb 2024 7:31 pm",
            "content": "",
            "nose": "yellow floral notes, hint of banana, some pineapple, hint of brown sugar, smoke, beeswax, citrus, a little bit of maritime flavor, spirit, bean, honey",
            "taste": "a mild flavor. oak, juicy, some pungency from alcohol, smokiness, cinnamon,",
            "finish": "medium, mostly oaky, hint of smoke (or charred oak?), a little bit of under-ripe banana"
        },
        {
            "user_name": "Der_Schnappulierer",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "20 nov 2020 7:53 pm",
            "content": "A great standard, more mineral and earthy instead of sweet and fruity.",
            "nose": "First of all light-colored fruit (apple, pear), some apricot. The famous Clynelish wax is there, plus very light smoke and iodine. After a few minutes oranges and lemons. Great.",
            "taste": "Wonderfully oily, sugar, apple, very creamy. Pepper, a little salt and light smoke.",
            "finish": "Long and voluminous, salty, light smoke and sweet."
        },
        {
            "user_name": "wbarchive_864627",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "11 jan 2024 2:17 pm",
            "content": "86+",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Koloman",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "12 mar 2015 7:35 pm",
            "content": "A single malt with a unique selling point: Something similar is unknown to me. To taste it takes time, because he does not want to reveal his secrets right away.",
            "nose": "A triad of fruit (mandarin), nut (nut cake) and smoke (a shred of very light pipe tobacco), ethereal but increasingly intense.",
            "taste": "Mustard, indeed! Orange, nut and smoke, all in all, much stronger and more engaging than expected.",
            "finish": "Even more strength, Bavarian (sweet) mustard, Turkish honey, bath cleaner and - I can not believe it - frankincense."
        },
        {
            "user_name": "Jimjam",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "26 apr 2014 11:28 pm",
            "content": "There’s lots here, I really enjoyed this, a fine coastal dram. One that’ll reward repeat visits.",
            "nose": "Rich orange oil, wet boat rope, grapefruit, rich dried fruits, brine, black pepper, spice, a light smoke, acetone, almond syrup, a slight vegetal note",
            "taste": "Rich spicy fruit, seasalt, drying wood",
            "finish": "Lingering wood, smoke, and spice. Almost bitter at the end"
        },
        {
            "user_name": "Hsh",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "01 aug 2022 1:14 pm",
            "content": "Oily Juicy Orange Waxy Honey Vanilla",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "KEngelaar",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "29 jul 2022 8:53 pm",
            "content": "Bottled at 46% abv. in a slim bottle. Nothing fancy there. It has a hard to define nose. A very massive aroma. Slightly waxy in the beginning, which gives an impression of smoke, although it is not peated. After that it opens up and delives nicely.I have no idea, why the Flora & Fauna version of this whisky with 43% abv. exists. This one is better and it will keep you warm in the winter or when fishing. I recommend this for Christmas, not only as a present but also as a dram after dinner or when meeting neighbours.",
            "nose": "Waxy at first, almost slightly peated. Maritime and floral. A slight citrus smell and sweet. After adding a few drops of water honey and vanilla and the citures smell becomes more clear towards mandarine.",
            "taste": "Creamy and silky, at first alcoholic, but as it dilutes in the mouth it becomes really sweet, like a pear cooked and served with stewed cranberries. Mouthwatering.",
            "finish": "As the sweetness becomes weaker, the oak becomes more dominant, and the process is nice and smooth. Then some licorice appears along with a maritime note. The maritime note lasts longest and is quite refreshing."
        },
        {
            "user_name": "CabezaMalteada",
            "user_rank": "Expert Senior",
            "rating": "79",
            "review_date": "14 jan 2026 8:42 pm",
            "content": "An absolute classic for anyone starting out on the single malt journey, perhaps not so much for those of us here, but that doesn't diminish its merit. It's an educational bottling in the old Highland style, with a profile similar to a Mannochmore, Dailuaine, or Inchmurrin. Predominant notes: red apple, caramel, orange. Complexity: medium-low. Perhaps the best OB in Diageo's core range. 75 - 79 | Average",
            "nose": "Baked red apple, almost caramelized. A very pleasant hint of orange essential oil is present. The nose is well-structured, although, if I had to find fault, it lacks volume. It doesn't seem to have 46% ABV; it lacks intensity.",
            "taste": "A composed, competent attack. Slightly oily, without overwhelming the palate. Once again, the Tatin tart takes center stage. Then a touch of honey with orange, garnished with white pepper.",
            "finish": "Medium-bodied, rich in caramel and subtle hints of nut. A light touch of pepper and an almost imperceptible smokiness, like a lingering memory. Classic."
        },
        {
            "user_name": "Xstream",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "03 sep 2014 7:44 pm",
            "content": "Doesn't really work for me. It lacks something that pops. It's flowers with citrus, coconut and other fruits without any real zing. It's a bit bitter in the finish, tad generic and not lively. Adding water didn't do much interesting either. Update: becomes better over time after opening the bottle. Now i enjoy it more. The fruit now seems to open up more.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "FoivosSoueref",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "15 nov 2022 10:53 pm",
            "content": "",
            "nose": "Barley sugar, intense maltiness, strong strong barley and honey. Close to Craigellachie 13 range. A hint of bee wax in the back",
            "taste": "Just like the nose, the barley aromas translate in full barley flavours on the taste. Honey notes, some fading meatiness, a bit herbaceous, a bit spicy. Intense through and through.",
            "finish": "Long aftertaste, nuttiness along with spices and peppery notes persisting on the back of my mouth. I get a burn like feeling (not an alcoholic one) on the end of the finish."
        },
        {
            "user_name": "diamond2000",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "05 mar 2019 1:12 am",
            "content": "Aroma: vanilla, overripe rotten pears, honey, blooming lilac, minerality, granite in the sun, fresh white bread broken in half.  Taste: honey, honeycomb, orange peel, spicy, oily.  Aftertaste: repeats the taste, honey, wax, a little pepper, on the tongue you directly feel the film of butter, rather long.  Rating: 85-86  Conclusion: a very good representative of the Highland with a wonderful fortress (in Diageo this is the only official release that crossed the threshold of 46%) which adds integrity. Molt is very strict, without excessive sugaryness, even though honey is in the first place everywhere, in general, Highland, which I love. There are not very many nuances, more in flavor, but everything is very consistent and consistent.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "RichardPsmith",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "27 feb 2024 4:14 pm",
            "content": "Tried it on 10/23/22, in a bar, less than half in the bottle.The taste of bourbon has changed a lot, but without varnish and glue, and it has gone into quite a lot of sweetness, caramel notes, candies, pollen. The aroma is calmer, soapy notes have appeared, while the feeling of rubber and resin remains, but has changed, becoming softer and smoother. The whisky is not overpowering, it drinks pleasantly and interestingly, the aftertaste is charismatic and long-lasting.84 points. Still with an individual character that starts to approach the base whiskys.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "SimondeVette",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "03 nov 2022 4:04 pm",
            "content": "Soft and sweet, but with some character",
            "nose": "Citrus, sawn oak, nuts, coconut, vanilla, toffee",
            "taste": "Citrus, apricot, vanilla, strawberry",
            "finish": "Some oak, citrus, licorice"
        },
        {
            "user_name": "Scherenschnitte",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "29 may 2021 7:17 pm",
            "content": "High quality and a classic for good reason. Prefer this over Kilkerran 12.⁣",
            "nose": "Feels very coastal. Honey, vanilla, waxes, seawater. Doughy notes with hints of apple cider. Good stuff.⁣",
            "taste": "Very bitter orange peel, salty/briny. Olive oil, olives, oak, medicinal lip balm, hints of gin, and faint coastal seaspray.⁣",
            "finish": "Good length, pleasant salty bitterness, bitter olive oil notes, slightly medicinal, coastal, black pepper.⁣"
        },
        {
            "user_name": "Rockwell",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "02 nov 2023 12:42 pm",
            "content": "",
            "nose": "Beeswax, salt and caramel, refreshing Kyoho grapes, maple, chocolate, light green apple, and a hint of pineapple.",
            "taste": "Light briny and caramel sweetness with no aftertaste. The lock is a little bitter.",
            "finish": ""
        },
        {
            "user_name": "numen",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "08 jun 2014 10:46 pm",
            "content": "",
            "nose": "Very subtle smoke and sweet citrus fruit, particularly those giant incredible lemons from Sorrento. Honey and a little wax keeping the profile rather calm and not too sweet. The smoke helps here, too. With more air, the smoke subsides a bit and the fruit darkens, too. Orange and lemon are present, and now some dates appear. Cardamom and baked goods on the end of it.",
            "taste": "Very easy on the tongue, though there is a strong bitterness approaching. The waxy lemon and honey are there, and kept in check by the bitterness - a double-edged sword here. Cereal quality, along the lines from Frosted Flakes (it's Grrrreat!). A very direct and simple flavor profile.",
            "finish": "The length of this subsides rather quickly, but some of the smoke remains, very trace amounts, as well as a small touch of wood and those lemons (quality not quantity). I do enjoy this a lot, the flavor profile is great and to my liking, and it's put together well. Other than the abiding bitterness on the palate, that is. The finish is rather brief, too, and very simple."
        },
        {
            "user_name": "RamiW",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "07 sep 2024 2:01 am",
            "content": "I heard good things about this expression, then forgot completely about it. When trying some good distillate forward drams it popped up again, and I’m happy it did. It’s dram with distinct character, decent complexity, excellent balance and the distillate shines. Picked up bottle and it does not disappoint.",
            "nose": "Dense, sweet, and fruity. I get mostly fresh fruit, but a little bit of dried fruit too. Its famed waxy notes are faint but clear, like melted beeswax or old-fashioned candles. There’s also some malt, and the tiniest hint of smoke.",
            "taste": "It’s oilier then I would have guessed, nice and thick. Slighty waxy on the palate as well. A bit of fruit (fresh yellow fruit, some citrus) and bread, and there’s also a savoury and salty note. Again, a very slight whiff of smoke. Good stuff.",
            "finish": "Medium long/long, the sweet waxy coating lasts a while and after a while the smoke gets slightly more noticeable."
        },
        {
            "user_name": "AFB",
            "user_rank": "Expert Junior",
            "rating": "86",
            "review_date": "15 dec 2024 8:13 pm",
            "content": "",
            "nose": "slightly sparkling in the nose; fresh fruits, waxy, citrus fruits, floral notes and sea salt",
            "taste": "Oily, spices, marine notes, honey, vanilla and fruits in the background.",
            "finish": "Fruity, then light bitter notes with some sea salt"
        },
        {
            "user_name": "Francishomola",
            "user_rank": "Expert Junior",
            "rating": "82",
            "review_date": "15 feb 2022 8:30 am",
            "content": "",
            "nose": "light, uplifting, fruity, vanilla, mature malt, vinous,banana with a water 81revisited 23/03/22 8213/04/22 83",
            "taste": "nice texture, full, oily, pepper,more waxy with watercitrusy,",
            "finish": "slight bitter, dry mouthfeel, more waxy note, with a water"
        },
        {
            "user_name": "aboutWhisky",
            "user_rank": "Expert Junior",
            "rating": "83",
            "review_date": "01 may 2022 11:11 am",
            "content": "An interesting single malt that initially appears very straightforward on the nose. It unfolds its full power on the tongue at the latest and, in addition to typical bourbon aromas, brings a clear influence of the barrel and the nearby North Sea coast. https://www.aboutwhisky.de/tastingnotes/clynelish-14-years/",
            "nose": "At first he hesitates to let his aromas out of the glass. Then a distinct sweetness rises, which reminds me of honey and lightly caramelized sugar. Tart notes of oak are then added very quickly. After a few minutes, the fruit palette opens up more. The impression goes in the direction of slightly tart green apples and fresh citrus fruits such as oranges. With the slightly tart oak note in combination, it could also be bitter oranges.",
            "taste": "On the tongue it is oily, with an initial light and sweet taste. But then he quickly becomes much more powerful. The sweetness is very quickly replaced by maritime impressions and sea salt. The impression that arises is less that of a rough, stormy sea. Rather, it reminds me of a gentle breeze on the coast. The oak is also pushing more and more into the foreground.",
            "finish": "The sweetness almost fades, this will feel a bit drier. The citrus fruits can still be identified in the finish, but are then swallowed up by the oak."
        },
        {
            "user_name": "Stef89",
            "user_rank": "Expert Junior",
            "rating": "86",
            "review_date": "16 may 2018 2:54 pm",
            "content": "Really a great part.  Above all, I like it when a whisky is salty .. I find that in the.  I would have blinded him to the islands.",
            "nose": "In the nose he is very pleasing but still voluminous. Honey, cereals. He has something maritime. I do not notice smoke.  The alcohol cools the nose but is otherwise unperceivable",
            "taste": "In the mouth, the alcohol is noticeable with a slightly peppery note but all very pleasant. The part becomes relatively dry. In terms of taste, it goes for me in the direction of a sherryfassagerten malt but not very intense.",
            "finish": "In the finish this is confirmed. The fruits are darker. It is sweeter and still dry much seasoning and oak but never bitter."
        },
        {
            "user_name": "WhiskeyfanRoy",
            "user_rank": "Expert Junior",
            "rating": "88",
            "review_date": "28 dec 2021 8:26 am",
            "content": "The perfect Highland style presentation. On the nose complex floral, pear, woody, apple leaf, with a hint of smoke. It is very soft and harmonious in the mouth, but the medium body has a rich taste experience. I personally don't seem to notice the \"wax\" that the public is talking about. Maybe it is a feeling of wine sticking in the mouth? The finish is long, and you can take a breath and drink a sip of water again. Bottled at 14 years, but it seems to have an experience of a higher age, a very outstanding bottle of whisky! The taste score is 88, and the price does not affect the score.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Emperor69",
            "user_rank": "Expert Junior",
            "rating": "85",
            "review_date": "02 feb 2021 7:44 pm",
            "content": "Category: Single Malt Producer and bottler: Clynelish Distillery (Diageo) Region: Coastal Highland ABV: 46% Volume: 750 ml Bottling date: 03/28/2019 Barrel type: Ex-Bourbon and Ex-Sherry (?). I haven’t found any reliable information, please clarify in the comments, but the bourbon aging clearly comes out here. Age: 14YO Filtration: none Dye: yes The nose of Clynelish 14 is open, bright, fresh, clean and harmonious. Of course, I won’t be opening America to anyone if I say that its excellent feature (candle wax), which all connoisseurs and the manufacturer himself persistently insist on, manifests itself as intensely as possible when opening the bottle. I also found interesting the combination of this waxy aroma with the aroma of baked potatoes (reminiscent of potatoes in their jackets or baked in foil over a fire). As the bottle is emptied, these nuances fade and malty, honey and fruity notes (apple-plum compote, pickled yellow apples, richness of citrus, apricots, pears), floral lavender aroma, peppermint, vanilla, Citro soda and brown cane sugar caramel. The degree gives the taste a certain degree of viscosity, oiliness and richness. Here, as well as in the aroma, there is a strong waxy aftertaste, honeycomb, creamy vanilla cream, a little lavender “soap”, citrus zest, yellow fruit and burning powerful pepper. There is something to get excited about, endlessly marveling at the variety of nuances of taste and complexity in its development, but it is not entirely suitable for complete beginners; for a correct assessment, you obviously need to try examples of simpler bourbon whiskys (Glenmorangie 10, Deanston Virgin Oak for example) to prepare yourself . The aftertaste is long and quite dry. Wax, fruity notes, peppermint. Summary. In terms of its qualities, for me personally, this malt now represents one of the pinnacles of development of the predominantly bourbon profile (of course, I haven’t tried much yet, so please don’t blame me too much for lack of awareness, we are all developing to the best of our ability) . I think you should always have a bottle or two in your bar. The whisky is cool, fruity, warm like summer. For me, its competition for now is also whisky from Diageo Oban 14 YO. It's a bit similar in style, but at 43% it seems lighter on the palate, mineral and slightly smoky, a little broader in its palette. At different times I prefer one or the other. Well, today’s “cat” turned out to be very tasty, so I’ll probably try it again. Score: 85 out of 100.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "DoctorRockter",
            "user_rank": "Expert Junior",
            "rating": "86",
            "review_date": "15 oct 2014 3:03 am",
            "content": "Wonderful  example of Clynelish,  considering optimal price in front of the excellent quality of this bottle. there are so many flavors here, in the beggining dried fruits, almonds, walnuts, liquirice, following by a persistent wax and a rich honey , with a very  very light peat in the final. Not too  many sherry, not too many peat (like in other emblazoned bottles), only whisky from an always consistent distillery. \"simple\" whisky, but  in truth not very simple..",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "wbarchive_875995",
            "user_rank": "Expert Junior",
            "rating": null,
            "review_date": "12 dec 2019 7:02 pm",
            "content": "Fresh waxy pear pie with wet granite, wool, lemons in honey and lamp oil.RATING: 87pts - [n22,t21,f22,b22] → |86-89: Remarkable|",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Flerodex",
            "user_rank": "Expert Junior",
            "rating": "83",
            "review_date": "14 dec 2025 4:43 am",
            "content": "Fruity and sweet on the nose, a quality confirmed on the palate, it becomes slightly bitter on the finish, quite dry.I honestly preferred it with a little water added.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "snaotheus",
            "user_rank": "Expert Junior",
            "rating": "83",
            "review_date": "20 dec 2020 2:35 am",
            "content": "",
            "nose": "Bright, fruity, vanilla, apple pie.",
            "taste": "Apples, tons of vanilla, oak, hint of smoke, spicy",
            "finish": "Sharp and oaky"
        },
        {
            "user_name": "Modly",
            "user_rank": "Expert Junior",
            "rating": "86",
            "review_date": "11 may 2024 5:57 pm",
            "content": "Intriguing nose, but he falls apart on the palate and the fact that the finish remains for short minutes, I can’t give more than 86 points.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "EricLeeee",
            "user_rank": "Expert Junior",
            "rating": "85",
            "review_date": "22 aug 2022 12:21 am",
            "content": "Beautiful waxiness along with pear, one of the best waxiness appearance within such a price range.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Jabarkas",
            "user_rank": "Expert Junior",
            "rating": "85",
            "review_date": "03 jun 2020 8:19 pm",
            "content": "A great lightly peated whisky with some fruity notes.",
            "nose": "Fruit, light peat, salt.",
            "taste": "Grasses, a hint of peat, pineapple, vinegar. Juicy sweet.",
            "finish": "Again some sweetness. Bitterness. Pineapple and light peat."
        },
        {
            "user_name": "Ummixhead",
            "user_rank": "Expert Junior",
            "rating": "86",
            "review_date": "30 oct 2025 6:47 pm",
            "content": "This whisky is unlike anything else. It's uncomplicated and straightforward. It's perfectly balanced. It makes you feel like you're in a flower meadow, in an apiary, under a light spring breeze. 22, 21, 21, 22",
            "nose": "The aroma is very bright and fresh. Candied lollipops, marmalade, meadow herbs and flowers, and waxy notes.",
            "taste": "Dense, slightly spicy, continuing the waxy theme against a marshmallow backdrop. Creamy, even creamy-coffee notes.",
            "finish": "Herbal bitterness, creamy notes, marshmallow. Medium length."
        },
        {
            "user_name": "Taita",
            "user_rank": "Expert Junior",
            "rating": "81",
            "review_date": "12 apr 2014 8:28 pm",
            "content": "Although nose and taste are decent to me it is a little rough, not my favourite dram",
            "nose": "Sweet, honey, caramel, pencils, dried fruits, citrus, almond, pot pouri",
            "taste": "Oak, caramel, pencils, pepper, dried fruits, honey, almond,",
            "finish": "Middle long with some spices"
        },
        {
            "user_name": "Wal",
            "user_rank": "Expert Junior",
            "rating": "84",
            "review_date": "11 aug 2024 11:28 pm",
            "content": "aroma: sweet, honey, flowers, many citrus fruits, lemon syrup, pear, malt, baked apple, peach. The taste is mild, a lot of wax, a little peat, sea notes, black pepper finish: medium-long bitter oak, mild pepper, smoked apple , ash, salty, cocoa. Indeed, reminiscent of JW green. Not particularly difficult, but pleasant",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "whiskybros",
            "user_rank": "Expert Junior",
            "rating": "84",
            "review_date": "02 jul 2016 11:13 am",
            "content": "You can find our review at http://www.whiskybros.com/#!Clynelish-14yo/c21kp/571628900cf2b05e61f504d2",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Benjamin_Wang",
            "user_rank": "Expert Junior",
            "rating": "84",
            "review_date": "12 mar 2021 3:55 am",
            "content": "Sweet and deep complex. Intense on the palate.",
            "nose": "Good aroma, white grape, raisins, mild candy, white chocolate, pineapple can, and vanilla species, some mint leaves underling, a hint of smoke.",
            "taste": "Strong and intense, little smoke, then full bourbon sweetness and nuttiness, along with a lot of maltiness and vanilla. some white oakiness on the background,",
            "finish": "mid-long, oaky, and nuttiness with cool mint. Very dry after taste."
        },
        {
            "user_name": "Johannes de Silentio",
            "user_rank": "Expert Junior",
            "rating": "87",
            "review_date": "27 oct 2019 8:16 pm",
            "content": "Color: Pale GoldNose: It's fresh all over. There's fresh fruit, mint, and barley. Nothing is overpowering, though--well-balanced. In fact, I'd call it an impressively restrained-yet-characterful bottling for being core-of-range and mass-distributed. It's hard not to think of waxiness here, but I question how much of that is \"whisky taster branding,\" as \"waxiness\" is clearly the salient tasting note associated with all Clynelishes.Mouth: Fruit and honey. The sweetness is certainly there, but again, it's not overdone. The balance remains impressive. You can quaff this, but you're not guzzling something simplistic.Finish: The minty notes from the nose linger on the tongue. Not so much the fruit.Comments: A first-rate large-scale official bottling. Along with Talisker 10 yo and Lagavulin 16 yo, it's one of the crown jewels in the Diageo range. I don't find it particularly difficult or heady like some other reviewers do. I'd have no problem recommending this as a daily dram, potentially even for a novice. At the same time, I don't see any reason why it shouldn't be included in a connoisseur's collection as long as that person is aiming for a diversity of age and value. It's roughly on par for me with similar bottles like Ben Nevis 10 yo.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Soysauce_Sommelier",
            "user_rank": "Expert Junior",
            "rating": "84",
            "review_date": "20 feb 2025 2:40 am",
            "content": "It can be a good alternative when you can't make a highball with Johnnie Walker Blue. Overall, it has a notably oily texture.",
            "nose": "Light, green, nutty, fresh",
            "taste": "oily, grains, green, peppermint, weak",
            "finish": "short length, weak, nutty"
        },
        {
            "user_name": "67conrad67",
            "user_rank": "Expert Junior",
            "rating": "86",
            "review_date": "24 oct 2023 12:19 pm",
            "content": "Smell: fermented apple, fruit cake, sweet basic tone, malty hoppy, vanilla, nice balance, alcohol perfectly integrated, subtle note of machine oil Taste: fruity, including beautiful woody spice, apple, honey, bitter herbs, subtle saltiness, heather, long finish with a dtl. peppery bitter note... Color: straw color, medium Water's edge, sure Conclusion: I look in vain for the much-described waxiness in the batch tasted here - but that doesn't detract from the quality of the whisky in any way: Great stuff for the money, especially when you take into account Diageo's inflationary pricing policy at some of the other distilleries in the corporate empire...",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "NXI",
            "user_rank": "Member Senior",
            "rating": "86",
            "review_date": "19 feb 2021 2:49 am",
            "content": "The aroma of this malt is really complex for its price range, and the rest I would call acceptable. Overall a pretty good whisky.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Andi_Whisky&Vinyl",
            "user_rank": "Member Senior",
            "rating": "90",
            "review_date": "05 oct 2017 11:24 pm",
            "content": "I am very excited about Clynelish 14 and what this one offers. A little bit attracts opposites. On the one hand the whisky is very smooth and despite its 46% I would classify it as \"easydrinking\". On the other hand, it's so insanely complex that I might not call it a \"beginner's whisky\", even if that's often associated with easydrinking.  In short, he drinks lightly, but you have to devote yourself to him to enjoy all facets ... the fruits, the sweet and sour notes, the freshness, the black tea, the maritime salt, the earthy andundund.  The Clynelish 14 has such a beautiful character that it's hard to compare it to other whiskys.  A great surprise and just in view of the price an absolute recommendation.  My personal summer whisky 2017 .... 90 points  Complete Review: http://whiskyundvinyl.de/2017/08/13/clynelish-14-whisky-review",
            "nose": "The first nose is very smooth and yet complex. Something sweet, slightly maritime salt notes and candle wax are the first impressions. Then come intensive fruit and floral notes - pickled strawberries, banana, the \"usual\" heather ;-). Overall, the nose but also has a nice freshness that reminds something of peppermint and chamomile tea.",
            "taste": "Slight bitterness, earthy and still nice fruit flavors - banana and granny smith. A grassy freshness, ginger and light mint fit in wonderfully. Everything is rounded off by a very, very light earthy smoke note ... more earth than smoke.",
            "finish": "Less fruit, at most a little ginger. Reminiscent of black tea, slightly peppery, earthy and dry."
        }
    ]
}