{
    "info": {
        "ws_name": "Dalmore 12-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Dalmore",
        "ws_age": 12,
        "ws_abv": 40.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/3/6/685/171874-normal.png",
        "ws_rating": 80.8,
        "ws_vote_cnt": 1239,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/36685/dalmore-12-year-old"
    },
    "collected_count": 52,
    "reviews": [
        {
            "user_name": "Slàinte Mhath",
            "user_rank": "Super Administrator",
            "rating": "79",
            "review_date": "03 aug 2019 4:53 pm",
            "content": "Oh well. With only 40% ABV, heavy chill-filtration and added colorant, the presentation of Dalmore 12 could hardly be any worse. A shiny plastic stag alone does not make a good single malt! The nose, which is still the best part of the experience, features marzipan, Christmas spices and raisins with hints of fudge and citrus. Dark fruits, baked apple and zesty oranges dominate the palate, interrupted by tingly spiritiness. Notes of bitter tea, nutty dryness and eucalyptus remain of the short to medium finish. This Highlander could be so much better, if only...RATING: 3.0/5.0 stars ≙ 79 pts → AVERAGE",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "peatbogger",
            "user_rank": "Specialist",
            "rating": "75",
            "review_date": "16 nov 2018 11:48 pm",
            "content": "There's nothing wrong with it, it'sjust oh so boring.What can you expect from a €40 bottle? Definitely more than this.I've not bought a Dalmore for ages, but been tempted. Thanks to Slàinte Mhath for this sample, it will keep me at bay for some time.",
            "nose": "Not much going on.A slice of cinnamon cake and a couple of chocolate covered raisins.Faint wood.Smell like an over engineered blend, faint and distant.",
            "taste": "It's 40%, it's \"kill\" filtered and colored.What remains?I find the light nuttyness to be most appealing.Some fruit, but it's dry and bitter.One dimentional or what can be called flat.",
            "finish": "Short, and again dry and bitter."
        },
        {
            "user_name": "Dre73",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "03 apr 2016 12:38 am",
            "content": "Very friendly, soft and sweet whisky. Missing a little character, but is enough tasteful to entertain you.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Dre73",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "03 apr 2016 12:36 am",
            "content": "A very soft whisky, fruity and sweet, no sharp edges. Content is not as nice as the bottle suggests / hopes, but you can have fun with it.",
            "nose": "fruity, raisins, orange peels, nuts, coffee",
            "taste": "Raisins, (milk) chocolate, soft and sweet, slightly flat. Red fruit, (oak) wood",
            "finish": "Reasonably short, slightly dry, somewhat bitter. But also raisins, and little milk chocolate"
        },
        {
            "user_name": "holborndrinker",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "28 dec 2017 11:23 pm",
            "content": "Pleasant session whisky - smooth with a gentle heat afterwards.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "maltaholic",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "16 nov 2019 1:52 pm",
            "content": "Was not a big fan of Dalmore so far.  But I like them better from time to time.  Sweet Sherry, noble, ripe.  Balanced, round.  Very well.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Andytka3",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "27 dec 2016 3:09 am",
            "content": "Nose:- Whiff of leather with enticing sweetness of cooked fruits and maraschino cherry. Splash of water bring out the caramel and coffee bean fragrance.  Palate:- Poached pear, very stable on the palate. Well balance and structure. Finish:- Relatively short, but very balance and delicious, sweet maraschino cherry aftertaste. Hints of ash linger. — at The Whisky Bar, Kuala Lumpur.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "22 apr 2020 12:11 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2020/04/22/outside-the-box-from-armagnac-to-ardbeg/N,T,F: Apparently, this had arrived in the post a few hours earlier but it smells and tastes not like a neck-pour, but as if it’s been nicely opened up for a month. It also appears far older than a 12. I guessed 15-18. Is this the effect of being outside? There are some bits that don’t quite work perfectly. For example, there’s form throughout even if it’s somewhat short and stilted. If however, you’re after a sherry fix that isn’t a hit, with dusty citrus into chalkiness underlying, then this may be for you.C: The last time I tried contemporary Dalmore 12 was in 2013! We were surprised at how good this was.Provisionally scores 83 points – which means that both [W&M’s] Dalmore and Jura 12s currently beat Balblair’s 12yo [WLP] hands down. What a change.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "01 jul 2025 2:21 pm",
            "content": "2020 Rating",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "MaltVader",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "28 sep 2023 8:04 pm",
            "content": "",
            "nose": "Licorice, cane sugar, vanilla, marzipan, apples, butter cookies, nuts, a bit of orange and grass",
            "taste": "fruity, sweet, nuts, grass, caramel, creamy",
            "finish": "short - medium, chocolate, caramel, sweetness with a bit of bitterness"
        },
        {
            "user_name": "thijs100",
            "user_rank": "Connoisseur",
            "rating": "77",
            "review_date": "17 jul 2024 2:32 pm",
            "content": "I'm sure this would improve greatly at a higher strength.",
            "nose": "An inviting, zesty start with touches of orange peel, but there are also hints of chestnut, just a whiff of cinnamon and some elderflower liqueur as well. The oak is somewhat present too. There's ginger, some crème caramel and allspice.",
            "taste": "Hints of candied oranges, creamy caramel and some resin, as well as a few drops of triple sec and cinnamon buns. Finally burnt toast, a tinge of chocolate and a gentle bitterness. It all sounds nice enough, and it is mostly enjoyable, but also somewhat weak and thin at times.",
            "finish": "Short. Strong breakfast tea, as well as coffee beans and a soft leafiness."
        },
        {
            "user_name": "LiquidThoughts",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "09 apr 2017 1:56 am",
            "content": "For 12 years really not bad, but I hate these side notes.",
            "nose": "Cocoa, lemon in between and a few spices, chocolate and pepper",
            "taste": "First citrusy, which came as a surprise, with a nice mixture of orange and lemon, then more sherry, a bit spicy and then this lax dusty note that I often have with young OAs, cinnamon",
            "finish": "In short, Oloroso stays with wood, some coffee bean and orange"
        },
        {
            "user_name": "Malthead19",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "06 jan 2021 4:27 pm",
            "content": "- a good highland single malt - could be a lot better if he had more percentages and power - at around 40 € for a standard 12 with 40%, cool-filtered and colored not cheap but definitely recommended - but compared to the 15 year old, the surcharge for the 15 year old is worth it => significantly better whisky!",
            "nose": "dry sherry, oak both nicely balanced, clear citrus fruits",
            "taste": "classic mild and soft, oak u. dry sherry flavor,",
            "finish": "Medium-long, soft finish, nice aromatic fruity finish, grape finish"
        },
        {
            "user_name": "Segens",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "02 nov 2015 7:04 pm",
            "content": "The dram is OK and for its money its good. But that is also all :-)",
            "nose": "fresh fruity but also a bit metallic",
            "taste": "fruity (peaches) but also a bit of oak now.",
            "finish": "nothing special. A bit of oak a bit of fruits. Not very long"
        },
        {
            "user_name": "schengel10",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "10 mar 2019 6:04 pm",
            "content": "Dalmore's bestseller - a very neat malt - a good beginner, perfect for beginners!",
            "nose": "sweet sherry, oranges, some spiciness / oak, vanilla;",
            "taste": "pleasant fruity start (oranges, jam), sherry, dark chocolate, spicy oak on the palate; Toasted flavors (coffee);",
            "finish": "medium length, fruity finish; Sherry and spice ring out;"
        },
        {
            "user_name": "Marko_I",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "05 apr 2018 9:11 pm",
            "content": "After 6 years in the glass again, and I find him surprisingly good, tasty, easy drinking, not a jack of all trades, but despite 40% pretty substantial, no thin porridge, has gotten good barrel. Solid ~ 40 € he earned, I would advise against any beginners.",
            "nose": "In principle, I could parrot the official notes: \"Citrus fruits, chocolate and aromatic spices\" is just fine.  Ok, at first cocoa powder, goes from drinking (sweet) direction baking cocoa (bitter), then spicy-woody, where I do not come to the spice, carnation is close, but does not quite fit ... bissl pipe tobacco, which is lemon rather a homoeopathic association - there you could imagine a splash here and there.  Later I have a sweaty note, but not disgusting, rather sweetish, freshly air-dried summer-work-sweat.",
            "taste": "first drops: rosinig-vinous-woody  Yep, a lot of chocolate, a drop of sweet red wine, quite dry in the mouth, the longer, the bitter (cocoa), woody, slightly peppery, despite only 40% surprisingly full-bodied",
            "finish": "medium long, cocoa, gently peppery-warm"
        },
        {
            "user_name": "tribe",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "06 jun 2021 10:51 pm",
            "content": "Was woody and like cherries, a little bit tart",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Boletus",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "13 dec 2022 7:09 pm",
            "content": "Here the 12-year-old ''Dalmore'' experienced a nice improvement over the previous version. He's nicely complex, if a little too narrow-chested to really impress. It's nice to drink though and definitely worth trying. Bottled now without coloring and with more percentages, this could be a real hammer whisky.",
            "nose": "Blood oranges, dates, black cherries, caramel in any case, a bit of malt, tobacco, a hint of coconut, but the dark notes are more in the background, a vanilla backbone, nubuck leather, unripe vineyard peaches, cardamom builds up over time",
            "taste": "Juicy dates hit the palate, Demerara fights caramel for supremacy, decent malt, roasted almonds, blood orange with spices, cinnamon, milk coffee, dark milk chocolate",
            "finish": "Medium length, demerara, freshly roasted coffee beans, cinnamon, nutmeg, kumquats, coriander seed, the oak has a rather minor contribution, dark chocolate, vanilla and peaches remain"
        },
        {
            "user_name": "DramALife",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "31 dec 2022 8:54 pm",
            "content": "S 7 The nose was a bit too focused on the sweet side, but the body almost perfectly resembled what I usually expected from a good sherried whisky. 81-85 - Another dram welcomed",
            "nose": "Slightly oily malt. Sweet porridge. Marshmallow. Caramel. Nougat / milk candy (白兔糖). Vanilla cream. A whiff of buttery oak and a spicy, peppery note. A whiff of new leather.",
            "taste": "Sweet, fruity & spicy. Clearly sherried. Juicy fruits (red apples, peaches, apricots). Spices such as crushed peppercorns, nutmegs and cloves dancing on the palate, adding weight to the otherwise watery body. Toasted oak. Dry cereal. A touch citrusy.",
            "finish": "Mid finish. Stewed fruits, a pinch of pepper, and slightly drying oak lingering."
        },
        {
            "user_name": "DramALife",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "16 apr 2022 2:44 pm",
            "content": "More spicy than sweet. White oak influences are heavier than sherry. At 40%, it's too thin to drive out any other impressions.In my pre-historical scoring method, it's an 8.8/10.",
            "nose": "Honey. Vanilla ice-cream. Sherry upfront that's a touch oily.",
            "taste": "Sweet and fudgy. Spices uprising here and also a bit herbaceous.",
            "finish": "Short, dry finish. Oaky. Rich & mouthwatering."
        },
        {
            "user_name": "Moses",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "09 sep 2018 9:20 pm",
            "content": "Special case. I had already finished writing this note and then deleted it again. The rating was consistently too bad for me. Why? Since this whisky was my first at the time. I liked the design of the bottle so much that I bought it as the very first whisky. I'm not so sure anymore how good or bad it was for me back then, but I don't want to tarnish this great experience on \"DIE ERSTE BOTTLE\" with a bad tasting now. That's why I gave an average of 80 points. Now I'm being completely honest: I wouldn't buy this whisky anymore. But I should keep it in good memory. A matter of honor!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "drkrylov",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "21 sep 2014 11:23 am",
            "content": "",
            "nose": "Beautiful balance of tempting aromas. Gently fragrant peat-smoke. Orange marmalade, malt and sherry.",
            "taste": "Orange. Cream. Distinct aniseed. Honey. A very complex malt, with wonderfully combined flavours.",
            "finish": "Almost chewy. Faint citrus zest. Smoky dryness. The faintest hint of the sea."
        },
        {
            "user_name": "brechtvds",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "27 may 2016 12:20 pm",
            "content": "thick lovely body cacao, dark chocolate ,white pepper a bitter after taste also a little spiccy 85/100 you can watch my video review on youtube https://www.youtube.com/watch?v=q_AbaniVsuM",
            "nose": "orange , dark chocolate ,cinnamon spice , white grapes (like white wine) vanille , caramel ,oily, red fruity , sherry, apple ,plums",
            "taste": "oily mouth coating verry warm an sweet sherry , dark chocolate , but also cacao , cinnamon",
            "finish": "dry finish ,cacao,dark chocolate"
        },
        {
            "user_name": "2ndSip",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "10 jan 2020 5:48 pm",
            "content": "I am pleasantly surprised at how varied the malt is. If you prefer a sweet whisky that should not be as strong, this is the place for you.",
            "nose": "light sweetness of brown sugar, caramel & nougat, milk chocolate. Behind it some vanilla, honey and a sherry aroma (red dried fruit) and seasoning. The fruit note clearly goes in the direction of (sweet) orange. A strong nut aroma (hazelnut and almonds) is added later.  --- with 'The Nose' glass: violent alcohol bite and significantly more sweetness and spices from the Christmas market. Behind it comes a certain herbal note that I didn't have in a Glencairn glass.",
            "taste": "soft to start with, quite sweet. A light (oak) spice leads to a creamy, oily mouthfeel. A slight tart note towards dark chocolate, but still very harmonious. On the second sip, the sherry aromas and the nuttiness come through again. Overall, very soft and pleasing.",
            "finish": "relatively short to medium-long finish. Light oak note with a bit of spice as well as the very slight (coffee-bitter) bitterness (which should not deter anyone who does not like bitterness because it is very weak); the nut aroma persists a little longer."
        },
        {
            "user_name": "Goethe",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "17 sep 2016 8:52 pm",
            "content": "Dalmore used to be sweeter. This is some kind of dry and bitter expression of older 12 year old versions.Concerning price/performance ratio: 7/10 (2016)",
            "nose": "Honey, vanilla, rasins, some sherry.",
            "taste": "Oloroso sherry, dried fruits, oak, dry, bitter.",
            "finish": "Medium. Some hints of fruit, dry oloroso sherry and some bitter notes."
        },
        {
            "user_name": "Martin1965",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "25 mar 2019 7:29 pm",
            "content": "",
            "nose": "Citrus, sherry, spices, vanilla in the background, rum raisins",
            "taste": "Spices, oak, beautifully wrapped sherry, sweet to jam",
            "finish": "Toasted aromas and cocoa notes  Beautifully complex for 12 years, excellent aroma, could have more steam."
        },
        {
            "user_name": "DrunkDude",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "12 sep 2020 5:09 am",
            "content": "",
            "nose": "Apple, hints of grassy malty, strawberry, fruity candle aroma, refreshing vanilla. 87",
            "taste": "Malty liquorice with spices. Fresh lemon sour, citrus peel, more like lime peel, woody texture, cinnamon",
            "finish": "Chocolate, burnt wood, grassy, tannin texture, citrus bitterness."
        },
        {
            "user_name": "Whisky Hamster",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "10 mar 2021 6:42 pm",
            "content": "Another one of those streamlined 12 yo, colored, chillfitlered @40% abv. the dinstinguished maltster does not need. There are cheaper, less pretentious entry malts out there.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "mihatozzz",
            "user_rank": "Expert Senior",
            "rating": "77",
            "review_date": "11 jan 2023 8:44 am",
            "content": "Mediocre, very expensive for its level of whisky. Weak in aroma and taste.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "ZLako",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "24 sep 2023 11:31 pm",
            "content": "Weak and artifically sweet.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Wtrstrnghlt",
            "user_rank": "Expert Senior",
            "rating": "79",
            "review_date": "12 aug 2015 10:32 am",
            "content": "Nose: Sherry, Warm Fruit, Raisins. Warming nose feel. Vanilla. A cheesy noteTaste: Light and sweetFinish: Raisins. Light spices.Tasted during Dramming.com NAS vs AS blind tasting experiment, next to Dalmore Valour",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Kaleva",
            "user_rank": "Expert Senior",
            "rating": null,
            "review_date": "29 jan 2019 10:16 am",
            "content": "Nice all-rounder. Not very complex but balanced and easy-drinking. Good for every occasion.",
            "nose": "Floral, sherry, red apple, dried fruits, vanilla, light background smoke",
            "taste": "Sweet, spicy, caramel, sherry, orange zest",
            "finish": "Medium-long, spicy, sweet"
        },
        {
            "user_name": "Ostfriese",
            "user_rank": "Expert Senior",
            "rating": "79",
            "review_date": "23 mar 2016 7:57 pm",
            "content": "A complex malt in which oak notes and spices stand in the foreground. The proportion of Oloroso Sherry Casks should be slightly larger in my opinion, but the roasted aromas of American White Oak barrels are very present.",
            "nose": "Oak, plums, tobacco, notes of chocolate and cinnamon",
            "taste": "In the foreground, oak and spices, light sweetness, coffee notes and roasted aromas",
            "finish": "Oak notes again, slightly malty, cocoa notes"
        },
        {
            "user_name": "erwinnlim",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "31 mar 2020 12:34 am",
            "content": "Overall a very decent whisky. However, nowhere near as sherried as the colour (thanks to E150) may suggest. Personally, I find it overpriced for the quality. Value (£40) : 5/10",
            "nose": "Vanilla and caramels with the dark raisin and plum notes. There is also a slight musty note. Classic Dalmore chocolate oranges as well.",
            "taste": "Honeyed sweetness and dark raisin notes. Balanced off by some bitter tannins and oak spice. More of that chocolate orange note.",
            "finish": "Short finish, like the palate but less sweet and more spicy."
        },
        {
            "user_name": "SimonOHA",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "27 dec 2023 5:28 pm",
            "content": "Very decent Sherry, but quite generic and therefore without much interest",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "kringo86",
            "user_rank": "Expert Senior",
            "rating": "72",
            "review_date": "20 sep 2024 10:45 pm",
            "content": "Nice nose on dark fruits and spice but actually very Flat and boring...",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "littlebuzzed",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "21 feb 2022 4:23 pm",
            "content": "Honestly, I don’t understand why people have the hate for Dalmore. The nose is gorgeous, orange, honeysuckle, espresso, slight smoke. On the palate it has a viscous ice cream texture and the finish sticks around for a while with wood spice leading to way. Yes, it’s chill filtered, yes they add color, yes, they bottle at 40%vol….and for all these reasons I don’t think I would have ever bought a bottle. However, this one was gifted to me at a Christmas Party we had at our house in early December.We almost finished the bottle that night, but luckily there was 3 or 4 drams left to sample afterwards.For me it was just a reminder that we should not just take some influencers opinion and make it our own.This was a great bottle and I will definitely buy another one.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "rb854",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "04 sep 2017 2:31 pm",
            "content": "It starts musty, but it becomes fresher in time. A lot of citric/oranges in nose and taste. I was positively surprised.83/84pt.",
            "nose": "Sweet honey with a musty note, wood, leather, spices, nutmeg, but also some fruits, peach, oranges, grapefruit. The musty note disappears after a while and the peach becomes somewhat more present. There is a lot of oranges present, some tobacco, chocolate and pepper.",
            "taste": "Smooth and mild, a little pepper, vanilla, again the oranges, chocolate and some gin-like notes, juniper and coriander.",
            "finish": "Citric fruits, oranges, lemons. There is some nutmeg, tobacco and chocolate. It has a reasonable length, especially the bitterness of a cup of strong coffe keeps lingering."
        },
        {
            "user_name": "Mr. D.",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "10 nov 2021 8:37 pm",
            "content": "Pleasant single malt with a pronounced sherry flavor, but sorely lacking in strength; all the delights of Dalmore washed away with water, I would hardly recognize the distillery in a blind tasting.",
            "nose": "Calm, warm; citrus and honey tones first; opens with raisins, red sweet apple, chocolate chips; in the background oak, coffee, spices.",
            "taste": "Pronounced sherry; dark fruits (cherries, peaches, plums); notes of roasted hazelnuts and coffee with chocolate are clearly perceptible; some oak, old leather and spices.",
            "finish": "Fairly short, slightly dry, slightly spicy; a little raisins, a little chocolate; at the end, oak bitterness remains."
        },
        {
            "user_name": "Peatyjohn",
            "user_rank": "Expert Senior",
            "rating": "78",
            "review_date": "30 sep 2025 6:57 pm",
            "content": "Watery, blueberries, raspberry, tannin's, spice.A reasonable sherry cask rendition but your socks not much to recommend.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "KyleRiemen",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "15 jun 2024 9:28 pm",
            "content": "Really bitter, it could have been a good whisky, but it was far too diluted and far too expensive.",
            "nose": "Vanilla, rum, clove, orange",
            "taste": "Watery, yet creamy, sweet, rum again, which is a bit too sticky, but still within limits, a little milky coffee, a hint of sherry.",
            "finish": "Finish like the taste with some nuttiness, short to medium length, pleasant but boring."
        },
        {
            "user_name": "Mark24",
            "user_rank": "Expert Senior",
            "rating": "78",
            "review_date": "02 sep 2017 6:25 pm",
            "content": "Do not find the smell of this Dalmore 12 yo. I smell some sherry and some caster sugar / dark chocolate (?). Is also a bit of a bitter leather smell, probably I think `m not so great.  Pleasant coffee / mocha flavor, little sweet with some sherrytones, actually miss a little more depth. First aftertaste I find some punishment but he remains medium long with the aforementioned taste profile.  Fine whisky but finds the price of € 40.00 a bit on the high side.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "AdelphosHume",
            "user_rank": "Expert Senior",
            "rating": "79",
            "review_date": "03 feb 2018 4:03 pm",
            "content": "It was okay, but not something I'd seek out again. Adding water is not necessary or advised.",
            "nose": "Sweet sherry and stale-tea, hot cocoa powder, baked apples and fruit compote, soft sugared baking spices, and a touch of honeyed citrus.",
            "taste": "Pepper and pancake syrup, dried fruits, and cinnamon sugar.",
            "finish": "Citrus fruit and rind and a bit of dark chocolate."
        },
        {
            "user_name": "Mugis",
            "user_rank": "Expert Senior",
            "rating": "76",
            "review_date": "14 sep 2024 7:41 pm",
            "content": "N: Fruits, citrus peel, sherry, Christmas T: thin, fruity, orange gummy bears with a little fantasy vanilla F: light, fruity, delicate",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Gearmailteach",
            "user_rank": "Expert Senior",
            "rating": "79",
            "review_date": "25 oct 2015 8:41 pm",
            "content": "A decent aperitif or dessert whisky. Overall, but unfortunately a little paler and arbitrary, as the older representatives of the range and similar ripened competing products. Not a must-have.",
            "nose": "Beautiful color - I would say, if Dalmore did not impress so excessively strong. Too bad.  To the nose: Dark fruit and Sherrytoene paired with an alcoholic fruit character as Grappa or Obstler - somewhat weaker in the Ausmung. Pear, apple, grapes in custard with milk chocolate chips. Some malt and oak, into the caramel.  Overall not intrusive, everything rather subtle.",
            "taste": "Again, grapes, fresh pear, apple, orange peel and dark fruit in the interplay with vanilla, caramel, nuts and this time also (blossom) honey.  Behind it a gentle caramel-espresso note, which over time becomes spicy oak authenticity.",
            "finish": "Short to medium. Grapes, orange peel, caramel and some espresso."
        },
        {
            "user_name": "InbhirNis",
            "user_rank": "Expert Senior",
            "rating": "75",
            "review_date": "01 mar 2020 1:58 pm",
            "content": "[from a bottle drunk in 2014] Weak, thin and rather one-dimensional on oranges - really not my bag.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "BarrelBeast",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "19 sep 2022 5:14 pm",
            "content": "Youtube Review: https://youtu.be/HOXo3egWCSA",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "wbarchive_149037",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "24 dec 2015 6:51 pm",
            "content": "Quite good, but not my favourite entry-level Sherry.",
            "nose": "Malt and oranges. The whole is dry, a bit winey. The sherry dominates the whole and the bourbon cask hasn't really something to say here.",
            "taste": "Malty, on fruits, more oranges. Dry and a bit salty too, which is surprising. Usually I find 40% too low but I admit that it is not disturbing in this case.",
            "finish": "Medium and fruity, and again a bit salty (Or maybe it's me?)"
        },
        {
            "user_name": "Dramrunner",
            "user_rank": "Expert Senior",
            "rating": "90",
            "review_date": "27 dec 2024 1:52 pm",
            "content": "Very pleasant in smell and appearance but loses a little sting in the taste",
            "nose": "Sweet - toffee, oily, healthy",
            "taste": "Fruit - banana, cereal, toffee/chocolate",
            "finish": "Relatively short"
        },
        {
            "user_name": "kramimatsimoto",
            "user_rank": "Expert Senior",
            "rating": "75",
            "review_date": "17 feb 2022 3:39 am",
            "content": "Pretty sobering to be honest. N - initial woody aromas with orange and a hint of lemon. Subtle sherry aromas. Flies through the nose. Slightly musty! M - Fun start that becomes stronger and is accompanied by spicy wood aromas. This represents the strength of the whisky in a decent finish. Renowned distillery, you can expect more from a 12er.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "alkisd8",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "02 dec 2020 2:09 am",
            "content": "",
            "nose": "Some orange and sherry notes",
            "taste": "Dark chocolate,mint, coffee hints with old oak,some fruit ,as the times go the chocolate overwhelm.The mint and sherry note is there.",
            "finish": "Medium with the dark chocolate and mint lasts.. Pleasant and delicious"
        },
        {
            "user_name": "CellarToberi",
            "user_rank": "Expert Senior",
            "rating": "89",
            "review_date": "09 nov 2024 8:33 pm",
            "content": "Chocolate and orange cereals with salted bakery goods. Matured in American white oak ex-bourbon casks, and then finished in 50% American white oak ex-bourbon casks and 50% Oloroso ex-sherry casks. Chill-filtered. Coloured. Thick fast primary legs. Slowly forming secondary legs.",
            "nose": "Sweet: honey, white chocolate, caramel, vanilla, toffee. Fruity: citrus: orange, tangerine, orange jam; dried fruit: raisin, fig, prune; berries: blueberry; stone fruit: cherry. Feints: wax, leather, tobacco note. Floral: fragrant. Spicy: mint, cinnamon, dark chocolate. Woody: American oak. Nutty: hazelnut. Cereal: malt, hey. Herbal: green leaves. Oily: cream, butter note. Winey: sherry. Full body: complex, elegant. Water pushes up feints notes and pushes down cereal notes.",
            "taste": "Sweet: honey, toffee, chocolate. Fruity: citrus: tangerine, orange; berries; tropical fruit: banana, mango, pineapple; dried fruit: raisin, prune; stone fruit: cherry; fresh fruit: apple. Spicy: cinnamon, dark chocolate, ginger, liquorice note, salt. Cereal: malt, bread, hay. Oily: cream. Feints: fermented tobacco, cigar. Smoky: hint of smoked cigar, smoked prosciutto note. Full body: elegant. Water pushes up sweet and fruity notes.",
            "finish": "Medium. Sweet: honey, toffee, chocolate. Fruity: dried fruit: raisin, fig, prune; tropical fruit: banana, mango; citrus: orange; stone fruit: cherry; berries. Spicy: cinnamon, salt, cocoa, Christmas cake, pepper note. Feints: leather, wax. Oily: cream. Herbal: bitter herbs note. Nutty: cola. Full body: elegant. Water pushes up fruity notes."
        }
    ]
}