{
    "info": {
        "ws_name": "Old Pulteney 12-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Old Pulteney",
        "ws_age": 12,
        "ws_abv": 40.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/3/5/356/251191-normal.png",
        "ws_rating": 80.82,
        "ws_vote_cnt": 1010,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/35356/old-pulteney-12-year-old"
    },
    "collected_count": 56,
    "reviews": [
        {
            "user_name": "dram-drinker",
            "user_rank": "Photo Moderator",
            "rating": "88",
            "review_date": "20 apr 2016 9:57 pm",
            "content": "Not sure why it got rather low rating because for me this is a clear winner - in particular if you look at the very reasonable price. It's a clear buy!",
            "nose": "Salty, mineral, tropical fruits, bananas, pineapples, apricots",
            "taste": "Very oily and liquorice, nice fruitiness from apricots, good sweetness, little salty",
            "finish": "Medium long and still fruity"
        },
        {
            "user_name": "dram-drinker",
            "user_rank": "Photo Moderator",
            "rating": "88",
            "review_date": "25 nov 2015 11:19 pm",
            "content": "Salty, maritime notes as expected. Very drinkable and pleasant.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Slàinte Mhath",
            "user_rank": "Super Administrator",
            "rating": "85",
            "review_date": "03 aug 2019 3:08 pm",
            "content": "As coastal malt from the Northern Highlands, Old Pulteney 12 is unlike many other whiskies: it's not made to be 'pleasant'. What you get is a demanding flavor profile, strength of character and a real personality. On the nose, there is a complex bouquet of bitter honey, tropical fruits, fresh ginger and hints of sea salt. The taste alternates between caramel sweetness, orange zest and savory notes before the oak kicks in and leads to a moderate, herbal crisp and rather dry finish. A rewarding single malt that requires time, patience and some experience!RATING: 3.7/5.0 stars ≙ 85 pts → ABOVE AVERAGE [+]",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "peatbogger",
            "user_rank": "Specialist",
            "rating": "85",
            "review_date": "26 may 2019 2:51 pm",
            "content": "The first \"basic\" dram in a distillery tasting of the new core range.The 12 is how I got to know Pulteney and in my opinion where you find most of the distillery profile shining through.It's a very good entry level malt, and with the recent price hike it's also where you get the most value for your hard earned cash.",
            "nose": "Happy to find the \"rewamped\" packaging containing an almost unchanged liquid.Fresh tropical fruits, sweet and citric with a pinch of salt.",
            "taste": "No change in the recipe, this is as good as I remember the old bottling.Vanilla fruity sweetness with a spray of citrus zest.A hint of seasalt, guess that's why they call it maritime.",
            "finish": "Medium lenght, softly drying with a nutty note."
        },
        {
            "user_name": "peatbogger",
            "user_rank": "Specialist",
            "rating": "85",
            "review_date": "03 may 2016 8:57 pm",
            "content": "my first Pulteney, surprised in a very positive way, a bit too sweet but lots of unusual and nice flavours, reminds me of a smooth calvados, definitely something I will explore further",
            "nose": "right after pouring and not putting my nose to deep in there were notes of a sweet mild cigar, a bit salty, very pleasant sweet fruit dominated by apricot and peach, honey notes, saturated oak",
            "taste": "full on deliciouse apricot juice, red apples and some banana, turns to liquerice (sweet and salty like the soft Panda) a little spicy warmth",
            "finish": "a little salty, very nice ballance between sweet and sour dryness"
        },
        {
            "user_name": "Archer",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "31 aug 2015 7:35 pm",
            "content": "A good to very good standard whisky with very good value for money.",
            "nose": "The nose is floral and light at first contact. Nussive notes are already playing in the background, becoming more dominant after increasing veiling. Some lemon is to be found.",
            "taste": "Full citrus flavor characterizes the first impression on the palate. Fresh and fruity, it glides over the tongue. In addition, the taste of fresh salty bread dough. Over time, oak flavors are found. Drying. The nose aroma from the nose returns and remains until the end.",
            "finish": "Medium. He leaves a hint of salty sea aroma."
        },
        {
            "user_name": "Andytka3",
            "user_rank": "Connoisseur",
            "rating": "77",
            "review_date": "28 dec 2016 3:28 am",
            "content": "Nose:- Crisp and clean. Soft fragrant of dusting powder first with pineapple note. Mineral and coaster. Quite hidden, or may be I had been trying one too many today. Palate:- Astringent with notes of mineral salt, coaster.    Light body. Finish:- Medium and spicy finish with vanilla appear from nowhere. — at The Whisky Bar, Kuala Lumpur.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Kantenmechaniker",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "20 aug 2023 10:28 pm",
            "content": "Decent standard, I like it.",
            "nose": "Grassy and lightly fruity, honey, fresh, mint, sweet, very pleasing, almonds, light marzipan, a touch of oak, the marzipan is becoming more and more intense, galia melon, peach, everything sweet",
            "taste": "Sweet, lovely, honey, slightly floral, thus also tart, peach, tangerine, creamy, oak, you notice the low alcohol level in the mouth, but the intensity is still appropriate",
            "finish": "Nice interplay between sweetness and tartness, pleasant, fruity, slightly minty, tasty, also a bit salty on the palate"
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "25 dec 2019 2:53 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2019/12/25/blind-challenge-christmas-2019/Colour: GoldN: Not dissimilar to #2 [B], but more mature with firm honey notes and syrup-ed ripe tinned fruits.N take 2: On my 2nd sweep I pick out more layers and a thicker coating of fruits with a [dusty] creaminess and floral essential oiliness. There’s a hint of emulsion or perhaps metal paint lightly brushed over those honeyed creamy fruits with only the lightest sprinkling of sawdust. I’d say the abv maybe slightly higher than the previous two but there’s not a great deal in it.T: Very pleasing and congenial arrival and subsequent chewy development. Raisin-y and malty though also oaky, so fairly balanced throughout.F: Still fruity > citrusy with a slight raisin-y-oaky heat into the finish. Fairly long blended oaky > barley-putty dry finish, eventually with a bread crumb conclusion.C: Now I’m committed to the Irish route, I’m guessing Bushmills 12 for now. Provisionally scores 83 points.ROUND 2I piece together a summary of my guess-work:Now I’m committed to the Irish route I’m guessing Bushmills 12yo but I could have easily gone off-piste. [83]ROUND 3So I’m fairly certain this is the 12yo. Could this be a Balvenie 12 Doublewood with those light-yet-focused barley & citrus oils with an underlying putty base? Maybe it’s a Bruichladdich, though I’m more inclined towards Speyside than Islay. It’s not as fluffy on the palate as I’d expect from Balvenie though the barley putty-porridge and savoury-sweet citrus notes ring true. It’s far less Irish now I’ve already picked out the Bushmills. The finish is short yet true and humming with herbal toffee.REVEALED: I haven’t had Old Pulteney for a few years [WLP80]. Years before those years, the 12yo used to be salty, very salty but the profile has certainly changed since the 12yo & 17yo exploded onto the market in 2011/12. I was correct on age but distillery, nah. I’m told the bottle however is very tired [any excuse].Final score: 83 points",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "09 apr 2018 1:41 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2018/04/05/on-location-pulteney/With 100% bourbon maturation, this is Pulteney’s biggest seller. I had a bottle back in 2013 and liked it, though not nearly as much as the 17yo.N: Somewhat dunnage-y though with a very understated bourbon cask influence overall. Some brine/oil, a brown paper bag and a complex sweaty saltiness.T: Sharp clean oily bourbon. A little water brings an almost fruity oily bourbon husky Fimo setup, some light vanilla sponge and very light fruits. Chew for a salty light sweet, milk chocolate spirity oily mouthful.F: Long new make-like finish on coppery raisin-y cereal.C: This is well made whisky with the distillate at its heart, due in part to the rather soft cask [refill] influence – perfect for longer maturation hence why the 17 & 21yo are a step up IMHO.Scores a C-",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "dRambo",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "21 apr 2017 12:44 am",
            "content": "For a young malt a very good quality, despite the 40% spicy without being sprightly, the 12er reminds me very much of West Coast Malts with its waxy notes and saltiness.",
            "nose": "Oak with a slightly restrained sweetness and increasingly strong acidity, oak, sawdust, some malt, candle wax, oranges and apricots",
            "taste": "oily smooth but rather thin, toffee with nuts, well integrated alcohol, immediately oak prickles on the tongue, resinous sawdust is on the tongue and exudes a little mint, spice and vanilla fill the mouth, a subtle hint of salt comes on, now also subtle fruits come In addition, apricots and delicate orange tones meet salty bitter almond",
            "finish": "medium in length, slightly bitter, nutty, warming with strong spiciness on the tongue"
        },
        {
            "user_name": "Georges",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "15 aug 2014 10:05 pm",
            "content": "",
            "nose": "Maritime, some peat, fruity (apple, apricot, banana) and floral notes",
            "taste": "Clean, fresh, tropical fruit, floral, some honey and vanilla",
            "finish": "Short, herbal, fresh"
        },
        {
            "user_name": "karloff",
            "user_rank": "Specialist",
            "rating": "86",
            "review_date": "23 may 2016 11:54 pm",
            "content": "This was a gift off a friend, and it was a pleasure to revisit this classic malt.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "karloff",
            "user_rank": "Specialist",
            "rating": "86",
            "review_date": "23 may 2016 11:51 pm",
            "content": "It has been a good few years since I have had this whisky, and the high standard is still there.",
            "nose": "Lemon, Buttercup, cardboard box, some wet grass and honey, give it a twirl and there are some green leaves and white chocolate.",
            "taste": "Very smooth, floral and grassy. It goes down well, very pleasant, you can taste the saltiness as I did with the last bottle I had, there is also some lemon citrus in there.",
            "finish": "A very nice medium lemon finish with a pinch of salt on the death."
        },
        {
            "user_name": "Malthead19",
            "user_rank": "Connoisseur",
            "rating": "73",
            "review_date": "10 oct 2022 10:41 am",
            "content": "COLOR: gold, honey (without dye) - good solid \"slightly weaker\" 12 J. standard bottling - more intense and felt stronger than a Cardhu 12 J. - not as aromatic and soft as Glenlivet 12 J. or a dem Knockando 12 J. - solid pub whisky or good all day dram - for about 35€ you can definitely do it, but no special buying tip Tip, I don't have to have it",
            "nose": "Honey, malt, sweetish, pleasantly soft",
            "taste": "malty, pleasantly soft attack, becoming dry, nice fruity note, pear,",
            "finish": "short, slightly burning finish ; short alcoholic aftertaste"
        },
        {
            "user_name": "HammerHead",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "07 mar 2015 6:22 pm",
            "content": "Nose: fresh and salty sea breeze, vailla, green apple and lemon.Taste: white fruits, like pear and galia melon, some faint honey note.Medium finish with honey, saltyness and a grapefruit like bitterness.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Calmar",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "26 may 2017 3:21 pm",
            "content": "The surprisingly attractive mole, open, simple, perfectly balanced, with a minimum strength is quite rich and invigorating. One of the best basic whisky, and considering the price / quality ratio - the first candidate for permanent residence in your bar and the ideal option for beginners.",
            "nose": "Bright, fresh, open, flower-lemon, brackish-marine, lemonade, vanilla.",
            "taste": "Oak-mineral, fresh, spices - pepper, ginger, cardamom, fruit compote.",
            "finish": "Crusts of mandarins, bitter young bark, light sweetness, cinnamon, ginger."
        },
        {
            "user_name": "Stanzeflasche",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "13 dec 2018 11:13 pm",
            "content": "They say it's a maritime malt. Indeed we smell iodine, foam, tide, salt, kelp and even sand. Very light peat and white grapes. Lemon peel. Beautiful scale. The latter lingers in the mouth, it is quite velvety, oily, gently peppery, woody, caramel. Some exotic fruits, banana, pineapple. The lemon persists in the finish, it is warm, sparkling, not too short, a little dry, malty, salty. Dry and sandy land. This saline profile, and at the same time quite subtle, makes an impression. https://ilikesky2020.blogspot.com/2020/05/old-pulteney-12-yo.html",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Marko_I",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "30 may 2017 10:39 pm",
            "content": "Solid, slightly more robust standard, despite 40% not soft washed, I like to drink and is well settled in the 30-euro region.",
            "nose": "for 40% quite strong, caramel, dry fruits, cereals, slightly woody-spicy, comes a bit gruffy / dirty over, could be a hint of smoke, but maritime I do not find him",
            "taste": "40% good performance, caramel, nougat, wood, grain, sawdust, starts soft and oily and is always dry in the mouth, then it comes to a slight bitterness",
            "finish": "medium, first oily with nougat, then pepper and salt"
        },
        {
            "user_name": "ffmdino",
            "user_rank": "Connoisseur",
            "rating": "25",
            "review_date": "08 dec 2016 10:28 pm",
            "content": "nothing that excites me",
            "nose": "strong nut, slightly vanilla, pear, hair spray",
            "taste": "soft, nutty, waffles, fruit, coconut",
            "finish": "short with oak"
        },
        {
            "user_name": "Boletus",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "27 dec 2022 9:14 am",
            "content": "Pleasing, tasty and good! Absolutely no disturbing aromas. Only the slightly too ordinary finish is a small drop of bitterness. Bottled stronger, this could be a breakthrough whisky.",
            "nose": "Sweet and juicy oranges, light vanilla, a little ginger, the sea breeze constantly resonates, refreshingly tingling, a little lime, caramel notes, cereals, lemon cake",
            "taste": "Orange marmalade, caramel, sparkling oak, lemon balm, lemongrass, the barley levels off, ''Red Bull'' cola, slightly salty, a hint of marzipan",
            "finish": "Relatively short, very soft, cocoa, a delicate roasted aroma, nutmeg, a pinch of salt, grapefruit, a hint of liquorice, everything fades very quickly"
        },
        {
            "user_name": "Thermidor",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "30 dec 2020 1:02 pm",
            "content": "A pleasant surprise. Very 'authentic' and 'honest'. Next to Highland Park 12 (2015) it's a bit less substantial, so 82 pts. vs HP's 83.",
            "nose": "Coastal, slightly salty at first whiff. Also yeasty, malty and grassy.with some flower petals. It's all a bit faint, though.",
            "taste": "The body is not as flat as 40 % would lead one to expect. There is no obvious wateriness. Oddly satisfying is what it is, with nearly no obvious touches of wood which makes it stand out in the modern market. A bright juicy note, cantaloupe maybe. A faint note of potato chips. The ever so slight booziness reduces the score a bit though.",
            "finish": "Not very long but sufficient for such a low strength, with no flaws."
        },
        {
            "user_name": "Othorion",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "02 may 2016 8:52 pm",
            "content": "Not a bad entry point, but nothing that tears you off your stool",
            "nose": "Equally salty sea air, pear, apricot, a hint of lavender, honey cereal cereals, spring meadow",
            "taste": "Strong onset, powerful but quickly diminishing, grapes, malty notes, nice interplay between sweet, salty and a slightly astringent dryness",
            "finish": "Rather short remaining fruit, then medium-long slightly bitter coffee and dark chocolate and continue to salty"
        },
        {
            "user_name": "Lorion",
            "user_rank": "Connoisseur",
            "rating": "59",
            "review_date": "18 oct 2017 2:04 pm",
            "content": "Well, the nose saves the whisky on 59 points.",
            "nose": "Floral and malty. After a few seconds it will be sweet. The alcohol is palpable and cools the nose. Something herbaceous, almost salty comes to it. Light vanilla. Lemon peel is also present.  After some time, the nose is sometimes really nice and sweet. Unfortunately, that does not stay long.",
            "taste": "Light, malty, a little sweet. Spicy. Somewhat flat. Alcohol is there.",
            "finish": "Rather short, a light malty and a bit bitter remains."
        },
        {
            "user_name": "drkrylov",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "05 may 2016 6:39 pm",
            "content": "Fresh, salty, appetizing. Pre-dinner.",
            "nose": "Dry. Peat, grass, sweet broom.",
            "taste": "Light. Still honey and nuts, but oilier.",
            "finish": "Oily. Soothing. Very salty."
        },
        {
            "user_name": "spigray",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "03 oct 2017 11:39 am",
            "content": "quite a good dram. I really like this kind of profile.the nose is the best part of this whisky.86/100",
            "nose": "reminds me of clynelish 14yo and oban 14yo because of the loveable mixture of fresh sea breeze, the minerality, citrus and apple fruitiness and the light beeswax notes. light vanilla notes.it´s what I call a coastal nose.",
            "taste": "despite the low ABV this is not thin or weakish.coastal, mineral, waxy, slightly woody. becoming relatively dry. but the palate does not quite deliver what the nose has promised.",
            "finish": "medium to short, rather dry and a little woody."
        },
        {
            "user_name": "robbert88",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "07 oct 2021 9:17 pm",
            "content": "Old pultney 12",
            "nose": "N: immediately positively surprised by the dirty nose. It is a bit dusty with a salty sea smell in it. Vanilla. Little polish. Pickled meat. Oak wood, fruity. Oil. It also has some floral scents. And a lot more fruit than you might think. For me, the saltiness really stands out.",
            "taste": "P: the sea influences are less here. Caramel. Oak wood, orange. Here you can taste that it only has 40% alcohol. Vanilla and after a few sips the saltiness comes up a bit more. Smooth and somewhat grassy.",
            "finish": "F: wood. Short. Bit dry to say the least. With citrus and again the sea influences. There is also a nice spiciness here."
        },
        {
            "user_name": "LukeFive",
            "user_rank": "Connoisseur",
            "rating": "75",
            "review_date": "01 nov 2013 3:46 am",
            "content": "Good value for money.I tried it and I am moving forward. It is interesting dram but its not for me. there is something I dislike about this particular version.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Koning",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "11 nov 2014 9:36 pm",
            "content": "When I bought this bottle I expected a sturdy maritime malt. It's a bit briny indeed, but very gentle. Best described as grapefuit and salty but overly sweet vanilla fudge both subdued into creaminess.",
            "nose": "Citrus fruits, vanilla, sweet candy, sea air, green tea, subtle peat",
            "taste": "Oily, soft, and creamy. Also briny, grapefruit, and vanilla.",
            "finish": "Rather short. Sour fruits (grapefruit), candy shop, salty and a dry finish, reminiscent of bitter black tea"
        },
        {
            "user_name": "Sandman",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "03 jan 2016 12:16 pm",
            "content": "My notes from 08-12-2014",
            "nose": "Flowers, sweet, apples, bananas and tropical fruit. With water: salty sea air and a lot of honey",
            "taste": "Sour lemons, sea water, notes of herbs, little bitterness",
            "finish": "Medium, slightly spicy, little sea salt and nuts"
        },
        {
            "user_name": "sarthur71",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "23 jan 2021 8:47 pm",
            "content": "",
            "nose": "simple, rather dull, fruity-sherry, brackish-sea, absolutely not brewed",
            "taste": "rather salty, watery-spicy, at the end - a wave of burning spices",
            "finish": "short, slightly alcoholic, also salty, dry and noticeably malty"
        },
        {
            "user_name": "Monte Gehro",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "27 sep 2020 7:47 pm",
            "content": "A good standard with a very good price-benefit ratio. On the nose, sweet and spicy honey, light fruits, plus something salty and maritime - I like it. Not new in the mouth, but the existing one is strong enough with a reasonably long finish.  It is hard to imagine how well this malt would come across with 43% or even 46% ...",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Goethe",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "09 apr 2017 9:16 pm",
            "content": "Easy Old Pulteney with a dominating vanilla.Concerning price/performance ratio: 7/10",
            "nose": "Floral, some white wine, yellow fruits, vanilla. some hay.",
            "taste": "Yellow fruits, nectarines, vanilla.",
            "finish": "Short. Vanilla, grapefruit."
        },
        {
            "user_name": "LordBellamy",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "05 jan 2015 2:34 pm",
            "content": "Nose: malt, barley, salt, honey, toasted bread, subtle fruit  Taste: sweet malt, slightly maritime, vanilla, slightly creamy  Finish: medium, sweet salt, cereals, dry, hardly oak  Conclusion: a good, solid malt",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Martin1965",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "01 mar 2019 3:20 pm",
            "content": "",
            "nose": "Citrus and orange notes, sea breeze",
            "taste": "Fruity and dry, spicy with oak",
            "finish": "Medium long with slight saltiness  Very nice flavors, good 12er"
        },
        {
            "user_name": "SirToby",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "03 oct 2023 3:17 pm",
            "content": "Colour - dark white wine, light brown hue",
            "nose": "Sweet wine, with pleasant herbal and wood notes in the background, slightly acidic, smells powerful.",
            "taste": "Very pleasantly mild and sweet, light and creamy in the mouth, vanilla, sweet and tart apple, molasses, syrup",
            "finish": "warm and long, very nice whisky"
        },
        {
            "user_name": "theograph",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "10 oct 2017 10:06 pm",
            "content": "A Einsteigetmalt - for me personally but one of the best. Simple, uncomplicated and really nice to drink. There are better and much more complex single malts, but not for that price!  PLV: 9/10",
            "nose": "Typical nose: fruity or honey-sweet, pronounced maritime-salty, clearly malty, slightly floury or dusty;",
            "taste": "Soft and sometimes sweet in the taste, a little sparkling or recognizable youthful, very sweet and pronounced maritime-salty, distinct grain or malt flavors, lemon and vanilla, slightly sour towards the end;",
            "finish": "Not particularly long and with a slightly sour note - salt, wood and lemon dominate;"
        },
        {
            "user_name": "bikenerd",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "18 apr 2018 8:03 am",
            "content": "the nose is the best part",
            "nose": "malt, sweet, tropical fruits, soap, vanilla, nuts",
            "taste": "caramel sweet, light fruity, salt, nuts?, honey, herbal,",
            "finish": "medium, caramel"
        },
        {
            "user_name": "Gloin",
            "user_rank": "Expert Senior",
            "rating": "75",
            "review_date": "08 jan 2015 12:42 am",
            "content": "A standard whisky, has something of everything, but nothing really, is thereby meaningless and boring  Blind tasting!",
            "nose": "Red apples, lemon, but also light sherry flavors, behind it could even be a hint of smoke, but maybe that's just my imagination. Something herbal is also there. All this is intricately interwoven and not so easy to decipher",
            "taste": "Light body, quite sweet, fruity, again with apples and citrus notes. On the palate, I notice no sherry, as well as no smoke",
            "finish": "Something malty, delicate bitterness, a touch of oak, not very long"
        },
        {
            "user_name": "Goldenwhiskycave",
            "user_rank": "Expert Senior",
            "rating": "76",
            "review_date": "27 oct 2021 7:00 pm",
            "content": "My stepfather surprised me with this fine whisky very drinkable and soft",
            "nose": "Fresh, floral, fine mix of herbs and especially soft",
            "taste": "Soft, has a nice character, salty taste with a fruity touch but more spicy fruity",
            "finish": "Fairly short but still a full flavor"
        },
        {
            "user_name": "Shane_IL",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "28 jan 2016 11:52 pm",
            "content": "Not the most complex of whsikies, but excellent VFM.",
            "nose": "Dry fruit. Honey. Light salt. Balsa wood. Pears in custard. Bread pudding. Floral.",
            "taste": "Sticky wood. Woodspice. Honey. Salty toffee. Nuts.",
            "finish": "Medium. Salt. Woodspice. Stewed fruit."
        },
        {
            "user_name": "Koalafant",
            "user_rank": "Expert Senior",
            "rating": "65",
            "review_date": "11 jul 2016 12:48 am",
            "content": "After the nose developed so promising, the palate on the palate is an absolute disappointment: no strength, no clear aromas. The echo also sounds extremely short and meaningless.  (65/100)",
            "nose": "Mild, slightly sherry-toned nose, plus hay and thyme. After a while, it gets a bit more fruity ... raspberry and tangerine join.",
            "taste": "An indefinable potpourri of flavors ... unfortunately a bit flat and one-dimensional",
            "finish": "short"
        },
        {
            "user_name": "Igor_Gudimov",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "13 sep 2020 3:43 pm",
            "content": "Light salty aroma, a little bit fruity and salty on taste. Nice one.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Magnus Hillman",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "30 jul 2014 7:08 pm",
            "content": "A good approachable entry level malt. Full of flavors and very delicious.(Rating interval 82-85)",
            "nose": "Some green apples and exotic fruits. Slightly nutty, maybe marzipan or chops. Some oak and resin.",
            "taste": "Bitter and sweet delivery, with lemon and green apples, resin again. Some sweetness in it, I would say white sugar or chops with toffee and vanilla..",
            "finish": "The finish is short and floral (jasmine) which disappear quickly in subtle sweetness and just a hint of brine."
        },
        {
            "user_name": "Igor",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "27 mar 2014 8:00 am",
            "content": "Surely a reliable flagship, you can't go wrong with it.",
            "nose": "Exuberant fresh fruits: white apple, mango, melon, pumpkin. Mild varnished wood emerge, nuts, green turf, juniper berries, cedar, heath. Intensified vanilla notes similar to cream soda come up soon after.",
            "taste": "Light-bodied, in all likelihood. Clean. Neither thin nor fat but with emphatic bourbon(y) motives, gentle honey touch, sawdust, salty avocado, hazelnuts. Everything is imbued with lovely maritime saltiness.",
            "finish": "Peppery, quite savoury, briny, lemony, refreshful. Apt medium long finish."
        },
        {
            "user_name": "Myst111",
            "user_rank": "Expert Senior",
            "rating": "79",
            "review_date": "23 jan 2018 9:07 pm",
            "content": "Nose: Spicy, Sweet fruity (mixture of tropical sweet citrus fruits), In the background light smoke, cereals and green apple can be recognized after some time. Very complex nose for 40% Taste: Very dry, honey, cereals, bitter finish: pepper, bitterness, salty, mid-length Summary: Unfortunately, the taste does not keep what the nose promises. Although the price performance is consistently ok, the finish scares me but clearly from a recent purchase.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "ThS",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "19 jul 2014 9:11 pm",
            "content": "",
            "nose": "Malty, waxy, hop flower and yellow peach in honey with a hint of salt.",
            "taste": "Oily, a little flat and watery on biscuity cereals.",
            "finish": "Short, malty and floral."
        },
        {
            "user_name": "g00se",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "15 apr 2020 12:23 pm",
            "content": "Nice maritime whisky. That means: Fresh sea air, salty and yet smooth.  Could take 3-6 turns more, but at the price you can't complain. With the next bottle there are also notes. It went empty too quickly: D Actually 86 pts plus a sympathy point :)",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Crann feàrna",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "22 may 2020 4:47 pm",
            "content": "Very competent whisky. Uniquely own style.",
            "nose": "No water: salty/briny, Brusselles' sprouts, floral sweetness, vanilla hint, light citrus.With water: more briny, quickly entering sweet floral perfume, hints of fresh grass.",
            "taste": "No water: sweet and salty arrival. Citrussy development of lime and oranges.With water: sweet, salty and citrus arrival. Nice development in citrus of oranges and hints of lime, vanilla sweetness.",
            "finish": "No water: slightly bitter and sour.But with water: nice, tongue-coating and soft finish of sour and sweetness."
        },
        {
            "user_name": "aquataste",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "13 jul 2024 9:45 pm",
            "content": "",
            "nose": "Sweet and fresh, aromatic apples, a lot of honey, delicately citrus, a bit grassy and floral, a bit of orange and peaches, vanilla, a pinch of cinnamon and dried herbs, notes of wood and nuts, notes of stale fruit far in the background",
            "taste": "Sweet and fresh, a bit watery, a lot of honey and apples, slightly citrus, vanilla, a bit of caramel and toffee, notes of wood and nuts, a bit of dried herbs, a pinch of cinnamon and salt, notes of stale fruit in the background",
            "finish": "Medium length, light, delicately citrusy with apples, slightly nutty, a small pinch of cinnamon and salt, dried herbs and notes of stale fruit at the end"
        },
        {
            "user_name": "AdamsB",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "18 jul 2019 10:59 pm",
            "content": "Silver medalist 2015 at the International wine and spirits competition",
            "nose": "Lemon, Vanilla, Banana, Sea breeze",
            "taste": "Orange, Vanilla, Oak, Caramel, Toffee",
            "finish": "Oak, Grass, Salt"
        },
        {
            "user_name": "Opeth83",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "19 jan 2016 10:40 pm",
            "content": "Great entry-level whisky for the money",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Hupsende Hippie",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "09 aug 2018 3:32 pm",
            "content": "A unique whisky. It has flavors that you do not taste in many other whiskys, and vice versa. Also a good price / quality ratio. It lacks some depth in the taste, and the aftertaste is slightly too bitter.",
            "nose": "Salty, grain, apple, wood",
            "taste": "Salt and apple are not only in the nose, but also in taste. Furthermore: sweet, bitter (such as beer or tea), and a touch of coconut.",
            "finish": "Bitter, notes."
        },
        {
            "user_name": "vojt466",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "13 oct 2016 7:47 pm",
            "content": "Sweet, honey and woody and .. salty - such a basic single malt, why not ..",
            "nose": "Salt combined with honey sweetness, wax, vanilla, dried fruit (raisins), hazelnuts in honey",
            "taste": "The woody sweet taste - caramel, vanilla, honey, spice, grep, again is a little bit of salt.",
            "finish": "In reverberation, woodiness, caramel and vanilla, and a bit of bitterness and salt at the end of what can survive. Medium long"
        },
        {
            "user_name": "AX1654XA",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "19 nov 2021 5:55 pm",
            "content": "",
            "nose": "peach puree, salty surf breeze, meadow flowers, freshness, candied honey",
            "taste": "sweetly prickly, fruit lollipops duchess, bitterness",
            "finish": "rustic warming, not long"
        },
        {
            "user_name": "zinaf",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "13 aug 2015 9:33 am",
            "content": "Very exciting nose that is not matched fully by the palate. I liked more the previous version I tried (with 12 in the square) Still very nice whisky in a very distinct flavour profile. Highly recommended.",
            "nose": "Malty at first - porridge, cereals; hint of grass; bitter almonds; sour green apple; bee's wax. Then some briny note comes.Then goes into sweet and fruity - baked apples, apricot distillate, ripe banana. Sweet and creamy nose - vanilla. Fresh oak wood is also present.After some more time - candied lemons; lemon grass. Brine",
            "taste": "Light and mellow, needs a bit more ABV.Citrus, grass, light sweetness; bitter on the tongue.",
            "finish": "On the short side - nicely drying and light sweetness till the end."
        }
    ]
}