{
    "info": {
        "ws_name": "Edradour 10-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Edradour",
        "ws_age": 10,
        "ws_abv": 40.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/3/4/0/252927-normal.png",
        "ws_rating": 80.41,
        "ws_vote_cnt": 1251,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/340/edradour-10-year-old"
    },
    "collected_count": 53,
    "reviews": [
        {
            "user_name": "Slàinte Mhath",
            "user_rank": "Super Administrator",
            "rating": "79",
            "review_date": "03 aug 2019 4:06 pm",
            "content": "Based in Pitlochry and owned by independent bottler Signatory Vintage, Edradour remains one of the smallest distilleries in Scotland. Rich honey sweetness, heather and a diffuse flowery scent encounter the nose on first contact. Very nice, but obviously young. Something bothers me on the palate. It is neither the sweet maltiness, paired with oranges and spices, nor the soft and creamy character. There is something sharp and herbaceous that is hard to pin down. The finish is fairly short with honey and bitter nuts. Not a bad malt, but slightly disjointed.RATING: 3.0/5.0 stars ≙ 79 pts → AVERAGE",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "KayMeertens",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "17 oct 2014 9:58 am",
            "content": "Tasting note under the 50 ml edition.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Cubey666",
            "user_rank": "Connoisseur",
            "rating": "74",
            "review_date": "02 aug 2021 10:27 am",
            "content": "Tasted at WTF 2018",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Andytka3",
            "user_rank": "Connoisseur",
            "rating": "74",
            "review_date": "24 dec 2016 4:08 am",
            "content": "Nose:- Unique. Oily and creamy fragrance zests with sherry notes. Black olive come to mind, alluring.  Palate:- Milky soft texture but complex in flavours. Sherry and dark fruits greets you with tasty creaminess, follow by prickly and soft sourish fruits, with a touch of toasted spices. Slightly fade and thin on mouth coating,  Finish:- Plum and vanilla emerge, long and chili finish. But a light kick back reflects the young age.— at The Whisky Bar, Kuala Lumpur.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Kantenmechaniker",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "26 nov 2017 10:43 am",
            "content": "very good beginner, despite the watery mouthfeel, the flavors are transported quite well",
            "nose": "slightly floral, fruity, ripe, almost fermented pear, vanilla, overall rather sweet",
            "taste": "slightly watery mouthfeel, again fermented fruit, apple and pears, sweet, vanilla, slightly tart, pleasant to drink, after the first sip the intensity decreases slightly",
            "finish": "becoming bitter, the fruit becomes sour, now clear pear, creamy"
        },
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "08 jul 2025 10:48 pm",
            "content": "2020 Rating",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "markjedi1",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "27 nov 2016 10:44 am",
            "content": "YeastFor the longest time Edradour has had a not-so-good reputation (I am being polite), but since Andrew Symington took over in 2002, lots of pearls have appeared from this small distillery in Pitlochry. Maybe the current 10 Year Old is made with their own spirit, but I am still trying an older bottling, from 2009. This means it was distilled in the Pernod-Ricard age.The nose is a little bit of a stinker (but less bad than I remember from 6 years ago). A touch of sink is surrounded by some dried fruits on the one hand (think sultanas and apples) and some nuts on the other (mostly almonds). It has a bit of a sulphury side, but that quickly evaporates to make room for slightly burnt caramel.It is quite oily – almost syrupy – with a malty heart, but also a yeasty edge as it were. The dried fruit and nuts from the nose return, upholstered with some juicy honey. Woodsmoke rears its head. And yet it also has a bitter and somewhat sour edge that makes me think some bad casks were involved (which is probably BS, but that’s how I feel).The finish is fairly long with an uppercut of nutmeg at the death.This remains to me a ‘difficult’ whisky to enjoy. Too many offnotes if you ask me. Just under 40 EUR.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Totoro",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "16 apr 2018 6:08 pm",
            "content": "Different for sure. I can see why some really can‘t stand this. Yeasty, musty, sulphury, farmy, cheesy. Funnily enough, some bottles of this bear traces of peat smoke, while others don’t. I’d say the smoke improves it; unfortunately my current bottle appears to be smoke-free.You can‘t deny the quality of the sherry-cask maturation involved here, though. Nice, rich, \"old-style\" oloroso notes create a savory impression, somewhere between Chinese plum wine and Worcester sauce (umami). The more unlikely aromas appear to subside with continuous nosing, the whole heads more and more in the direction of some dark, gamey broth. However, the low strength indubitably hurts it. Watery body, but even at 40% ABV you can detect the underlying, substantial character. Dry, nutty, dark fruity sherry attacks first, then come some (subdued) sweet notes and finally a serious, oaky, prickly bitterness, which, again, may be too much for some. That being said, I kind of dig what it does and can see this as a dessert dram that would stand up well against some strong cheeses or heavy fare like dark mousse-au-chocolat.An outlier in the field of entry-level OB‘s, but can you really criticize character? I think not. Solid 82-83 points.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Tom na Gruagaich",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "30 jan 2019 10:20 pm",
            "content": "Sweet, oak, cooked fruit, a little sherry, crisp and fresh round and satisfying. Beautiful Highlander. Again and again!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "karloff",
            "user_rank": "Specialist",
            "rating": "56",
            "review_date": "21 dec 2015 4:21 pm",
            "content": "This was a big disappointment for me.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "karloff",
            "user_rank": "Specialist",
            "rating": "56",
            "review_date": "02 nov 2010 8:42 pm",
            "content": "Got this as a presant off my wife, i've always wanted it and was gutted to find it very ordinary. A lovely distillery but not a lovely malt",
            "nose": "Floral and fruity and light on the body",
            "taste": "A warming taste with little bits of honey and almonds",
            "finish": "A little sweet and a little short"
        },
        {
            "user_name": "Malthead19",
            "user_rank": "Connoisseur",
            "rating": "76",
            "review_date": "07 oct 2022 11:39 am",
            "content": "- a long time ago but wasn't so enthusiastic - good standard but also \"only\" the entrance to the distillery to get to know (all previous bottlings were better) - a strong, strong character - little sherry, rather more oak and spicy aromas in the taste",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "pianoman",
            "user_rank": "Connoisseur",
            "rating": "75",
            "review_date": "02 jul 2016 3:32 pm",
            "content": "",
            "nose": "Fruity with a slight touch of glue. Honey. Freshly sawn fir wood.",
            "taste": "Nutty bitterness. Bright fruits. Laundry detergent.",
            "finish": ""
        },
        {
            "user_name": "Mr.Edradour",
            "user_rank": "Connoisseur",
            "rating": "78",
            "review_date": "11 jan 2016 10:47 am",
            "content": "@karloffC'mon, it is not that bad. It is just a 10 year old single malt scotch, nothing more, nothing less. ;-)",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "granella2003",
            "user_rank": "Connoisseur",
            "rating": "76",
            "review_date": "09 oct 2012 1:36 am",
            "content": "An inusual light and floreal highlander. Fascinated by the uniìusual scents but disappointed by the flavour too light and simply for a highland. Too expensive for his medium quality.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "granella2003",
            "user_rank": "Connoisseur",
            "rating": "76",
            "review_date": "09 oct 2012 1:34 am",
            "content": "",
            "nose": "Floreal - violet??, sherry.",
            "taste": "Light sherry, soft barley and flreal",
            "finish": "Light boody and short finish with a hint of sherry"
        },
        {
            "user_name": "ThinLizzy",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "11 jul 2020 9:36 pm",
            "content": "This one has actually improved over the years, it seems to me. I guess the batches vary heavily.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "DistiLesha",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "06 apr 2022 11:19 pm",
            "content": "It is a pity that it is watery and could be much richer with a slightly higher strength of 46%. Very pleasant, drinkable whisky for the sweet tooth and lovers of good sherry whisky! I don't understand why the average rating is so low. Excellent drinking whisky - a real Scottish gem! N:22 T:21 F:22 B:20",
            "nose": "Dusty leather armchair, fruity, prune, sweet and dense, chocolate, apricot, raisin, very appetizing, tannic, classic sherry sulphur. A few drops of water reveal the perfume.",
            "taste": "Chocolate, dried apricots, almost cloying, sugar candy, a lot of raisins and black oily prunes, refined sunflower oil, quite watery, light pleasant bitterness. A few drops of water are a nice touch, revealing grapey and sweet soft dried fruits. The distillery's signature subtle yeasty profile is well recognizable.",
            "finish": "Wood tannins, black oily prunes, bright sherry dryness, astringency in the mouth, confident pleasant tannin bitterness of oak extractives. Long lasting, bright and pleasant!"
        },
        {
            "user_name": "Saftkenner",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "13 nov 2021 8:09 pm",
            "content": "In terms of price, but still to wean off. This bottle is unlikely to make anyone a whisky lover. On the surface, these three words strike: sour, bitter, out-of-round.",
            "nose": "Quite unbalanced sherry nose, very tart and slightly spicy. Cranberries, red wine, anise, cloves, blood orange, fermented pomegranate, damp leaves lying on the ground in autumn.",
            "taste": "Watery and still spicy alcohol. Sour and bitter. The taste is otherwise an aromatic reflection of the nose.",
            "finish": "Medium-length finish with clear tannins, some ash and grapefruit."
        },
        {
            "user_name": "dongolzo81",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "25 dec 2019 12:42 am",
            "content": "Blind tasting:  Nose: sweet, coffee, dark caramel, baking plums, dates, everything a little fleeting  Flavor: initially very mild, then delayed intensive seasoning with nuts, clear sherry barrel,  Finish: medium length with nice sweetness and balanced spice  Since my wife gave me the tip that it wasn't a Speysider, I bet on Edradour  Conclusion: balanced, complex good drop with slight weakness on the nose, 85/100",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Marko_I",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "14 jun 2015 9:04 pm",
            "content": "one of my favorite distilleries and my favorite standard OA, but more polarizing than pleasing and quite idiosyncratic",
            "nose": "Jam (strawberry, cherry), some marzipan, toffee, a hint of old leather and tobacco",
            "taste": "nutty-spicy-sweet, nougat, dark chocolate, sugar beet syrup, leather, tobacco, even some earthy notes, licorice, dusty-dry mouthfeel",
            "finish": "long, spicy, tobacco, licorice"
        },
        {
            "user_name": "Ciro",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "31 jan 2020 3:14 pm",
            "content": "I like! I'm a bit baffled by the poor ratings ... (78 on average ?!?)",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Issie",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "03 nov 2018 4:14 pm",
            "content": "",
            "nose": "Apple, citrus, some menthol",
            "taste": "very oily, a little apple, a bit bitterness, definitely light in the mouth",
            "finish": "Rather short and clearly more aggressive than one would expect"
        },
        {
            "user_name": "MrGlenfarclas",
            "user_rank": "Connoisseur",
            "rating": "72",
            "review_date": "14 jan 2014 3:15 pm",
            "content": "Quite promising nose but then there´s somethig in the taste I don´t like at all. Hard to decribe. Tastes kinda flowery and soapy.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Boletus",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "14 dec 2022 10:16 pm",
            "content": "This whisky shows character, but rather a rebellious one. It's certainly distinct, but the greasy mouthfeel it produces, too reminiscent of a pair of fries soaked in fryer grease, puts me off. Well, not my cup of tea!",
            "nose": "Dark beer, very malty, a bit of dates and figs, a slight influence of the sherry casks can be seen, hay, ripe bananas, sulphurous grapes",
            "taste": "Lots of malt at the beginning, quite greasy, pepper and cloves, acrid and sulphurous, tree sap, molasses",
            "finish": "Rather short, malty, the hay comes through again, feels as if it had left a light greasy coating on the palate, a bit of chocolate (rather dark), the grapes show a bitter skin"
        },
        {
            "user_name": "hsmithjr",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "05 may 2011 1:29 am",
            "content": "Not one of the best, but certainly not one of the worst.",
            "nose": "Vanilla.  Sweet fruit. Hints of sherry. Apple crisp..",
            "taste": "Bananas Foster. Creamy  and light. Hazelnut biscuits.  Flower shoppe.",
            "finish": "Mellow. Fresh. Rather short."
        },
        {
            "user_name": "Kovalyoff",
            "user_rank": "Connoisseur",
            "rating": "77",
            "review_date": "06 oct 2019 11:00 pm",
            "content": "Horror. The best example of when there is a nose, but there is no taste, or rather, it is simply terrible.  Nose: Sivuha ... Real moonshine ...  Let stand.  Smoked, prunes, mash (wine) ...  Taste: trash, right away ... I tried the moonshine better, but it's Single Molt ...  Finish: sweet sherry, but without a foundation ...",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Punktar",
            "user_rank": "Connoisseur",
            "rating": "72",
            "review_date": "20 oct 2018 4:17 am",
            "content": "Actually quite pleasant to drink, but there is little substance.",
            "nose": "Pear in the nose, some hay and overall rather sweet.",
            "taste": "Immediately on the palate again the pear, otherwise not really much and everything superficial. It rinses on the palate but does not really do much. I really tried to keep it long in my mouth, but as a result, that does not change anything.",
            "finish": "Very short, here too the pear. But at least nothing unpleasant."
        },
        {
            "user_name": "Lorion",
            "user_rank": "Connoisseur",
            "rating": "58",
            "review_date": "11 may 2018 12:52 am",
            "content": "Pretty telling. 58P.",
            "nose": "Honey sweetness, cereals, slightly floral.",
            "taste": "Flat, discreetly sweet, malty.",
            "finish": "In short, cereals."
        },
        {
            "user_name": "alectron",
            "user_rank": "Connoisseur",
            "rating": "52",
            "review_date": "25 feb 2011 1:31 pm",
            "content": "uuh. one of the worst whiskies I ever had. plastic, fake fruit esther & something I couldn't place my finger on (paper/cardboard...?). The only whisky related drinks I found more unpleaseant were some new spirits, and hey, they don't pretend to be whiskies.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "DramALife",
            "user_rank": "Connoisseur",
            "rating": "74",
            "review_date": "06 mar 2022 10:53 pm",
            "content": "S 5Overall unexciting. Would drink if it was the only option. The nose shows a classic example of what if sherried cask goes wrong. Rather than a whisky to taste, I would say it's a dessert drink.N 22Excessive sherry brings aroma like sticky oil clotted on the stove. Some espresso beans. The nose is thick but still feeling the spirit poking here and there. Barley sugar and oak wood were masked by the sherry influences.P 25Very sherry (nutty, dried fruit, raisins). It's quite malty and developing some warm winter spices over time. Some wine tannin underpinned the entire time alongside some honey in distance.F 22Short-Mid, dry finish. Some oak spices and boiled fruit notes lingering.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Spoerkel",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "03 dec 2024 9:58 am",
            "content": "Unfortunately very watery.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "drkrylov",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "01 dec 2011 1:50 pm",
            "content": "",
            "nose": "Minty. Leafy.",
            "taste": "Syrupy. Smoky.",
            "finish": "Barbecue. Charcoal."
        },
        {
            "user_name": "robbert88",
            "user_rank": "Connoisseur",
            "rating": "77",
            "review_date": "15 feb 2022 10:58 pm",
            "content": "I remember when I opened the bottle I found it quite intense in the pepper and cloves. Now a year later I find it quite flat and watery in the palette and aftertaste. Clearly a whisky that should not be left open too long.",
            "nose": "honey, toffee, dried fruit, little bit of leather, orange, floral perfume, figs, cloves, cinnamon,",
            "taste": "almond, orange, cloves, butter,",
            "finish": "black pepper, short, tannins of wood, slightly watery."
        },
        {
            "user_name": "domani",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "23 feb 2016 11:33 pm",
            "content": "A straight-lined 10-year-old single malt from a sympathetic distillery without much to overwhelm - 22.02.2014",
            "nose": "Malt, sherry, raisins",
            "taste": "Malt sweetness, spicy, woody note",
            "finish": "medium"
        },
        {
            "user_name": "Feusi",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "14 jul 2011 2:40 pm",
            "content": "Soft and comfortable, you could drink it for hours. Best choice to drink a glass (or more) with friends without having to discuss to much over this bottling. This is a classic for me, so I imagine a good standard of whisky. Soft and pleasant to drink. Honey with some herbs and a hint of smoke on the palate with a medium finish.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "aw-home",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "09 jan 2025 11:45 am",
            "content": "",
            "nose": "Malty sweetness with light sherry fruits, honey, nutty notes and oak aromas.",
            "taste": "Nutty notes with caramel, ripe fruit, spices and oak aromas.",
            "finish": "Long with sherry fruits, caramel, spices, nutty notes and oak aromas."
        },
        {
            "user_name": "ASWhisky",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "26 jul 2015 3:25 pm",
            "content": "doesn't make me nervous but okay",
            "nose": "Torf, Äpfel, Vanille etwas maritim und einen Hauch SalzBratapfel (Fass) etwas Medizin, wenig Leder oder Torf jetzt kommt Fallobst",
            "taste": "milder Antritt Popcorn, wässrig, Mirabelle, Salz, Kräuter etwas Schnapsfeeling Wieder Kräuteram Gaumen etwas bitter",
            "finish": "warmes Apfelfleisch mürbe im Wechsel mit Lakritze .. etwas bitter, Fassnoten, leicht faulig,"
        },
        {
            "user_name": "Vas",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "14 jun 2023 6:14 am",
            "content": "Slightly weak and simple. Maybe 40% abv is not enough for it. The nose is promising, but taste mostly empty",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Alex",
            "user_rank": "Connoisseur",
            "rating": "78",
            "review_date": "04 sep 2015 10:34 am",
            "content": "nice allrounder, good daily dram and not boring",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Lafroy",
            "user_rank": "Expert Senior",
            "rating": "55",
            "review_date": "23 may 2011 10:42 pm",
            "content": "",
            "nose": "Meadowland flowers, sweetness, light tangerine, washingformula, barley, hay, a little bit of nuts and honey.",
            "taste": "Very flat, it starts with sweetness, but it doesn'tlast long. There is a lot of dryness, possibly some sourness, bitterness andvery unpleasant impression.",
            "finish": "Very short and rubbish."
        },
        {
            "user_name": "Alex_Whisky_Corner",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "21 may 2023 9:18 pm",
            "content": "A very good whisky for a 10 year old Scotsman. The almost 50 € are also in order. Definitely a buy recommendation.",
            "nose": "sweet malt, sherry, vanilla, spices",
            "taste": "mild and creamy, cereal, sweet",
            "finish": "Medium length, dry, creamy with spicy notes"
        },
        {
            "user_name": "Whisky Hamster",
            "user_rank": "Expert Senior",
            "rating": "79",
            "review_date": "10 mar 2021 7:15 pm",
            "content": "Still seems to undergo strong batch variations. Had my horror stories with Edradours over time (interestingly less so with Ballechins!), but a recent bottle of 10 I tried was pretty solid. Nothing to write home about but not worse than other entry level bottlings.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Dottore",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "12 jun 2017 8:12 pm",
            "content": "Like for a standard with 40% and \"only\" 10 years surprisingly well. 85 points",
            "nose": "Sherry pretty prominent. Slightly cheesy, greasy odor. Baked apple and orange grated. Vanilla.",
            "taste": "Amazingly rich in flavors for 40%. Very prominent pastry and bread notes. Spice cake with dried fruits. Again quite a lot of vanilla notes. Soft, aromatic and in no way watery. Nice!",
            "finish": "Medium long and soft without any bitterness. Spicy dryness."
        },
        {
            "user_name": "ZLako",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "18 nov 2022 11:56 pm",
            "content": "Great sherried expression with a short finish and a huge price tag.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "claymore84",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "04 mar 2022 9:27 pm",
            "content": "Tasted on 03-04-2021.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "p4blo",
            "user_rank": "Expert Senior",
            "rating": "70",
            "review_date": "26 jun 2015 10:22 am",
            "content": "5 cl sample notes.",
            "nose": "Very winey, reminds me of cheap brandy with this overpowering sweet/sour nose, some grapes, vanilla and not much more.",
            "taste": "Very forgettable. Some faint notes of sherry, nuts, but nothing too distinctive.",
            "finish": "Quite long what is not exactly a good thing in this case. Better than the nose, though."
        },
        {
            "user_name": "eselsim",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "10 nov 2024 8:36 pm",
            "content": "caledonia is much better unfortunately(",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "pilgrim77",
            "user_rank": "Expert Senior",
            "rating": "77",
            "review_date": "14 apr 2022 8:01 pm",
            "content": "Tried again in 2022 in the Fortingall Hotel. Much, much better than the last one I tried. A very drinkable, sherried dram.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "tomy63",
            "user_rank": "Expert Senior",
            "rating": "74",
            "review_date": "14 may 2011 3:27 pm",
            "content": "Too much butter and too creamy, but for those looking for this profile do not hesitate",
            "nose": "walnut honey apple plum",
            "taste": "butter, creamy, floral and evolves on spices",
            "finish": "fruitee, evolve on the caramel"
        },
        {
            "user_name": "Magnus Hillman",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "20 jul 2014 6:33 pm",
            "content": "The nose is just great, the palate isn't really synchronized with the nose. The finish is a bit disappointing. One dram only, so I feel like I have to buy a bottle to really investigate. Recently I have become very interested this distillery since I've tasted a couple of \"straight from the casks\". Fabulous stuff really! I think this entry level malt needs more investigation.(Rating interval 79-84)",
            "nose": "floral with jasmine and roses, sweet, white sugar, some cotton candy or meringue. Some orange rind, orange candy (Tic tac) and oak.",
            "taste": "sweet initial but changes rapidly to more bitter citrus, lemon rind, grapefruit, lime juice and black pepper. The floral notes contains violets now.",
            "finish": "The finish is short and sharp. lemon pepper, nothing else."
        },
        {
            "user_name": "Igor",
            "user_rank": "Expert Senior",
            "rating": "78",
            "review_date": "10 mar 2013 1:32 pm",
            "content": "Water is obligatory! Gets much softer, mellower and, what the heck, much better anyways. That will release marmalade, cherries, confiture, plum jelly, walnuts, nutmeg, bitter wood, flan, dark chocolate, cocoa. Sure it needs few drops of water to be added.",
            "nose": "Pretty odd and unusual. Spring orchard, blossoming cherry-trees, grass-plot, sour grapes, green apple, lemon, bunch of fresh daisies, bubbling yeast, foamy, sultanas?, acacia honey, clay. Slow down and take your time, aromas will evolve into marshmallow, lemon candies, air freshener with lilies-of-the-valley and dandelions sappy notes, a heap of old books on earth floor, stale yellow pages scattered everywhere, for dessert you have got warmed-up crème caramel. Enjoy your meal!",
            "taste": "Again, I got some flaws and off-notes here. Creamy, somewhat mineral (granite-like), charcoal, ugh! - acrid sulphur, loads of it, wild honey, barley sugar candy, roasted peanuts, dry white wine. After that citrus acidity and bitterness break in, it's getting vinegary, waxy, cany (sugar cane?), varnish, whitewash, slightly fusty oak barrel, cardboard packaging?, zest, tea leaves. Edgy, prickling, medium-bodied, quite nervous, for me it's just not round enough.",
            "finish": "Medium to long finish. Fierce on spice, citrus, acerbic, slightly salty, herbal. Sour apple, sage, horseradish?, fennel, vermouth, liquorice, cloves, pepper, ginger, grapefruit tinge, lime/lemon rind, green apricots, eau de Cologne, charred wood, chicory."
        },
        {
            "user_name": "Heemhoeve",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "19 oct 2020 10:05 pm",
            "content": "Whisky is very accessible, refined sweetness. Reminiscent of sweet apricot. Finish is short, but intense.",
            "nose": "Sweet, real whisky scent.",
            "taste": "Taste a little sharp on the tongue and then a caramel softness.",
            "finish": "Intensive"
        }
    ]
}