{
    "info": {
        "ws_name": "Glenfarclas 105",
        "ws_category": "Single Malt",
        "ws_distillery": "Glenfarclas",
        "ws_age": null,
        "ws_abv": 60.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/3/2/091/80868-normal.png",
        "ws_rating": 83.5,
        "ws_vote_cnt": 2453,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/32091/glenfarclas-105"
    },
    "collected_count": 51,
    "reviews": [
        {
            "user_name": "lincolnimp",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "25 jan 2017 10:48 pm",
            "content": "This is very good value, and you can really experiment with water.beginners to whisky should all try this whisky, hard to beat on value or quality.",
            "nose": "Smells like a Cheeseboard with the grape selection on it. caramel and custard cream biscuits.",
            "taste": "Fizzy and fruity, on caramel, apple, ripe peach and apricot.There are a lot of cream notes and more apricot.",
            "finish": "Long and vibrantWith water:-The nose is less expressive  and on the palate it reminds me of the new 18 year which is a good thing."
        },
        {
            "user_name": "Slàinte Mhath",
            "user_rank": "Super Administrator",
            "rating": "84",
            "review_date": "24 jan 2020 1:16 pm",
            "content": "Batch variation seems to be an issue in Glenfarclas 105, so let's give this 'bang for the buck malt' a proper re-review. Slightly aggressive, the nose starts off with fruity sweetness, strawberry yogurt, candy apple and alcohol. With water, the fruitiness intensifies, featuring peach, roasted nuts and hints of vinegar. After a bold and peppery arrival, this young beast becomes quite tasty. Chocolate, juicy berries and a touch of mint flow into a lingering finish, full of spices, bitter oranges and tiramisu. Calling this malt 'the poor man's A'bunadh' wouldn't do it justice!RATING: 3.5/5.0 stars ≙ 84 pts → ABOVE AVERAGE",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Andytka3",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "11 dec 2016 5:48 am",
            "content": "N- Dark cocoa, dust of floral. Charred oak and beefy. Water drawn out the olorosso sherry oak and nutty. P- Stiff structure and very dry, fiery oak and sherry dark fruits develops into spicy, combined with a hint of tannic. F- Smooth for the strength, cocoa and warming. Spiciness build up to gives it a lasting finish. — at The Whisky Bar, Kuala Lumpur.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "22 may 2014 12:30 pm",
            "content": "N: Sherry trifle with lots of soaked baby figs, fruits [orange and rhubarb] and raisins. Woody biscuits are on show and the tomato juice is ever present. Smells boozy, big xmas sherry cake notes and some rougher cooking sherry pungency. I also get chocolate drops, marzipan at times along with honey and peanut butter. Entertaining nose for sureT: A little harsh on arrival - everything arrives at once forming congestion between the ethanol, sherry and chocolate wood spice. Water helps to relieve things somewhat. Later things improve as the main body becomes more cohesive.  Lots of kick here so add waterF: Chocolate drops, nutmeg and caramel now develop. A chocolate/wood fuzziness develops here now making the 105 taste more like a blend, Furthermore, powdered chocolate and a woody bitter sweet freshness underpin the creamy chocolate chip vanilla conclusion.  Wood spice still maintaines its intensity all the way.C: Im not quite as wowed as i was after first trying this 105 from an older batch. However theres still much to like, especially on the nose and that nutmeg caramel combo is a cracking note. I'd love to try some single cask expressions of the 105 as these large vattings’ have some hit and miss casks in their midst culminating in this whisky tasting like a not so great blend at times [Old parr 12]. Adding water to this whisky improves the whole experience but for me it also removes much of the dynamic range.  Swings and roundabouts.End of bottle notesN: Sherried honey wine, musty must woodiness, caramel cream butter, sugared cream, vanilla essence, iodine seaweed notes, a yeasty nuttiness,  and pistachios.T: intensely spiced and sweet, packed full of intensity, quite a hit even with water F: fresh sweet oaky finish with caramel and aniseed vanillas C: About half way down this bottle turned harsh and rough, smelling and tasting more like a cooking sherry than a fine single malt and the bottle had only been open a month. However after having a bit of a downer over this bottle, it shone brighter again at the last pour.  My final score for the 105 is a B minus, because there is a lot of heat on arrival, water or not. i wonder whether my previous tastings were from superior batches? In summary - A rugged affordable everyday drinker, full or character and vigour.Overall, scores a B-",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "01 jul 2025 2:25 pm",
            "content": "2020 Rating",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Kapkan",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "24 jul 2021 6:22 pm",
            "content": "Very bright, very sweet, very sherry, it is created to shock.",
            "nose": "Sweet, with a hint of oak and a strong influence of sherry, prunes, marshmallows and dark raisins.",
            "taste": "Bright, burning taste of acetone and varnish, prunes and dates.",
            "finish": "Sweet, intense, aggressive, assertive."
        },
        {
            "user_name": "LeChiffre",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "13 may 2024 10:02 pm",
            "content": "Strong malt with well-integrated sherry cask maturation. Considering the price, this is a solid bottling that you can have in your glass again and again.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "mds51",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "25 jan 2015 3:12 pm",
            "content": "",
            "nose": "strong, sherry, raisins, plum compote, strawberry, citrus, mint, apples",
            "taste": "spicy, fruity, dark fruits, sweetness, vanilla, raspberry, malt, raisins",
            "finish": "dark chocolate, slightly bitter, The alcohol burns slightly in the esophagus"
        },
        {
            "user_name": "karloff",
            "user_rank": "Specialist",
            "rating": "89",
            "review_date": "15 oct 2014 10:40 pm",
            "content": "This was on my wishlist and it was everything that I thought it was and more. Very drinkable with added water and without. It deserves it's legendary status and it's at a very affordable price. Everyone who is on a whisky journey should try this at some point.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "karloff",
            "user_rank": "Specialist",
            "rating": "89",
            "review_date": "15 oct 2014 10:34 pm",
            "content": "Quality. I bought this in Cost Cutter in Dufftown Scotland.",
            "nose": "A lovely strong thick nose, but add a little water and there is dark chocolate orange, Christmas pudding, black boot polish, raisins and tined prunes.",
            "taste": "Full bodied, I tried it with water and without, both were excellent, liquorice, molasses, chocolate cake and dark cinder toffee just coat the inside of the mouth.",
            "finish": "This has a nice long dark fruit finish."
        },
        {
            "user_name": "pianoman",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "29 jan 2022 10:21 am",
            "content": "Blind Tasting",
            "nose": "Round, elegant. sour cherries. Raspberry cake. Lemon Thyme. lime juice. Behind some butter, olive oil and walnuts. A touch of honey. Wet autumn leaves.",
            "taste": "Spicy and sweet with a present spiciness. Raspberries, milk chocolate and red pepper. Fruit tea. Red grapes, almonds, a hint of leather.",
            "finish": ""
        },
        {
            "user_name": "Calmar",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "04 oct 2017 8:09 am",
            "content": "A class mole, one of the brightest representatives in its role - a young, strong lateral branch on the standard line of the distillery; simplicity, power and dampness of the material are attached and are rather merits with the right cut; in this case, everything was done right - the product turned out to be one-piece, balanced, with a beautifully inscribed large fortress, it all covers the entire line up to 21YO inclusive",
            "nose": "Open, saturated, pronounced sherry motifs, dried fruits - dried apricots, raisins, slightly less prunes, dried mushrooms, mold, earth; confectionery sweetness - jam, plum jam, slightly burned shortbread cookies;",
            "taste": "Powerful, sweet-spicy, peppery, confectionery motifs, oak bitterness, coriander, grassy bitterness, lacquer notes.",
            "finish": "Oily, sweet, fried peaches, mango, warm, long, fruit jam, spicy oak, ginger."
        },
        {
            "user_name": "Allandale",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "01 mar 2017 9:39 pm",
            "content": "I expected more power in this one.",
            "nose": "Complex.oaky tones, fruity like apples, pears and some hints of dark toffee sweetness.",
            "taste": "Little bit dry and assertive, rich spiciness combined with hints of oak and sherry fruit.",
            "finish": "Surprisingly smooth for the strength , warming, smoky and very rounded."
        },
        {
            "user_name": "Stanzeflasche",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "14 nov 2021 1:22 pm",
            "content": "Nose of cream and candied cherries, morello cherries, amarena. Despite the total absence of peat, it is well smoked, no doubt due to the barrels which are particularly burnt. It's intense, dark chocolate, almost bitter, varnished wood, wet leather, slightly sour strawberries. In the mouth, it lacks a little taste for 60°, some blood oranges, apricots, but it is intensely spicy, pepper, cumin, ginger, paprika. Wine-red, heather. Pure cocoa. Final quite explosive obviously, it rocks as they say! Plants, fresh soil, old marc. It is indeed an absolute reference, the first Cask Strength, and the first Sherry Bomb in the history of whisky. https://ilikesky2020.blogspot.com/2021/11/glenfarclas-105.html",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Tangtang_WhiskyYoda",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "01 feb 2022 4:05 pm",
            "content": "Notes from a blind tasting: nice malt. quite intense palate and finish. nose behave somewhat.",
            "nose": "a bit sour dirty at the beginning. Then it becomes softer and rounder. Berries come, as do honey and caramel. Oak and light citrus fruits. Then later with dried fruits. If you wet the wall of the glass, the alcohol shows up more strongly.",
            "taste": "strong start. slightly sharp. berries and dried fruits. citrus fruits. Chocolate. slightly sour. light oak. Later some grapes",
            "finish": "strong dark fruity finish. very intense and quite long. Slightly acidic and slightly tart towards the end."
        },
        {
            "user_name": "granella2003",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "04 feb 2013 7:42 pm",
            "content": "",
            "nose": "Aromas with hints of Tofee, milk chocolate, sweet sherry and smoke",
            "taste": "Strong character with a creamy texture of sweet malt, fruit, milk chocolate, rich oak wood, peat and smoke with hints of toffee and cinnamon",
            "finish": "Long aftertaste of peat, oak and smoke"
        },
        {
            "user_name": "granella2003",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "04 feb 2013 7:40 pm",
            "content": "An important and intense whisky classic interpretation of what should be a whisky sherry: clean and crisp. With a drop of water unleashes aromas of raisins, dates, prunes, sweet spicy notes of Aranca. The finish is long and persistent with hints of malt crystallized.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Saftkenner",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "10 mar 2023 5:23 pm",
            "content": "A bottling that you can definitely have fun with and that really allows for water features. Also has something to offer in terms of aroma, even if the youth undoubtedly still shines through.",
            "nose": "Vanilla, unripe apples, tart herbs, mint, fresh hazelnuts, quinces, strawberries, light metallic notes, linoleum, fresh wood. The alcohol is surprisingly well integrated.",
            "taste": "Vanilla, green tea, peach, brownish apples, caramel, linoleum, plum wine, oak, nuts, dry raisins, juniper berries.",
            "finish": "Mid-length finish. Nuts, juniper berries, plums, oak, peach wine gums."
        },
        {
            "user_name": "Marko_I",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "25 mar 2016 1:00 am",
            "content": "If you like it strong and not too filigree or complex needs and is on sherry whisky, that is the price breakers with 37 € / liter. However, you should really get along with the strength and not dilute it too much, otherwise it will be boring and boring.",
            "nose": "tart sweetness, brown sugar, burnt match, I also understand Albaron's flesh, tobacco, leather ... with watery musty dried fruit, a hint of orange and strawberry jam",
            "taste": "strong, edgy, no tongue pleasing, tart sweetness, brown sugar, tobacco and leather here too, fruit bread, molasses, pepper",
            "finish": "medium long, warm, peppery chocolate"
        },
        {
            "user_name": "ffmdino",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "10 jan 2022 5:40 pm",
            "content": "tart and more oak (of the freshly sawn type) than the Heritage CS but can also be batch-dependent",
            "nose": "Oak!! (stronger than the Heritage), mini carpet gumming, raisins, red berries, slightly herbs, becomes tart with water: rubber, tart, ??",
            "taste": "full, powerful with thump sweet, oak, tart, spicy, sparkling, chocolate ~ 65%, sherry (a real board; fierce / tart), slightly nutty with water: softer, very tart !!, lots of oak !!",
            "finish": "long very tart, some chocolate ~ 70-80%, very dark sugar, oak with water: minimally nutty"
        },
        {
            "user_name": "Drochaid",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "14 apr 2012 8:21 pm",
            "content": "with massive notes of chocolate, fruit oils, nutmeg, caramel, stewed fruits,simmering spices, dark brown sugar, leather, wax and very thick notes of clean, vibrant sherry. A consistently wonderful bottling that shows Glenfarclas in all its youthful, naked glory.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Issie",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "03 jan 2022 10:52 am",
            "content": "20.08.2021",
            "nose": "Some cardboard, some earth, it has definitely seen a bit of sherry, a few dark dried fruits, some wild berry jam, plum jam with a little cinnamon, alcohol is clearly noticeable, it could also have a tiny bit of smoke, wood After the first sip, I would say, yes, there is a little smoke",
            "taste": "Forest berry jam, caramel, then it gets really spicy with a lot of pepper, a little bit of wood and a very light ash finish",
            "finish": ""
        },
        {
            "user_name": "_Dziki_",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "24 dec 2022 6:36 pm",
            "content": "",
            "nose": "Very pleasant smell, cherry jelly, wax, sweetness.",
            "taste": "The apple pie comes to the fore - still warm, you can feel the sherry, the taste is not complex but intense.",
            "finish": "Medium long, uncomplicated finish"
        },
        {
            "user_name": "JoshNRW",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "21 sep 2023 11:54 pm",
            "content": "One of the greatest classics on the whisky market with an unbeatable PLV. Serge gave the last two batches of 22 and 23 solid 87 and 88 points. Personally, I'm more at 86 points based on personal preference, but that's a matter of taste. In terms of quality, this is a benchmark for a NAS with 60 percent for 40 euros, IF you love young barrel strengths. Very clean, very pure, some orange fruit sherry, naturally rough and also astringent. Simple sherry, wood, herbal sweets and ginger cinnamon orange in the background. A good swimmer, which is of course a necessary prerequisite for enjoyment...",
            "nose": "",
            "taste": "",
            "finish": "With water!"
        },
        {
            "user_name": "Thermidor",
            "user_rank": "Connoisseur",
            "rating": "77",
            "review_date": "16 aug 2016 3:43 pm",
            "content": "I like the regular Glenfarclas range from 15 up to 40 but this one just didn't sit right with me. Harsh and alcoholic neat, and if you give it enough water to break through that, the body loses all its consistency. In my opinion this bottle just doesn't hold up very well compared to for example most A'Bunadh batches which may not be any more complex than this but their body just feels that much better.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Max70",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "06 nov 2019 10:08 am",
            "content": "It seems that the bottle code (lot) has a a big impact on the experience of the whisky. Mine, unfortunately I haven't note the bottle code, has been verary pleasant.A powerful sherry dram, not aggressive despite of the 60% and with a warm and soft final",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Albaron",
            "user_rank": "Specialist",
            "rating": "83",
            "review_date": "25 mar 2016 12:08 am",
            "content": "Sherry whisky, seems to be young, hardly to no oak only sherry, actually I like in this context more barrel influence, but the nose is quite pleasant and the finish is very good. Guess a Speysider with Sherry influence. Distille is difficult for me here.  As part of a blind tasting tasted.",
            "nose": "a little alcohol, solvents, slightly meaty, sherry, raisins, some caramel and a hint of spice",
            "taste": "strong start, a lot of alcohol, the whisky also appears 'hot' and looks young. Raisins, sherry, some barreled wort",
            "finish": "The seasoning and the heat remains and also the sherry, nice and long"
        },
        {
            "user_name": "Lorion",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "17 oct 2017 11:31 pm",
            "content": "A very good whisky that I like to enjoy, but which I could also do without. 68 points!",
            "nose": "Sherry, sherry, sherry. Little Oak. You smell nuts, raisins, some pastries and all that with a slight alcohol tinge, which doesn't bother you. Water: The nuttiness is emphasized, the alcohol doesn't really take a back seat. Something sour appears.",
            "taste": "Raisins, nuts and pepper. Here the alcohol is quite heavy, even if it comes across as mild for 60%. The aftertaste is definitely on the bitter side, although the aromatic oak flavors are missing. Water: The sour note is also present on the palate, the fruitiness increases.",
            "finish": "Long, warm, nutty."
        },
        {
            "user_name": "alectron",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "11 nov 2015 10:37 am",
            "content": "Single Sample. Blind tasting, 10/2015",
            "nose": "demerara sugar, granite, dusty, faint rubber/bicycle tube, grilled meats. (86)Oddity - only once and only directlly after coming from a real Sherry monster, Glendronach 1993 cask 523, this stunk badly of swampgas sulphur & compost... could not getthe same notes again over the rest of the evening even with the same order... but it was quite an unpleasant impression / nose at that point.",
            "taste": "new sherry,  high alc noticeable, sweet, raisins. (85)",
            "finish": "some sherry, some bitter- & sour-ness next to malt sweetness & raisins again. (85)"
        },
        {
            "user_name": "DramALife",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "06 apr 2022 12:26 am",
            "content": "S 7 On average it's aged 8-10 years. It’s totally fine to serve it neat, although drops of water will help smoothen out the edges and bring out more fruit from the liquid. Quality varied across batches and I used to score this 89 a couple of years ago. [83-85] I'll get this at RRP.N 26 At first, it’s a zingy Sherry kick with a creamy base. Then gradually a vanilla fudge sweetness surfaces. Also a whiff of pine nuts behind. P 25 Sweet, fruity, and spicy on the edge. First off, a confectionary sweetness, then transit to juicy raisins. Oaky. End with a creamy mouthfeel accompanied by some menthol. F 25 Mid, fairly dry finish. Orange peel bitterness with sherried fruit. Then oak and rather peppery spices underpinned.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "drkrylov",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "13 dec 2012 11:57 am",
            "content": "",
            "nose": "Great depth, sherry. Creamy and nutty. Honey on toast, touch of smoky coffee.",
            "taste": "Silken, spicy and peppery oak. Almond, praline, hazelnut, dried peels, fruity. Touch of Armagnac.",
            "finish": "Long, peppery and nutty."
        },
        {
            "user_name": "Damek",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "07 apr 2025 6:36 pm",
            "content": "Fruit of the Orchard a lot of bitter bones very strong alcohol drinks on the nose Varnish a little artificial toffee and Tart and bitter citrus fruits and a lot of spices. 83.50/82.50/81.00 = 82.50",
            "nose": "83,50",
            "taste": "82,50",
            "finish": "81,00"
        },
        {
            "user_name": "checkpointuk",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "15 sep 2014 8:58 am",
            "content": "http://www.weinkenner.de/2014/glenfarclas-105-proof-aus-verschiedenen-jahrzehnten-33993/  Color: Old gold with amber stitch  Nose: Heavy sherry with syrupy honey and aromas of delicious orange and dark berries. Gingerbread, cinnamon and Christmas spices give the malt a lot of expressiveness. But that's far from all the nose has to offer: bread, sweet malt and caramel, herbs that poke out slightly, some smoke from a blazing log fire, nutmeg, leather and some vanilla are also included.  Taste: Powerful - creamy sweet, spicy and warming with smoky notes of chili, sherry, honey, herbs and toffee. Wood sets in and unfolds enormously. Drying to a finish, with lots of aromas of nuts, raisins, butter and plum and orange marmalade.  Finish: Very long and warming - sweet and sparkling salty with dry oak notes, dull herbs, leather and nut bread with creamy-sweet marmalade.  88 points (nose: 90 / taste: 88 / finish: 87)",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "checkpointuk",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "13 may 2013 1:21 pm",
            "content": "this one needs one drop of water",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "kikist",
            "user_rank": "Connoisseur",
            "rating": "76",
            "review_date": "25 may 2021 3:17 pm",
            "content": "-",
            "nose": "chocolate, sherry, mold, sweet, dark fruit, strawberry",
            "taste": "creamy, raisin, sweet, pepper, nutty",
            "finish": "raisin, short"
        },
        {
            "user_name": "junyvyao",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "28 jun 2025 12:38 pm",
            "content": "The first strong barrel for young people, an alcohol intake device exclusively for losers",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Kaltduscher",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "12 aug 2014 4:17 pm",
            "content": "Especially undiluted a complex and strong whisky. With each glass you discover new flavors.",
            "nose": "Without water: raisins, sherry, caramel, biscuits, leather, red berries, ripe plums, apples. The strong alcohol content is not noticed.  With water: The sherry notes increase, the whisky becomes fruity with lemon and orange peel.",
            "taste": "Without water: very complex. Sweet and fruity with chocolate. Then getting sharper with ginger and chilli.  With water: A true sherry explosion after a sweet start. Malty.",
            "finish": "Without water: powerful and long. Oak flavors combine with orange, candied nuts and malt. Dry becomes bitter notes appear, grapefruit can be seen. After a few minutes taste of fruit tobacco, plums and pears.  With water: dark chocolate, malt, oak."
        },
        {
            "user_name": "LukeFive",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "31 oct 2013 1:24 am",
            "content": "One of the superheroes from whisky world.And this one pack a PUNCH. Most definitely this one benefits from water but if you hardcore and know your palet SUPER well then go on take this neat.This one is designed to appreciate water ( try filtered water or basically good quality water with this, she deserve that ) . 10 years old cask strength guys..like it or hate it you got excellent value for money. dilute this right you get 1 liter+ of very good whisky. This is the biggest strength of this whisky.Obviously it is Glenfarclas one of very few privately owned distilleries. Just this alone gets extra point. this guys keeps tradition going and we are rewarded with very fine whisky.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "gallfux",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "13 feb 2019 10:59 pm",
            "content": "I think that's not bad. He has such beautiful aromatic notes that I like. I could also buy a big bottle.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "MaltyMillionaire",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "19 aug 2016 5:26 am",
            "content": "Sampled this in a line up of Glenfarclas 13 (SMWS bourbon cask), 10, 12, 21, 25, 40, and the 105. It was one of the top malts in the line up. Strong, sweet sherry notes with red fruit and rich spice. A wonderful dram.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "aw-home",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "12 jul 2023 5:28 pm",
            "content": "",
            "nose": "Sherry and ripe citrus fruits with raisins, vanilla, oak and nut aromas.",
            "taste": "Sherry and citrus fruits with vanilla, oak and nut flavors.",
            "finish": "Long with nut flavors, citrus, vanilla and oak flavors."
        },
        {
            "user_name": "dercaptain",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "04 dec 2022 11:53 pm",
            "content": "Needs a few drops of water, at 60% it's too \"hot\" for me. With water he becomes more accommodating. After having a few Glenfarclas in my glass today, I would say I recognize a species relationship. In the nose I find typical Oloroso notes, subtle moisture and spice. I suspect the freshest, newest casks weren't used for this. In the mouth a sweet sherry note again the spiciness. Not a malt for beginners but definitely a nice option for connoisseurs with experience at cask strengths. Especially when you consider the price.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Dionysus",
            "user_rank": "Connoisseur",
            "rating": "75",
            "review_date": "29 apr 2015 5:54 pm",
            "content": "In the beginning very disappointing but with a few drops of water, everything comes into its own.  I think Glenfarclas is not really my thing.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Alex",
            "user_rank": "Connoisseur",
            "rating": "89",
            "review_date": "30 sep 2012 5:48 am",
            "content": "Colour: Deep peaty-gold.Nose: Complex, oaky, apples and pears, and a tempting dark toffee sweetness.Flavour: Dry and assertive, develops quickly to reveal a rich spiciness, combined with a hint of oak and sherried fruit.Finish: Amazingly smooth for the strength; wonderfully warming and with a lingering smokiness, yet very rounded.Comment: A great whisky holding all the flavours of all the Glenfarclas in one glass. Being so warming, this is the perfect Hogmanay dram. Donâ€",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Crushed_ldH",
            "user_rank": "Connoisseur",
            "rating": "79",
            "review_date": "10 feb 2024 3:33 pm",
            "content": "Sorry but this is bad whisky... By increasing the ABV distasteful notes such as sulfur seem to stand out more, and therefore in the end it's not that satisfying even despite the low price.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyBjorn83",
            "user_rank": "Expert Senior",
            "rating": "75",
            "review_date": "09 jun 2018 9:11 am",
            "content": "12-05-2017: quite an aggressive whisky which is in my opinion too high in ABV. Gave it some time to open up. Even after a drop of water, something I would never do, this one falls short for me.",
            "nose": "hint of smoke, nuts, sherry",
            "taste": "dates, prunes, pepper",
            "finish": "long, sherry, nuts"
        },
        {
            "user_name": "YD84",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "21 apr 2022 9:04 pm",
            "content": "Lots of toffee, caramel and dried fruits. Oatcakes. Almonds. Butter. A touch of tobacco, earth and leather. Sweet oranges and pears. Rich spices. A touch youthful, especially on the nose. A few drops of water opens it up nicely. Dry and peppery on the finish. Very tasty.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Whisky Hamster",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "19 mar 2021 1:41 pm",
            "content": "Batches vary, generally very good sherry bang for the buck in the 1 liter bottle. A'bunadh's little brother in a sense. Generally bottled w/o age statements, only if warehouse stock allows it, age temporarily and discretely upped to 10 yo (see back label of those bottles). No up in quality with age statement however, not worth the hunt or extra money.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Whisky Hamster",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "06 aug 2016 2:54 pm",
            "content": "Just to clarify whether the 105 is nas or not, hear what Mr. Glenfarclas, George Grant, said about it when I asked him in an email 12/2014:\"105 was labelled as a 10yo from 2009 till early 2014.\"Meaning two things:1.) Since early/mid 2014 the 105 is NAS again as it has been before (special bottlings aside). You might still find/found some old 10yo bottlings on retail shelves, though.2.) They could not/did not want to guarantee 10yo malt being used anymore. If it is now slightly or significantly younger or a mix of younger and older malts is anyone's guess, but since they did not guarantee the age the years before, either, it's not necessarily that bad of news.Maybe some day Glenfarclas will (quietly) introduce an age statement again, if they feel fit. 2009 they sure did not make much fuss about it and imho it was more word of mouth as few people discovered the almost hidden 10 in the background of the back label... ;-)",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "claymore84",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "10 apr 2020 2:25 pm",
            "content": "Tasted on a hiking trip in the woods on 04-10-2020.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "p4blo",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "28 dec 2014 10:55 pm",
            "content": "Very decent whisky at an amazing price, perfect combo for everyday drinking as well as celebrating at more special occasions.",
            "nose": "Big, powerful sherry. Raisins, prunes and loads of cocoa beans and caramel.",
            "taste": "Cherries, figs, sultanas, some orange notes and plenty of dark chocolate, toffee fudge, a hint of oak. Very easy-going despite the high alcohol percentage.",
            "finish": "Medium long, mouthwarming with coffee, chocolate and wood."
        }
    ]
}