{
    "info": {
        "ws_name": "Deanston 18-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Deanston",
        "ws_age": 18,
        "ws_abv": 46.3,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/6/8/563/109838-normal.png",
        "ws_rating": 85.55,
        "ws_vote_cnt": 544,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/68563/deanston-18-year-old"
    },
    "collected_count": 52,
    "reviews": [
        {
            "user_name": "LukasJakubDrabek",
            "user_rank": "Shoplink Moderator",
            "rating": null,
            "review_date": "14 apr 2020 12:12 pm",
            "content": "Ralfy review 821: https://www.youtube.com/watch?v=8ueZnfCtRYE (87/100).\"This is really an arrival style of single malt. Most of what's happening is happening in the arrival. Prolonged arrival, shorter development.\"",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Dre73",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "20 jan 2018 10:34 pm",
            "content": "",
            "nose": "Orange, honey, mango. Grassy, ​​hay. Citrus, and what Dreft.",
            "taste": "Very light pepper, sweet, honey, little chocolate, hint of caramel",
            "finish": "Light peppers, sweet, honey. Mid-length. Milk chocolate, a little caramel"
        },
        {
            "user_name": "maltaholic",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "24 jul 2020 1:26 am",
            "content": "Nice, woody aroma.  Purebred.  Without a lot of frills.  A light sweetness, some vanilla.  Something stinging in the nose.  First mild and creamy on the tongue,  then a bit bitter.  Spicy, malty, woody.  Yes, you can drink it well.  But he's far from being as expressive as his 2 year older brother ...",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Andytka3",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "07 dec 2016 3:58 am",
            "content": "N- Vanilla, damp wood. Honey and green apple with whiff of floral. Water drawn out ginger and fresh cut red chili. P- Rich vanilla and honey sweet with hot ginger, tart citrus peels.  F- Long, with chilli spicy going on and on. — at The Whisky Bar, Kuala Lumpur.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "30 nov 2021 5:33 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2021/11/27/scottish-drive-by-2021-part-6-6-swaggers-in-campbeltown/N: Contemporary style, the best bits of,…T: Same again. Beautifully crafted single malt whisky.F: Oak sherry bourbon spirit,…. all blending so well.C: A solid all-round go-to.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "30 nov 2021 5:25 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2021/11/27/scottish-drive-by-2021-part-6-6-swaggers-in-campbeltown/N: Contemporary style, the best bits of,…T: Same again. Beautifully crafted single malt whisky.F: Oak sherry bourbon spirit,…. all blending so well.C: A solid all-round go-to.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "27 nov 2021 7:54 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2021/11/27/scottish-drive-by-2021-part-6-6-swaggers-in-campbeltown/N: Contemporary style, the best bits of,…T: Same again. Beautifully crafted single malt whisky.F: Oak sherry bourbon spirit,…. all blending so well.C: A solid all round go-to.Scores 87 points",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "04 apr 2019 1:37 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2019/04/03/whiskylive-2019-day-1-part-2/After TBWC stand, I’d no specific plans. Brian Houston from Deanston catches my eye so I decide to refresh my memory of Deanston’s new-found excellence after a distillery visit there in 2017 [blog].C: The 18yo shares a similar pleasing profile to the 12yo with something lost & something gained – plenty gained actually. Both crackers!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "19 sep 2016 1:19 am",
            "content": "Deanston is owned by Burn Stewart distillers which in turn is owned by South African company, Distell. Distill’s home brands include it’s ‘Three Ships’ single malt and ‘Bains’ grain. Back in Scotland, [Distell’s] Burn Stewart’s leading blended Scotch is Black Bottle & Scottish Leader whilst Scottish distilleries in their portfolio include Bunnahabhain and Tobermory. Deanston of late has had some serious re-investment including the opening of a visitors centre in 2012. Furthermore their core range currently [2016] consists of singe malts and vintages, bottled non-chill filtered at 46.3% with age statements - so on paper they are showing serious intent. Whilst the NAS WB showed more the distillate, let’s see what decent maturation can do to the spirit. This 18yo has seen 16 years in bourbon before being finished [or re-racked] for 2 years in oloroso.N: Mushroomy malt [from the cask surely], leathery too with smelly socks accompanying - but that'll subside as the whisky opens up.T: Theres a touch of jam [from the oloroso I would have thought], and that finish has proved valuable. Underlying and representing those first 16 years however is that bourbon-oak-fungal which is rather fine.F: Bring on head nodding and some ‘dad noises’. Nutty, malty tannins permeate the palate for a long finish with that fungal oak there to the last.C: Meant to go back and try it again later in the day. Will visit this a bit later on in the year. On first impressions I think this is fab.Scores a BA revisit came sooner than i thought, just two weeks later.N: Consolidated nose [Glengoyne like]. The sherry no doubt has had a significant influence in tying it all together.T: Lots of sherry at first but its the 16 years of bourbon that make all the headlines.F: Yet, ‘stop press’ - the finish is worth a line or two also. Bubblegum [from the bourbon no doubt] into creamy cream moving to white chocolate caramac.C: Whatever we thought of past bottlings in the late 1900’s [doesn’t that sound archaic?], in 2016 Deanston is darn decent.Scores a B[-]",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "markjedi1",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "11 jun 2016 2:31 pm",
            "content": "MangoDeanston used to be a cotton factory until 1966. Until 1971 they put Old Bannockburn on their label. Only after the distillery was taken over by Invergordon, in 1972, did they change it to Deanston. In 1982 it was closed, but in 1990 Burn Stewart Distillers Ltd gave it a second lease on life. Only 15% of the production is meant for single malt, the rest goes into blends with Scottish Leader as the main one. These single malt release – Bourbon Cask Finish – was launched in 2015. It matured on ex-bourbon casks and then got a finish on first fill casks from Kentucky.On the nose, I get mildly burnt sugar (not quite caramel) with of sugared almonds and coconut. Quite some honey. The whole is a bit dusty, like sitting in the attic. Sunflower oil, hint of café latte. The fruit is kept under wraps for a long time, but finally some papaya and mostly mango reveal themselves. Not unpleasant. The arrival is soft, mildly spicy with a bit bitter note. Grapefruit, orange zest, ginger and a hint of chocolate. Mango juice. Toasted bread. Breakfast cereals. All of this drenched in honey.Fairly long finish on orange peel and ginger.This is almost complex. But just a tad too bitter to be very good. Around 100 EUR.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "dRambo",
            "user_rank": "Connoisseur",
            "rating": "74",
            "review_date": "11 feb 2018 1:34 am",
            "content": "The nose develops from disgusting smelly to not so delicious smelling, and then at - \"more than a dram nobody needs\" ends;) taste is ok, but not my thing. Had problems to empty the dram. Thanks Community I only had to buy 2cl - would always prefer the 12er.",
            "nose": "Immediately after pouring in, I get a touch of milky acid baby puke. with some time in the glass - honey, metallic bitterness, graphite dust - nutty, oily, earthy, clarified butter, raisins, malt",
            "taste": "sparkling oak with lemon, lemon zest, ginger and mint, slightly mineral, slightly bitter - increasingly dry",
            "finish": "The beautiful fruity taste components disappear first - what remains is edgy, malty, tannic spicy, mineral and slightly alcoholic burning bitter. - that lasts long on the tongue"
        },
        {
            "user_name": "Totoro",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "03 sep 2020 3:51 pm",
            "content": "A very \"dark\" ex-bourbon maturation: don't expect much in the way of fruitiness or vanilla. Instead, it's full of charcoal, dark roast aromas, and oily \"workshop\" associations (wood, metals, grease, grime).An all-bourbon number for European-oak sherry fans?A winter whisky from first-fill barrels?Certainly an interesting and idiosyncratic bottling.",
            "nose": "Nice balance of oak and spirit. You really get the sense that this is Deanston, with all these greasy, grimy, dark \"boiler-room\" aromas on full display. Very thick and weighty, and the (seemingly freshly charred) first-fill bourbon barrels used in for finishing add lots of sweet, woody, resiny goodness. Not very fruity, to be sure: at most, I can talk myself into some ripe pineapple and sweet orange. Other than that, it's all on stout, fudge, malt and dark-roast coffee.",
            "taste": "Definitely wouldn't have needed more than 46 percent – it even benefits from a generous splash of water as it is. Nicely sweet and dark attack (salted caramel ice cream, dark chocolate and licorice), followed by a wave of sweet orange juice and an impressive spice spike (a bit peppery/gingery, but not uncomfortably so). Goes out spicy and charcoal-y, with plenty of roast notes.",
            "finish": "Dark and oaky again, with caramel, chocolate, and ripe orange, but also a curious fizziness that lets it lose a few points in my estimation."
        },
        {
            "user_name": "Totoro",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "19 may 2019 6:03 pm",
            "content": "A subdued and unostentatious all-Bourbon 18 y.o. More on the spicy and weighty side than on the light and fruity one. Plenty of thick, caramelly roast and/or burnt notes (lots of barrel char, I'd wager). The darker side of ex-Bourbon maturation, if you will. No faults or off notes, but also nothing that makes it especially stand out. In comparison, the 12-year-old is more lively and more impressive. However, if you like your malts dark, earthy and spicy, and want a change from the sherried stuff, this is worth your attention. I like it, but I'd still rather buy two bottles of Glen Scotia 15 than one of this - for pretty much the same price.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "LeChiffre",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "06 jan 2019 4:32 pm",
            "content": "Overall good bourbon barrel aged malt. But ultimately there is a lack of more complexity for a higher score.",
            "nose": "malty-sweet; Hay; fruity; Caramel; Heather honey; Herbs; behind it some oak",
            "taste": "malty-sweet; fruity; spicy; Vanilla; a bit nutty",
            "finish": "spicy; increasingly slightly bitter; a malty character remains; Oak comes out more and more"
        },
        {
            "user_name": "dramspotter",
            "user_rank": "Connoisseur",
            "rating": "76",
            "review_date": "21 mar 2019 12:29 am",
            "content": "Blind tasting.",
            "nose": "figs, fruity, aniseed, leather",
            "taste": "aniseed, orange peel",
            "finish": ""
        },
        {
            "user_name": "pianoman",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "20 oct 2016 9:02 pm",
            "content": "",
            "nose": "First sand and some sulfur, then fruity and flowery. Yellow apples, unripe banana. Some honey and fresh sawdust.",
            "taste": "Malt beer, apples, cornflakes, chestnuts. Slightly bitter spiciness.",
            "finish": ""
        },
        {
            "user_name": "schengel10",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "11 mar 2019 7:51 am",
            "content": "A serious and good highland malt!  [Color gold;",
            "nose": "pleasant vanilla, caramel, floral, sweet, woody aromas;",
            "taste": "very powerful start; fruity like a fruit-maker (apples and pears); Fudge, toffee, not very complex;",
            "finish": "medium-length strong intense finish; something oak sounds;"
        },
        {
            "user_name": "valasios",
            "user_rank": "Connoisseur",
            "rating": "89",
            "review_date": "15 jan 2022 1:46 pm",
            "content": "Old School Whisky.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Allandale",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "16 dec 2016 2:18 pm",
            "content": "Matured on second and third fill hogshead, finished on first fill bourbon barrels.  A lovely good Deanston.",
            "nose": "Malty character, with honey, tropical fruit and vanille. Very present milk chocolate . Nice sweet.",
            "taste": "Full and complex, honey and spicy on the top.",
            "finish": "Long, between sweet and spicy, again the milk chocolate .Lovely sweet character."
        },
        {
            "user_name": "Tangtang_WhiskyYoda",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "14 feb 2022 3:58 am",
            "content": "Notes from a blind tasting",
            "nose": "light fruits, herbs, floral notes, honey, nuts, some malt and light grain notes. The alcohol seems well integrated",
            "taste": "slightly sweet start. Lots of light fruits, floral notes, herbs, some honey. Again, light malt and grain notes",
            "finish": "sweet and a bit nutty with light fruits, rather short, some milk chocolate resonates"
        },
        {
            "user_name": "Rosebank88",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "08 feb 2024 2:15 pm",
            "content": "",
            "nose": "On the one hand malty, on the other hand ripe and caramelly. Gooseberry tart, some chocolate, nut oil, gains apple-toned sweetness, oak and cocktail cherries. Very nicely balanced. With water: oily, nutty, malt, oak, dried apples, nut oil.",
            "taste": "Spicy backbone of oak, leather and tannier. Then follow pepper, allspice, malt sugar, nuts and linseed. With water: Oily, nutty, lots of malt sugar, linseed and spices.",
            "finish": "Long, spicy, malt sugar, oak and nuts."
        },
        {
            "user_name": "Saftkenner",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "03 oct 2022 3:57 pm",
            "content": "A nice bottling with a nice drinking strength, also with rough edges. I particularly like it on the palate. According to the notes, there seem to be clear differences between the different batches.",
            "nose": "The nose is strong right from the start, needs a while in the glass to harmonize. She also offers a few flavors that are quite out of the ordinary in this batch. The alcohol is well integrated. Oranges, vanilla, rosemary, sage, grilled peppers, a hint of sulfur (towards the match head), toffee, quince, citrus cleaner, linoleum, fine oak spice.",
            "taste": "Powerful and peppery attack, nice oily body. Orange peel, wax, oak spice, toffee, juniper, ginger, malt, green pears, quince, peach.",
            "finish": "Mid-length finish. Malt, ginger, orange peel, oak."
        },
        {
            "user_name": "Marko_I",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "30 jul 2015 10:21 pm",
            "content": "Yummy, they've gotten damn good, well matured, full-bodied, tasty, it makes your mouth water. Only the price is howl. :-(",
            "nose": "sweet and fragrant, honey, candy, toffee, hay, meadow herbs, cereals, slightly spicy",
            "taste": "full-bodied, fat sweet and spicy, honey, candy, toffee, gingerbread - nutmeg, cardamom, orange peel, chocolate",
            "finish": "long, dry, bittersweet and spicy, slightly peppery"
        },
        {
            "user_name": "ffmdino",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "16 sep 2017 6:39 pm",
            "content": "a solid malt, I miss the kick",
            "nose": "dark, slightly metallic note, lemon, malt and sweetness, later vanilla, slightly oak, nail polish, nut (hazel or whale)",
            "taste": "soft and oily on the palate, peach, wood, sweet, slightly caramel, malt will intensiever with time, the alcohol is well bonded, moist cardboard",
            "finish": "medium long, warm, sherry, bitter"
        },
        {
            "user_name": "glen efze",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "04 mar 2022 2:46 pm",
            "content": "Deanston is not a spectacular distillery, it is located a little above Stirling in the Highlands, which you actually only want to take seriously after Perth. It is about the same distance from both coasts. Centuries of tradition? Textile factory converted in 1965. That sounds boring, which might not be a bad thing if it keeps the distillery from the hype. This whisky is 18 years old, it is still the old bottling before the design change. Non chill filtered, hopefully not colored, matured in refill bourbon casks, finished in 1st fill bourbon. That sounds like ... - no, just try it. www.glen-efze.de",
            "nose": "On the nose, the whisky is not intrusive but self-confident. There are fruits, there is powdered sugar, strong vanilla and then it doesn't get sweet and boring, but there is a fresh, sour fruit note of almost ripe greengage, which gives the whisky a pep. The 18 years are not presented by old wood or mustiness, but by yellow fruits and vanilla. And the pears here are ripe and juicy with enough acidity and strength. Since no one misses any raggedy sherry that was previously swung through the barrels.",
            "taste": "And that's how it tastes. The whisky is mature, round and anything but boring. No old wood, but strong vanilla, which joins a beautiful fruit cocktail with ripe apples and pears and a good portion of deep red raspberries and then the wood aromas come, giving strength and depth. There are red winegums (I know, they show up a lot - but I have a soft spot for Bassett's winegums, which aren't that squeaky sweet and over-flavored...) with sufficient acidity, which have been air-conditioned for some time on good oak planks. With 46.3% vol. Burn Stewart standard strength, the whisky has just the right drinking strength for the aromas to unfold.",
            "finish": "A nice finish with vanilla, pleasant oak and hints of ripe fruit and ripe red berries. A two year older Denaston with Oloroso finish totally let me down, it was sulphurous, overpriced and not fun. This Deanston is the complete opposite: it's delicious, still available for half the price of the sulphur, and definitely delicious. Boredom? Not a second! We're always panting for the darkest, most mature whisky, drinking our way through copious amounts of acrid sulfur whiskys or hyper whiskys that taste like the sweet cough syrups of our childhoods. We rightly hated them back then, what's going on? This Deanston offers beautiful aromas, good maturity, decent oak, has enough complexity to smell and taste, is easy to drink and can still be financed at 18 in 2022. Thumbs up!"
        },
        {
            "user_name": "Rowald Sweet Empire",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "11 may 2017 4:54 pm",
            "content": "Not as powerful as their sherried drams but still very good. This one has a very flavoursome toasted barley/bourbon vibe. Candy for grown-ups. Caramel. Chocolate. And a little dirty edge. Deanston is on top of things.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Lorion",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "13 sep 2022 3:17 pm",
            "content": "A strong palate, the nose gives me less. 82 points.",
            "nose": "Oak accented, spicy. Behind it vanilla and some tart honey",
            "taste": "Forest honey, a clearer vanilla note. Full, warm.",
            "finish": "Medium length with fine oak notes."
        },
        {
            "user_name": "DramALife",
            "user_rank": "Connoisseur",
            "rating": "68",
            "review_date": "08 feb 2022 1:26 pm",
            "content": "S 4 Unpleasant nose: Flavours are masked by oilN 19 OilyHoney Citrusy Floral at the back P 21 Vanilla Mildly peated Orchard fruit Citrusy remains at the back Malty F 20 Mid-short finish Oak spice, malty barley notes lingering Mildly minty",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Klexx",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "25 aug 2023 8:15 pm",
            "content": "",
            "nose": "Cocoa, mealy red apple, very slight sulfur, perhaps overripe apple, malt, a little vanilla",
            "taste": "Sweet, tasty, orange, clove, chocolate, caramel, malt, like a candy with herbs, obf",
            "finish": "Deliciously fruity, malty, gentle oak for 18, medium length"
        },
        {
            "user_name": "spigray",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "17 may 2017 12:34 pm",
            "content": "quite good on the palate and in the finish. the nose is ok but not overwhelming. takes drops of water but don´t overdo it!85/100",
            "nose": "initially spirity and oaky, hope that changes. rather dark profile with dust and earth, malt, brazil nuts, graphite. noses creamy (I know that sounds stupid).but in fact there´s some whiffs of cream and caramel and perhaps some white chocolate",
            "taste": "not as creamy as expected, malt, caramels, chocolate. the second sip was really good and very harmonious. like a praline. as for spices we have cocoa, allspice, pepper and traces of cinnamon.",
            "finish": "long, malty and chocolaty."
        },
        {
            "user_name": "domani",
            "user_rank": "Connoisseur",
            "rating": "89",
            "review_date": "03 jul 2021 8:04 pm",
            "content": "No fruit bomb, no potpourri, but mineral and earthy and with an intense sweetness. I like the character of Deanston - 7/3/2021",
            "nose": "Slightly fruity at the beginning, orange, orange oil, becomes increasingly mineral and earthy over time, cereals, some vanilla and toffee, brown sugar, shortbread",
            "taste": "Very sweet, brown sugar, becomes slightly sour in the meantime, sourdough, fresh ginger, orange, very oily, roasted aromas, toffee, chocolate, chocolate muesli, grain, malt sweetness, forest honey",
            "finish": "Medium length, sweet and sour, orange peel, malt candy"
        },
        {
            "user_name": "Koning",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "17 oct 2023 2:55 pm",
            "content": "A solid albeit not spectacular 18 year old. Its depth and versatility are a plus.",
            "nose": "Starts with flowers and fresh laundry, with apples and vanilla on the background. Then more earthy and dusty tones appear, complemented by coffee, caramel cookies and muesli.",
            "taste": "A rich fruitiness pairs with fennel and ginger and darker tones of coffee, chocolate and cloves. A fresh youthfulness is balanced by deeper more mature tones, the latter prevailing ultimately.",
            "finish": "Citrus fruits, peaches and pineapple are joined by various spices and honey. Lingers quite long with tobacco on the background."
        },
        {
            "user_name": "dercaptain",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "06 dec 2022 3:53 pm",
            "content": "A lot of fruit, sweet .. a thick fruit basket",
            "nose": "red mealy apple, ripe plums, mango, lots of fruit. In addition, a nice woodiness and vanilla. Smells very harmonious, fruity.",
            "taste": "The fruitiness in the mouth hits the nose again, I have very rarely had whiskys that transport so much fruit aromas. Here, too, the fruits interact almost perfectly with the wood. And here, too, a vanilla or light caramel note resonates. Nice mouth filling feeling.",
            "finish": "The fruitiness lasts a long time. But it doesn't really matter because you immediately feel like taking the next sip"
        },
        {
            "user_name": "Monte Gehro",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "04 feb 2022 8:32 pm",
            "content": "Notes from a blind tasting. Quite simply kept, clean in its aromas and no off notes. Harmonious, balanced and pleasing, but without shining with special features. I remember a Glenlivet 12y Illicit Stills more intensely.",
            "nose": "Restrained and calm, very well integrated alcohol, not stinging in the nose here. Light fruits with some cooked apples, pears, peaches, light vanilla. I also think I smell something nutty. Hints of oak spice in the background.",
            "taste": "Mild and pleasant. Honey, caramel, light fruits again, only subtle oak spice comes out.",
            "finish": "Medium long, sweet with fruit and some honey, becomes dry and slightly spicy on the tongue, medium intensity here as well."
        },
        {
            "user_name": "Goethe",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "14 apr 2016 9:59 pm",
            "content": "Concerning price/performance ratio: 6/10 (2016)",
            "nose": "Caramel, fruits, citrus, a touch of vanilla, pears.",
            "taste": "Fruits, spices, hints of spirit, pears, green apples.",
            "finish": "Medium. Caramel and a touch of oak."
        },
        {
            "user_name": "craide",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "16 apr 2019 9:54 pm",
            "content": "Actually a very nice malt. But at the price there is much that is much better.  I liked it so much. But again I do not need that.  Too bad, the 8y Bordeaux Cask was very good.",
            "nose": "Relatively gentle start. From time to time slight metallic stinging in the nose,  Already strange ... then vanilla, caramel and behind it some forest honey, hay with a light citrus note.",
            "taste": "Beautiful slightly spicy oak with a little bit of lemon quickly turns into light bitterness. Behind it some malt green apple. Taste better than in the nose.",
            "finish": "Middle run finish, it remains slight bitterness and malt. Spicy oak remains"
        },
        {
            "user_name": "LordBellamy",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "02 aug 2015 7:37 pm",
            "content": "Nose: barley, malt, porridge with honey, subtle sherry notes, marzipan, rose water, oak  Taste: grain, malt, only subtle sweetness / honey  Finish: medium length, barley, sherry, marzipan, honey, oak, light spice, barely dry  Water brings nothing new - 80 points",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Crushed_ldH",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "06 apr 2024 3:08 pm",
            "content": "Not spectacular yet quite decent and delicious dram. It has less bourbon-y nuance than its younger 12-year-old, and the ex-bourbon cask influences like meadows and fruitiness are emphasized.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Martin1965",
            "user_rank": "Expert Senior",
            "rating": "91",
            "review_date": "05 mar 2019 3:56 pm",
            "content": "",
            "nose": "Citrus, honey, vanilla, oak, hay and apple",
            "taste": "Sweet, oak, honey, vanilla, peppermint",
            "finish": "Long with oak  Much more complex than the 12er - also a must have, one can only recommend"
        },
        {
            "user_name": "HunterRomario",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "16 nov 2021 1:05 pm",
            "content": "Alcohol: 46.3% Aroma: Full of fruit, baked apples, pears, toffifee. Above that, cinnamon, a new spice. Rich, warm, calm. (87 b) Taste: Sweet honey wood, floral-fruity line, oak in the aftertaste. (85 b) Points: 86/100 Summary: Tasted at the Whisky Festival 2021 in Malá Morávka. Classics. Good whisky, nothing more, nothing less.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "George_Martin2",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "24 aug 2022 3:16 pm",
            "content": "A very mild, smooth and drinkable whisky that makes me wonder where the alcohol is? I really liked it and it is definitely one that I will buy again.",
            "nose": "Sweet, fruity and mild is my first thought. But then I still find light fruits like apple and pear, in combination with honey and wax. Yes, why not beeswax? I find it malty and citrusy aromas follow and, together with the wax, convey a citrus-scented candle.",
            "taste": "A dry, waxy sweetness with canned peaches conveys associations to fresh punch. Spearmint and menthol notes as well as chewing gum paint an interesting picture.",
            "finish": "Is he mild! Fresh and menthol dry. I have champagne or dry sparkling wine and at the very end a tart chicory farewell."
        },
        {
            "user_name": "molpet",
            "user_rank": "Expert Senior",
            "rating": "90",
            "review_date": "25 apr 2022 7:57 pm",
            "content": "An intelligent use of first fill and refill bourbon casks. A delightfull old school 18y bourbon matured single malt Scotch whisky for more than a fair price (if we are talking about 85-90 Euro). Sweet, malty, voluminous with significant oak presence. I am considering a rebuy...",
            "nose": "Vanilla, malt, honey sweetness, yellow apple. Quite intense.",
            "taste": "An explosion of flavors. The same as on the nose + spicy, slightly bitter oak. Very nice!",
            "finish": "Medium to long."
        },
        {
            "user_name": "Whisky Hamster",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "10 mar 2021 7:07 pm",
            "content": "Looking at the average score I realize it is not just me who is a kind of baffled by the recent Deanston hype. Maybe it's the younger bottlings? Still have to try the 12 yo. But this one, albeit bottled at a good strength, does not amaze me. Pretty alright Highland malt, not all notes are pleasant, a bit meaty at times. Oh, well...",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "claymore84",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "26 jun 2020 5:50 pm",
            "content": "Tasted on 06-26-2020 in Oberstaufen.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "claymore84",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "22 may 2020 11:34 pm",
            "content": "Tasted on 05-22-2020 at a blind tasting with Whisky Jason.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "p4blo",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "28 sep 2016 1:03 am",
            "content": "18 years, you could expect much more from a whisky of such age. Not this time.",
            "nose": "Resembles the Virgin Oak expression a lot with a slight note of chemicals (paint thinner, varnish), greener notes of plant stems, some sugar, vanilla, apple, pear, green tea and gooseberry. Richer and drinkable, but far from impressive.",
            "taste": "Cheesecake, a slight hint of chocolate, honey and some tropical fruits. Not very pronounced, quite shy, but maybe it's for the best here.",
            "finish": "Quite long on biscuits and heavy oak influence with tons of spices and a slight bitterness."
        },
        {
            "user_name": "Shane_IL",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "26 feb 2016 3:46 pm",
            "content": "A delicious and complex dram. Really loved the honey nut crunch note in the taste.",
            "nose": "Honey in honeycomb. Light wood. Quite malty despite its age, porridge and marzipan. Sweetened nuts. Caramel toffee. Bit of a creamy not. Coffee with milk. There's a bourbony fruit note present but quite hidden. With time a fairly powerful woodspice note shows up and the fruits develop more, papaya, coconut, lychee and mango peel. I know there's no reason for it, but I'm also picking up a slightly winey note on this.",
            "taste": "Kellogg's honey nut crunch. Bitter wood. Juicy pineapples and papaya. Orange peel. Chocolate. Woodspice. Hints of ginger snaps.",
            "finish": "Long. Bitter orange peel and woodspice and ginger right after the swallow, some malted milk and tropical fruit follows up."
        },
        {
            "user_name": "etwa77",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "02 apr 2021 10:51 pm",
            "content": "This 18 yo Deanston is evoking the Old Pulteney of the same age, minus the sea salt.. plus a touch of the herbal funk that has made me quite fond of this distillery. Very nice, drinking whisky.. not necessarily a daily sipper, but a friendly, drinkable week end compagnion.. the vanilla on the nose is almost warm and very inviting, followed by fresh apples, thyme honey and perfumed flowers. A velvety kick in the taste buds, at once spicy and delicate.. a little sweet and a little dry.. not complex, but tasty.. milk chocolate over crispy cereals tasty. Not much of a finish, but who needs a finish, when you got a bottle?",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "captain_k",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "14 may 2018 9:57 pm",
            "content": "I think this drop is better than described by some here: a nice drifty daily dram. Meanwhile, sometimes as an offer for a reasonable price (about 65-75 €) to get.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "riegerjonas",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "03 jun 2021 6:31 pm",
            "content": "2021-06-03",
            "nose": "Wax, honey, oak barrel directly present, sweet-chocolatey, fruity-floral, apple, (pineapple), mirabelle plums",
            "taste": "intense old vanilla, minimally spicy, gentle dram, (milk) chocolate",
            "finish": "gentle and ordinary"
        },
        {
            "user_name": "Petitcham",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "01 feb 2023 3:40 pm",
            "content": "Soft and safe, a little oily, bubble gum, western pears",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Mascht",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "09 oct 2016 11:25 am",
            "content": "",
            "nose": "Iodine, light, fleeting, flowery, slightly maritime",
            "taste": "round, oily, European oak, bitter orange",
            "finish": "Long"
        }
    ]
}