{
    "info": {
        "ws_name": "Balvenie 12-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Balvenie",
        "ws_age": 12,
        "ws_abv": 47.8,
        "ws_image": null,
        "ws_rating": 85.47,
        "ws_vote_cnt": 51,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/82142/balvenie-12-year-old"
    },
    "collected_count": 10,
    "reviews": [
        {
            "user_name": "rottendon",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "09 may 2016 8:41 am",
            "content": "Beautifully harmonious like most Balvenies, well balanced and yet quite complex in this case. If you give him time, he can be quite surprising.",
            "nose": "Apples, bananas, coconut, marzipan and a hint of smoke. After a while, it becomes even fuller and more fruity, with the fruits towards peach, apricot and dried fruit. Very late, there are also a few herbs.",
            "taste": "Very sweet and wonderfully balanced with slow but steady power development. Here are all the aromas from the nose again, but the focus is on marzipan and honey, the fruits are only hinted at. In the end, a very round oak note develops, which points to anise with a slight bitterness.",
            "finish": "He also walks on the oak tree, allowing himself some time until the end, leaving a nutty memory on his tongue."
        },
        {
            "user_name": "DrunkDude",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "07 jul 2020 4:39 am",
            "content": "Very exceptional whisky at this price range.",
            "nose": "Smell: pure honey, floral scent, plums, a little vanilla",
            "taste": "Taste: full of sea salt-flavored floral fragrance, sweetened by honey, sweetness can not be compared to its smell, but focus on setting off its delicate floral fresh and salty.",
            "finish": "Finish: soft and mellow sea salt chocolate cocoa flavor."
        },
        {
            "user_name": "manspear",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "22 oct 2024 2:28 pm",
            "content": "Not too bad, bourbon cask texture fully appears.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "The_Osprey",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "14 aug 2022 9:48 pm",
            "content": "The Balvenie 12 year old single barrel first fill SMSW 47.8%. No details of barrel no etc.30ml sample at home, July 2022.Nice natural looking pale yellow. Aroma is surprisingly youthful. Green apple, peardrop sweets, chardonnay spritzer. A leafy note - maybe the faintest hint of spring onion, but infrequent and faint. A lot more youthful than the age statement would have suggested. Blind I'd have guessed this is something from one of the new kids on the block. Body is fairly watery. Taste is easy on impact, pale biscuits and vanilla, soft oak, again it tastes young, little maturation influence, this is all about the spirit. White pepper on the finish. A little gluey if you drink it too quickly and a bitterness builds. It suits a relaxed approach. This took me by surprise. Very different to what I’d expected. I feel like I’ve now been exposed to all sides to Balvenie through their official bottlings. It’s tricky to pinpoint the USP/character to expect from this distillery - I feel like it changes with every release. Peated. Unpeated. Young. Old. Oak-led. Spirit-led. Fruity. Biscuity. Sherried. Ex-bourbon-led. I’ve enjoyed all or most of them for different reasons, but it's been a total scattergraph of experiences.This particular bottling would be a nice 'start of the evening' dram with a surprisingly immature fruity character reminiscent of Lindores Abbey and Nc'Nean on the nose, but with a less interesting palate than those comparators. Good though, once you've adjusted to it. 3.5/84",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Dramned!",
            "user_rank": "Expert Senior",
            "rating": "90",
            "review_date": "27 sep 2016 12:01 pm",
            "content": "I love strong sherry whiskys, but this one shows that even in ex-bourbon barrels matured whiskys can be wonderfully complex and intense. Lots of fruit and spicy honey make this Balvenie a personal experience, but is also quite objectively a very complex and balanced whisky. I find no criticisms, he is just beautiful from start to finish!  Significantly responsible is because of course, the much higher alcohol content, which I painfully miss in so many other Balvenies. So I will continue to limit my interest in Balvenie to the strong single-barrel versions.  Complete review with photos:  < https://dramned.wordpress.com/2016/09/27/the-balvenie-12-single-barrel-478/",
            "nose": "Crisp juicy apples, pears, ripe bananas, peaches and sweet citrus fruits right from the start. The vanilla that is so typical of Balvenie is a bit more subdued here, but becomes stronger over time, with crumbly creamy butter caramel, a few nice spice shelf aromas and oak barrels. All flavors are carried by a carpet of strong alcohol.",
            "taste": "The strong alcohol content brings the aromas very strong and full-bodied to advantage, I have equal to a heavy spicy honey sweetness with a lot of vanilla and caramel and the fruit from the nose, especially juicy sweet-sour Zirusfrüchte let the saliva flow. The oak is much more dominant here and brings a nice harsh wood character. Then some roasted nuts and I mean to catch some maritime notes.",
            "finish": "In a really long finish this Balvenie offers fresh hay and spicy heather. A caramel sweetness of the fruit and a hint of licorice remain for a long time to hang."
        },
        {
            "user_name": "jvanopstal",
            "user_rank": "Expert Senior",
            "rating": "77",
            "review_date": "06 sep 2021 10:20 am",
            "content": "A typical and nice Speyside whisky",
            "nose": "Citrus and vanilla",
            "taste": "Smooth with citrus, vanilla and some honey",
            "finish": "Medium long with vanilla"
        },
        {
            "user_name": "Soysauce_Sommelier",
            "user_rank": "Expert Junior",
            "rating": "86",
            "review_date": "20 feb 2025 8:17 am",
            "content": "Not too bad, much better version of 12 double wood. Best with Highball, good recommendation for sweet lover",
            "nose": "bit of sweet cinnamon, honey, vanilla, just baked chocolate cookie",
            "taste": "Sweet, candy, honey, watery, not deep but elegant, light oak, bourbon-like",
            "finish": "short, but much deeper and longer than 12 double wood. Best with ice or highball."
        },
        {
            "user_name": "whisky_sven",
            "user_rank": "Member Senior",
            "rating": "84",
            "review_date": "23 oct 2025 9:20 pm",
            "content": "You could almost call it the bourbon prototype. A beautiful, light yellow color. Initial citrus notes on the nose, later vanilla and a distant hint of spice. Lovely in the mouth, the alcohol is perfectly integrated.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "pvl7206953",
            "user_rank": "Member Senior",
            "rating": "89",
            "review_date": "25 sep 2023 7:34 pm",
            "content": "Very good. Pastry, cookies, apple pie, sour apple.Add water and this whisky will change.Recommend.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Vycka",
            "user_rank": "Newbie",
            "rating": "84",
            "review_date": "26 may 2020 8:50 pm",
            "content": "Nice dram to realise that bourbon casks are the most common base for most whiskies. Eventhough it is very smooth a bit of water really helps to release more aromas. Not the most complex, or hitting you with contrasting flavors whisky but has really intense, fresh, sweet, smooth flavor. Tasting notes: lots of vanilla, honey, caramel, biscuit and fresh juicy orange. Some distant notes of dried fruits. Overall very balanced and pleasant whisky.",
            "nose": "",
            "taste": "",
            "finish": ""
        }
    ]
}