{
    "info": {
        "ws_name": "Glendronach 12-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Glendronach",
        "ws_age": 12,
        "ws_abv": 43.0,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/9/0/96/353279-normal.png",
        "ws_rating": 84.09,
        "ws_vote_cnt": 3737,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/9096/glendronach-12-year-old"
    },
    "collected_count": 157,
    "reviews": [
        {
            "user_name": "lincolnimp",
            "user_rank": "Connoisseur",
            "rating": "89",
            "review_date": "08 may 2021 10:41 pm",
            "content": "Glendronach 12 year OB 1980’s v 2019 H2H(1)Glendronach 12 year 1980’s ,The Original Pure Highland Malt 40% 72371(2)Glendronach 12 year 1980’s , sherry casks,The Original Pure Highland Malt 40% 25645(3)Glendronach 12 year 2019,The Original Highland Malt 43% 9096NoseThe 1980’s (1) has more power than (2), the sherry bottle is a little distant in comparison to it’s sister bottle. The 2019 (3)is similar to (1), with the same DNA but less expressive.The clear winner here is (1) followed by (3) with the old sherried bottle (2) bringing up the rear.This smells creamy and reminds me of some old blends because there is some vanilla and lots of mango mixed with other white fruits. There is an almost industrial quality to it, like paint to be honest but it is ok and not off putting, just unusual?My initial impression is telling me that this needs water to open up, rather closed neat, there is a nice parma violet note in the mix, rose water and a little spice.Similar to (1) just not as pronounced, hints of vanilla but coming through is a juicy yellow plum note mixed with wisps of smoke, very nice.So the 1980’s original shares similar vapours with the 2019, the sherried 1980’s is more closed, being less expressive generally.The 1980’s (1) has more power than (2), the sherry bottle is a little distant in comparison to it’s sister bottle. The 2019 (3)is similar to (1), with the same DNA but less expressive.The clear winner here is (1) followed by (3) with the old sherried bottle (2) bringing up the rear.Palate-neatVery nice, on sweet candied fruit of lemon, apricot, peach and mango, lemon sherbet fizz.Slightly thin at first but way better than the nose suggested, a little cream but then a wave of fizzy sherry with a little peat and the balance is really good, tasty.There is no way this is 12 years old more like a 15/16 year old.This is a little smoother than it’s older siblings, more manufactured, engineered if that makes sense?Cream soda and a wave of sweet peat which I was not expecting, icing sugar, a little barley sugar and a lovely sweet spice notePalate (with 5 drops of water from a pipette)More lemon sherbet with a dash of water added, very good balance , still fizzy and lively.The water has brought more sweetness out, and a bubblegum noteStill sweet, with some barley sugar now and hints of lemon sorbetFinish (with water)Remaining sweet, fizzy and flavours are packed together tightly.The finish is full on lip smacking sherry, with parma violet on the tail.Similar to (1) sweet and fizzy basically.SummaryI kike the nose on (1) the best, the palate of the sherry cask 1980’s (2) is really good and a point or two infront of the others but the finish on the 2019 is a point in front of the other two older offerings.So for nose/palate/finish it looks like this :-Original 1980`s 89/88/87Original 1980’s sherry casks 86/90/87Original 2019 87/88/88A really enjoyable head to head, not much to separate them, all three were really tasty, no duffers here :)",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Slàinte Mhath",
            "user_rank": "Super Administrator",
            "rating": "87",
            "review_date": "03 aug 2019 3:12 pm",
            "content": "Pedro Ximénez cask maturation holds a certain magic that is hard to explain, and combined with some fine Oloroso butts you get a true sherry monster of a single malt! On the nose, there is a nice interplay of intense sweetness and fruity acidity with pears, melons and hints of eucalyptus. After a rich brown sugar arrival, the taste gets more aromatic and slightly dry, featuring a pleasant oak complexity. The finish of GlenDronach 12 is long, delicate and chocolaty bitter. This malt is a keeper of consistently high quality and a better choice than Macallan.RATING: 4.0/5.0 stars ≙ 87 pts → FIRST-CLASS",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Archer",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "16 jan 2018 11:56 am",
            "content": "In the nose, he can still hide his slightly one-sided character well. The nose is interesting and complex and makes you want more. On the tongue, he shows but contrary to expectations as a lightweight, watery and woody.",
            "nose": "blind tasting  Experiment - Comparability of tasting notes \"(www.fassstark.de)  1. sweetness, grain, malt, chocolate, nut, seasoning, flower, fruit. The sweetness of fruit and flower hangs heavy and creamy in the nose.  2. The fruits are red berries and grapes. The initial milk chocolate will thicken over time, as well as the maltiness, which darkens after a long time of Verriechens. Nut = hazelnuts, almonds. Initially only light spice, later increasingly. Flower is pushed into the background, crops as well. Spiced fruits (mulled wine?) Dominate.  3. A Glühweinstand on a Christmas market, in the evening, no snow, +7 degrees Celsius outside temperature.  4. heavy, red to dark",
            "taste": "1. Grain, malt, chocolate, coffee, nut, caramel, fruit, herbs, wood. Soft and light on the tongue, watery. At first barely dry, but rapidly increasing. Corky, metallic.  2. The flavors of 1. can hardly be specified, for that he is too fast on the tongue. Only so much: over time, chocolate becomes darker, herbal tart, cork taste (wood) more intense. Nut, caramel, fruit disappear quickly  3. An afternoon nap on a cork floor  4. One-sided, young",
            "finish": "1. wood, wood, wood and coffee  2. -  3. Get the stick ...  4. One-sided"
        },
        {
            "user_name": "Archer",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "08 sep 2015 7:27 pm",
            "content": "He is relatively round, the 12er. But somehow it lacks the certain something. Average malt.",
            "nose": "Sweet vanilla. Ripe red grapes. Cinnamon.",
            "taste": "Full mouthfeel. Nutty with hints of oak. Subtle fruit note.",
            "finish": "Medium long with seasoning."
        },
        {
            "user_name": "Dre73",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "05 jun 2016 11:44 am",
            "content": "Whisky where the sherry influences are unmistakable. Nice fruity taste with sweet notes. With a few drops of water, the whisky can be made a little firmer / pepperier if desired.  Nice finish too, great dram for this money.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Dre73",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "05 jun 2016 11:42 am",
            "content": "Whisky with obvious sherry influences. Has a full and smooth taste, after adding water it gets a more solid character and increases the length of the finish.",
            "nose": "Red fruit, raisins, honey, chocolate. Later also citrus, orange, toffee, vanilla. And a hint of hay",
            "taste": "Red fruit, honey, chocolate. Soft, full. Orange. With a few drops of water a (slight) pepperiness now comes through.",
            "finish": "Very light peppery, medium-long, honey, chocolate. With water: finish is even more peppery, and a lot longer!"
        },
        {
            "user_name": "maltaholic",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "20 oct 2016 9:01 am",
            "content": "Smells very much of Sherry, not very sweet, but rather spicy. Almost reminds me of the Tawny Port.  Flavor also spicy, cloves, grapes, ... gradually the oak, a little vanilla. He may need some more time ...  Flavor also spicy, cloves, grapes, ... gradually the oak, a little vanilla. He may need some more time ...  The note is a bit more pleasant, but the taste dominates the carnation, which I do not like in whisky.  Overall, a good malt, especially for the price.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Andytka3",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "11 dec 2016 5:36 am",
            "content": "N- Sweet and frizzy white grape at first, follow by heavy clove and thick vanilla. Salted plum add to the pack. Firm and rich. P- Creamy liquid with sherried dry mouthfeel. Raisin, fig coated with brandy. Hints of alluring kippery. F- Smooth and long finish. Broad flavours with dried fruits soaked in brandy and chili spicy lingers.. — at The Whisky Bar, Kuala Lumpur.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "03 mar 2017 11:48 am",
            "content": "N: Definitely the younger of the pair focusing on vanilla sponge, walnut cake, sugar syrup and passion fruits. This could pass for a youngish grain, given the simple sugars [Port Dundas #9452 for example].T: Young-to-youthful with an indistinct tastiness, or a tasty indistinctness if you prefer - simple stuff yet really well made. Revisited: same again, this time a little more fruity, but then again it’s somewhat this-and-that.F: Taste that highly-engineered, fast-yielding, blow-dried, wood-driven finish - namely vanilla oak with a soft chew.C: Yeah, it's good, very tasty but uneventful. Glendronach’s policy to switch from bourbon to sherry in the late ’90's maybe showing yet i only tried this once and that was a few years back, scoring it in the low 80’s. I believe Glendronach have switched back to sherry casks exclusively of late. Whether there’s any bourbon cask influence here or not, there’s plenty of modern 'tech' which makes it flawless though it only scores a C-Full report HERE.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "MaltVader",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "13 mar 2022 6:32 pm",
            "content": "",
            "nose": "dark chocolate, dried fruit, some wood, honey, cherries in syrup",
            "taste": "sweet, creamy, chocolate, honey, quite dessert, a bit of vanilla, very delicately coffee",
            "finish": "short - medium, fast transient, a little chocolate and pepper"
        },
        {
            "user_name": "LiquidThoughts",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "09 apr 2017 12:19 pm",
            "content": "What a beautiful, round sherry standard with age, the best 12 Sherry OA",
            "nose": "Sherry with pear, ginger, clove, raisins, vanilla, toffee and light honey, nice, round nose for a beginner",
            "taste": "Full creamy, a lot of gentle sherry with light spice, cinnamon, some oak and vanilla, berry bushes, full juice orange, quite viscous later, super drinkable with almost no alcohol flavor in it, some ginger and nice chocolate / coffee powder very discreet",
            "finish": "Medium long, strong for the 46%, heat with spice of spices and nuts"
        },
        {
            "user_name": "Tom na Gruagaich",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "19 jan 2018 11:24 pm",
            "content": "A heavy, massive whisky with a strong spiciness, which is very idiosyncratic. The nose pretends to be a light candy, in the mouth it is then strong and you have to chew the whisky almost. However, the oak spice kills the aroma.",
            "nose": "mild honey, bright fruits, pear, malt, wood chips, sweet, spicy, nutmeg, cumin and some solvent in the background.",
            "taste": "strong, oak, black pepper, dark chocolate, dense and voluminous",
            "finish": "Bitterness, oak, malt, slightly astringent, some mint."
        },
        {
            "user_name": "Georges",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "22 aug 2014 4:29 pm",
            "content": "",
            "nose": "Vanilla, caramel, fruity (pears, oranges), toffee, nuts",
            "taste": "Soft, sweet, sherry, creamy, honey, oak",
            "finish": "Long, spicy, nuts"
        },
        {
            "user_name": "wisekyofcourse",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "11 dec 2017 12:55 pm",
            "content": "On the nose, it's oily, nuts, nuts, spices, a little cinnamon and red berries maderized, sign of sherry!  In the mouth, spices, dried fruits, sherry in the background, then a little cocoa, it becomes almost sweet, but also a little too spicy. Back woody.  In the final, on the same flavors with walnuts, a little dried humus, spice and dried fruit, wood again in bottom of glass!  A dram of entry to the biggest sherries, this one is rather soft, a little flat finally compared to his big brothers!",
            "nose": "a little dust, raisin, a little cooked peach too, spices and malt, wet wood.",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "LeChiffre",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "17 may 2019 8:16 pm",
            "content": "A beautiful malt with a clear sherry character and intense fruit sweetness. He is already complex for his age but somehow lacks that certain something. PLV good. I prefer the 18J and 21J.",
            "nose": "Sherry; fruity-sweet (fully ripe fruit, raisins, dark fruits); Vanilla; candied sugar; spices; something oak",
            "taste": "full and intense sweetness; Sherry clearly present; raisins; spices; as a harmonious counterpoise pleasant oak flavor; a touch of ginger",
            "finish": "slightly dry; Sherry; slight sweetness; very spicy; the oak comes through; fine tart aromas of coffee"
        },
        {
            "user_name": "Noface83",
            "user_rank": "Specialist",
            "rating": "82",
            "review_date": "16 jan 2018 9:32 am",
            "content": "Nose: dirty sherry, raisins, plums, a touch of old cellar, fluffy dough with vanilla, lemon, malty sweetness, light alcohol, white pepper  Taste: beautiful sherry sweetness with raisins and glucose, lots of vanilla, peppery spiciness and some anise, bitter old wood but also a bit metallic  Conclusion: quite classic whisky with sherry ripening which, despite a lot of wood, still shows youth, delicious and although slightly alcoholic very creamy and tasty, simple but not boring and makes you want more.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "pianoman",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "02 jul 2016 3:39 pm",
            "content": "",
            "nose": "Sherry, orange, apple. Warming.",
            "taste": "Orange mit Sherry. Nussbutter. Karamell.",
            "finish": ""
        },
        {
            "user_name": "Stanzeflasche",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "09 apr 2019 11:09 pm",
            "content": "The sherry hits you in the face, both fruity and very dry, somewhat spicy. Grapes, dried apricots, but also red fruits, raspberries, plums, greengage, papaya. Polished wood and cherry. Homemade bread, eucalyptus. Some honeyed highlights. A very light smoke. In the mouth, still so much fruit, still so much sherry, dark chocolate, hazelnut, strawberry, with a touch of blood. Very long finish, on caramel and earth, which draws on the wine. Charcoal shadow. Muscat grapes. Wet undergrowth. An absolute classic when it comes to finishing in sherry casks, at a very reasonable price. https://ilikesky2020.blogspot.com/2020/05/glendronach-12-yo-original-43-original.html",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "QuarterCentury",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "30 oct 2011 1:12 am",
            "content": "A dense, heavily-sherried dram from a distillery now producing again after a six-year layoff.  A malt best suited to after-dinner sipping.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "granella2003",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "04 feb 2013 6:56 pm",
            "content": "Refined in the best barrels Pedro Ximinez & Oloroso sherry. Unfiltered cold. Natural Color. eye, amber and reddish gold. Sweet on the nose, with hints of vanilla and hints of ginger. Are also recognizable sensations reminiscent of spiced wine and pear. palate Rich, creamy, smooth and warm. Evident sweetness given by the oak barrels and sherry. This whisky fills the mouth, giving hints reminiscent of raisins and dried fruit. Final Spicy, medium length with a dry finish.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "granella2003",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "16 oct 2012 11:41 pm",
            "content": "http://www.whisky-fox.de/glendronach-12-1l-p-1602.html",
            "nose": "Sweet, creamy, vanilla, hints of ginger, autumn fruits.",
            "taste": "Rich, creamy, silky-soft. Warm, much oak and sherry sweetness fills the mouth, raisins, soft fruits. Spicy with medium length and a dry finish.",
            "finish": "Long, full and firm, slightly nutty."
        },
        {
            "user_name": "granella2003",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "16 oct 2012 11:38 pm",
            "content": "http://www.drankgigant.nl/glendronach-12-year-1.html",
            "nose": "Sweet and creamy vanilla with hints of ginger, spices, wine and ripe pear.",
            "taste": "Creamy and silky texture with a rich, warm flavor of oak and sweet sherry. Full tones of raisins and soft fruits with hints of spice.",
            "finish": "A spicy and dry finish, medium length"
        },
        {
            "user_name": "DistiLesha",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "28 sep 2023 9:49 pm",
            "content": "Well-balanced, intense, spicy and deep aroma without any signs of beer notes, with a bright gingerbread accent. The taste is too playful and obviously betrays its youth. Blindly, I wouldn’t be able to clearly identify this as a sherry wine - more likely some kind of Virgin Oak. 22 21.5 20.5 20.5",
            "nose": "Very spicy, peppery and clovey. The wine itself is bright and distinctly malty. Just a little vanilla and cinnamon, a little more fruit. Intensity: 9/10",
            "taste": "Rougher, hotter and more unpredictable with an abundance of spicy notes and spices, and secondarily apple and pear notes. Cinnamon, vanilla, black pepper and the sweetness of the apple pulp are the dominant profile. Raisin and other sherry notes are less pronounced, but still noticeable. Sweetness: 6/10 Saturation: 9/10",
            "finish": "Spicy, hot, noticeably alcoholic, light rowan bitterness, spices and dry oak in the remainder at the end of the banquet."
        },
        {
            "user_name": "dongolzo81",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "15 dec 2019 9:47 pm",
            "content": "Blind tasting (2019 bottling)  Nose: time is good for him to develop, incredibly sweet, vanilla, mountain peach, overripe red apple cocktail cherry, later also spices  Mouth: sweetness, caramel, nougat, Nutella, fruit cake behind, mild, soft cake  Finish: sweet and spicy, medium length, residual sugar in the espresso cup,  Conclusion: I really like it, 88/100, PLV 100 points",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Marko_I",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "02 jan 2016 10:13 pm",
            "content": "Beautiful sherry beginner for a good price (~ 35 €), you can offer the inexperienced guest, but also the advanced connoisseurs not too poplig, in normal pub / restaurant on the map would be a reason to enjoy.",
            "nose": "sweet, dried fruit, malt, marmalade, some cherry, slightly spicy-spicy (roasted aromas, a hint of cinnamon / cloves?)",
            "taste": "sweet and creamy, milk chocolate, Nutella, wild honey, milk coffee, raisins",
            "finish": "medium long, dry, dark chocolate, coffee, some pepper"
        },
        {
            "user_name": "didi1893",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "05 feb 2018 9:11 am",
            "content": "Complex yet somehow one-sided, intense and full-bodied, dry, at first heavy and towards the end rather light, tart, harmonious, dark",
            "nose": "Blind tasting:  1. sweetness, fruit, chocolate, flower, nut; Caramel, honey, oils, herbs, dried fruits, sour  2. voluminous and fruity sweetness. velvety peach, ripe apricots, green apple, a hint of orange, sweet milk chocolate slowly growing tart, grassy, ​​cactus, subtle hazelnuts, dark caramel, forest honey, fresh, minty, ethereal, a hint of eucalyptus, meadow herbs, hints of dried fruit, sour note discreetly in the background",
            "taste": "1. Seasoning, malt, coffee, caramel, fruit, wood, sour, spicy, oily, cool, spicy, soft  2. powerful spiciness, burnt malt, freshly brewed coffee, dark caramel, dark and partly dried fruits, dry and dark wood, sour fruit flavors arise, rather a tart spiciness, becomes watery in the course of time, after a few moments creates subtle sharpness the tongue and between the lips  3. an old piece of wood rests in the mouth and exudes its old and creamy aroma",
            "finish": "1. Wood, nut, coffee, dried fruit, dry, bitter, dry  2. dry, spicy and old wood, dark and ripe walnuts, subtle bitter coffee, raisins in rum, pleasantly dry and partly discreetly bitter, dry, spicy and old pieces of wood  3. The old and ripe walnuts get wet and fall on the wet leaves lying on the forest floor, the old and dried wooden planks crack in the dimmed sunlight"
        },
        {
            "user_name": "ffmdino",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "22 jan 2019 3:35 pm",
            "content": "blind tasting  fresh at the beginning is bitter and woody towards the end  solid malt, challenging",
            "nose": "some malt (dark beer) will be more, sweetness, sherry, vanilla will be more, cereals, biscuits (bisquit), slightly peanut  later flowery, liquorice, light fruit (banana?), oak, floury apple",
            "taste": "full and round on the palate  tidy wood / oak (has been stored for a long time), bitter chocolate, tart, spicy,",
            "finish": "medium long  slightly oak, very bitter,"
        },
        {
            "user_name": "Issie",
            "user_rank": "Connoisseur",
            "rating": null,
            "review_date": "03 nov 2018 4:53 pm",
            "content": "",
            "nose": "Wow fruits without end. Strawberries, blackberries, apples, a little cinnamon, some earth, strong sweetness",
            "taste": "Continue sweetness and fruits, red and green apples, raspberries, blackberries, currants and also a pleasant spice",
            "finish": "Medium to long. The fruits with the spice are a great combination."
        },
        {
            "user_name": "tribe",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "13 mar 2023 8:10 am",
            "content": "So today 03/11/2023 we are making a battle bottle glendronach 12 years from 2013..2016 and 2022...the differences are big...the 22er smells like modern weak bourbon briefly dipped in sherry. Quite a little sherry in taste..not round with herbs...the 2016 has more sherry in the smell and taste..rounder and a bit cucumber...already a bit better..also a little mezzo mix with spices.slightly tingling.good. ...the 2013 still has sherry old school...just as you know it...really great and full.milk chocolate, cocoa, spices, cola, cinnamon and orange...plums and raisins, that's how it should be... In summary, 2013 is really the best, and 2016 is good, even if there are only a few,...but to be honest, 2022 is really nothing more...I dumped it in the barrel.... Billy Walker just didn't have any broken pieces there and bad barrels leave behind, or do the new managers have to learn first? Maybe that's why he left there. Hopefully a super distillery doesn't collapse. 2013 88p....2016 86p...2022 74p",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "tribe",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "11 jul 2021 9:43 pm",
            "content": "Nice tasty sherry annoying standard. Always works. I hope that the new bottlings will still be cold-filtered, although it shouldn't be on it anymore ... Who knows what will happen to dronach now",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "MrGlenfarclas",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "13 jan 2014 9:22 pm",
            "content": "Can´t really put it in words but there is something about this whisky that disturbs me. The best way to describe would be to say, that the sweetness and the sherry aromas appear a little too artificial to me. I think Glendronach wanted too much here. It is not as well balanced as most other GDs are.But apart from the 12yo I´m a big Glendronach Fan. I would prefer the 8yo Octarine over the 12yo.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Bishlouk",
            "user_rank": "Connoisseur",
            "rating": "76",
            "review_date": "28 jan 2015 10:18 pm",
            "content": "Sherry is not very present, I think. Out of there, this whisky is frankly not great, and looks like nothing 'genuine'. Very disappointing, and dispensable.",
            "nose": "Chemical caramel, wet malt, and pungent acidity.",
            "taste": "Aqueous impression, the mouth is soft. A bitterness of apple peel, and acid citrus fruits. Industrial honey.",
            "finish": "A little spicy kick, accompanied by bitterness, then nothing ... Arf ^^"
        },
        {
            "user_name": "Robinzon25",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "17 dec 2020 8:59 pm",
            "content": "Viscous, sweet, tasty, sherry whisky. For those who love it sweeter. Against the background of BenRiach 12 yo, Sherry Wood, it looks much more interesting.",
            "nose": "Sugary, berry, caramel, with an echo of cotton candy.",
            "taste": "Sweet, with hints of strawberry, strawberry, burnt sugar and spices.",
            "finish": "Medium duration, spicy, with a strong sherry influence, with notes of dried fruit, milk chocolate, pepper and hazelnuts."
        },
        {
            "user_name": "Albaron",
            "user_rank": "Specialist",
            "rating": "84",
            "review_date": "22 oct 2018 11:28 pm",
            "content": "fresh, slightly bitter, tart, oily, very harmonious. A light summer whisky, ex-bourbon matured, probably a bit older, over 12 years  Notes were made during a blind tasting",
            "nose": "overripe banana, grapes, sweet clover honey, sour oil, creamy vanilla, cereal flour, soft",
            "taste": "Tartar oil, milled baked grain (breadcrumbs), soft malt, vanilla, spice, grapes",
            "finish": "soft, slightly bitter malt, oily, tart spicy, light tannins"
        },
        {
            "user_name": "Lorion",
            "user_rank": "Connoisseur",
            "rating": "77",
            "review_date": "15 feb 2018 5:27 pm",
            "content": "Tasty and uncomplicated.  (Bottled 2016)",
            "nose": "Nice, nutty sherry nose. Sweet. Fruit. Some honey and oak.",
            "taste": "Warm, sweet, juicy. Oak comes through after a few moments.",
            "finish": "Medium long, fruity and sweet."
        },
        {
            "user_name": "drkrylov",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "14 dec 2012 1:12 pm",
            "content": "A very enjoyable whisky, but somewhat lacking in liveliness.",
            "nose": "Heather. Vanilla. Scented cream toffee. Lots of bourbon.",
            "taste": "Silky smooth. Clean, creamy. Shortbread.",
            "finish": "Crisp, with balancing nutty dryness from winey sherry notes."
        },
        {
            "user_name": "kikist",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "16 dec 2021 9:45 am",
            "content": "Not at level of it's formal glory! Actually just ok nothing more!!!",
            "nose": "nicely balanced, smooth, hints of gasoline, some meadow, new shoes",
            "taste": "meaty, dark, herbal, reminds me of blends, alcohol is there",
            "finish": "herbal, sherry, alcohol, raisin stays on the plate, long lasting"
        },
        {
            "user_name": "Tommyknocker",
            "user_rank": "Connoisseur",
            "rating": "88",
            "review_date": "08 nov 2018 8:22 pm",
            "content": "What an incredibly good, round, honey-sweet and sherry-intensive standard! Great work!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "robbert88",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "24 jul 2024 11:10 am",
            "content": "Bang for bucks whisky. If you asked me what whisky could you drink every day… This one would be on the list! It's not super complex. But not terribly simple either. It has power and yet it is smooth. There is some floral and some spicy. Actually he just ticks all the boxes.",
            "nose": "N: apple pie, some sour sherry, buttercup, nesquick powder, chocolate raisins, honey, plums, yellow fruit, malty, gently some warm leather,",
            "taste": "P: spicy, white pepper, wood, raisins, sweet influences of PX, warm macadamia nuts, young fruity wine like a Beaujolais, lemon curd,",
            "finish": "F: warming, medium long, white pepper, nuts, sherry, chocolate,"
        },
        {
            "user_name": "Kaltduscher",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "09 aug 2015 6:32 am",
            "content": "",
            "nose": "Sherry nose. Sour cherries. Red fruit jelly. Apples. Pears. Vanilla. Malt. Black pepper. In the background herbs.",
            "taste": "Lovely. Honey. Creamy. Pears. Cherries. Herbal notes. Apple Cake. Malt.",
            "finish": "Lovely. Honey. Creamy. Pears. Cherries. Herbal notes. Apple Cake. Malt."
        },
        {
            "user_name": "domani",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "24 feb 2016 10:49 pm",
            "content": "A good single malt that offers a lot in this price range - 08.02.2016",
            "nose": "Sherry, orange, sweet ripe fruits, plums, blackberries, raisins, vanilla",
            "taste": "Pleasantly sweet with the sherry barrel typical fruit flavors, pickled plums, beautiful spicy, slightly dry",
            "finish": "medium"
        },
        {
            "user_name": "Feusi",
            "user_rank": "Connoisseur",
            "rating": "75",
            "review_date": "19 jul 2011 7:37 am",
            "content": "Vanilla (Bourbon) and floers in the nose. Heather and other herbs with a bit sherry and sweet malt in the palate. The finish is very well balanced. Nice to drink also for beginners, malty sweetness, soft and pleasant, but with a rather short finish.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "EvilAFI",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "10 oct 2019 5:42 am",
            "content": "Great nose, body a bit thin and more menthol than I would like. My sample was from 2013 making this 17yr old.",
            "nose": "Sherry, red fruits (fig, dates, strawberry), nice baking spice, menthol, creamy",
            "taste": "Fruity and nicely integrated spice, strawberry, cherry lozenge, nice heat for 43%, a little thin.",
            "finish": "Medium, the heat leaves quickly but a small spice remains. It dries with a menthol sweetness that remains (Vick’s cherry lozenges)"
        },
        {
            "user_name": "Koning",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "15 apr 2014 10:41 am",
            "content": "A solid entry bottle of Glendronach. It's quite rich and complex for its age and strength. The dry / astringent side is a bit less to my liking.",
            "nose": "Sherry sweetness at the front, with berries, raisins and mocha coffee developing. It's quite malty as well, with an earthy background including some mushrooms. The lightest whiff of smoke rounds off this nice nose.",
            "taste": "It's rather full in the mouth. Fruits (raisins, redcurrants and oranges) combine with oak spice. The oak grows in intensity, adding some tannins too. A sour touch of wine vinegar and a tiny soapy hint appears after a while, yet the palate stands its ground.",
            "finish": "A soft and sweet fruitiness slowly yields to a dry spiciness."
        },
        {
            "user_name": "aw-home",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "17 sep 2023 3:42 pm",
            "content": "",
            "nose": "Sherry and ripe citrus fruits and bananas with chocolate, coffee and vanilla.",
            "taste": "Sherry fruits and banana with caramel, chocolate, coffee and oak notes.",
            "finish": "Long with chocolate, caramel, citrus and oak notes."
        },
        {
            "user_name": "ASWhisky",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "21 jan 2014 5:08 pm",
            "content": "Although I did not want it, I'm pleasantly surprised  if the 12er also holds no great secrets  he can keep up well with others of his age  and has a pleasant spice combined with fresh sweetness  a nice all day dram  for those who enjoy it",
            "nose": "At first terribly sweet> given time>  Berries, green apple, light peat, vanilla, light wood, time again>  As a last association, blackberries and vanilla pudding are left behind",
            "taste": "much better than the first smell expected  spontaneously I had the feeling to have a cool domino / DS on my tongue  Of course that was wrong  if you dissolve it again almost right  Orange, bright fruit like the jelly in the DS  Spices like the gingerbread  the sherry share like marzipan in the DS  Coffee, peat, tobacco like the dark chocolate in the DS",
            "finish": "short to medium  Initially a pleasant glow in the throat,> bitter,> peat, vanilla, dry grass from the herb meadow, dry finish"
        },
        {
            "user_name": "Dr.Nose",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "05 may 2018 5:15 pm",
            "content": "The nose is round and supple, features vanilla and fine sherrytones, but also slightly smoky. The taste is soft and sweet, such as vanilla and sherry, a small pepper and something smoky. In the medium pleasant aftertaste something pepper and light wood tones with the sweetness of vanilla.Notes from internet.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Vas",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "23 jun 2023 4:22 pm",
            "content": "In value for money one of the best choices. Good basic level",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "boy_genius_ck",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "01 may 2017 11:27 pm",
            "content": "briny, rich sherry, dark fruits, myqualm with this is that it fades quite fast and the underlying result is not asclean. some people compare this with the 18 allardice(ican see their point) but unlike the 18 that can nose for hours, has clean,elegant and complexity underneath. this one, after it fades is just another sherrieddram, good though but still rough. still, considering the price, i’dtake this over the new watered down macallansany day.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "bartekfm",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "05 mar 2019 8:04 pm",
            "content": "The best sherry twelve years old whisky available. Deeply showing a range of dried fruits, quite strong on the tongue and palate, lasting and sweet finish. Totally recommended, fresh whisky enthusiast might use it as a sherry-entry.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Goethe",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "07 feb 2015 7:44 pm",
            "content": "A younger relatively balanced Oloroso and Pedro Ximénez sherry influenced Highlander. Concerning price/performance ratio: 9/10",
            "nose": "Oloroso and Pedro Ximénez sherry balanced on the arrival. Honey, vanilla, rasins and prunes.",
            "taste": "Sweet and fruity oloroso sherry, red dried fruits, oak.",
            "finish": "Dark chocolate, spicy, leather, soaked scones way in the back."
        },
        {
            "user_name": "lachaineduwhisky",
            "user_rank": "Expert Senior",
            "rating": null,
            "review_date": "05 mar 2017 4:42 pm",
            "content": "The highlight of this whisky is its nose: quite rich in sherry, dried fruit, honey, chocolate, without the total volume is not insane either. On the palate, nice, but more classic, almost cliché of Speyside (we are yet in the Highlands, but not far!), With a nice complementarity between sweetness and spices. It would have been more interesting at 46%, I think.  Enthusiasm 3/5",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyBjorn83",
            "user_rank": "Expert Senior",
            "rating": "77",
            "review_date": "02 jun 2018 12:22 pm",
            "content": "23-12-2016",
            "nose": "toffee, nuts",
            "taste": "sherry, honey, oak",
            "finish": "soft with hits of oak, sherry"
        },
        {
            "user_name": "YD84",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "04 nov 2022 3:41 pm",
            "content": "(Bottling date 01/09/2020) Oily barley, milk chocolate, raisins, more dried fruits, figs, fruit cake, brown bread, earth, autumn leaves, vanilla. Very rich, even a 43%.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "KIMCHIBaby",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "21 may 2024 2:49 am",
            "content": "Very good entry level sherry whisky",
            "nose": "Raisin, yellow, floral, vanilla, banana",
            "taste": "Raisins, milk chocolate, tannin, red grapes",
            "finish": "Tannin, floral, honey"
        },
        {
            "user_name": "Martin1965",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "30 jan 2020 2:49 pm",
            "content": "",
            "nose": "Sweet sherry, cherries, a hint of pears, the vanilla only comes after a long smell",
            "taste": "Sherry, cherry, very spicy",
            "finish": "Long, strong, nutty  You should have tried it."
        },
        {
            "user_name": "Wolv",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "24 mar 2019 6:32 pm",
            "content": "",
            "nose": "raisins, figs, cassis, nuts, chocolate, nougat, toffee, vanilla, caramel, fruit cake, tangerines, marzipan, cinnamon, nutmeg",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "HunterRomario",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "24 may 2012 12:44 pm",
            "content": "",
            "nose": "Sweet scent with fruity acidity.",
            "taste": "Overall, bitter, but at the same time a certain amount of glamor. The special, but certainly not bad.",
            "finish": ""
        },
        {
            "user_name": "mihatozzz",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "24 jul 2024 9:59 am",
            "content": "The whisky we lost: bright sherry aroma with lots of dried fruit. We're talking about the 2012 bottling, now it's not even close.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "ZLako",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "22 jan 2022 7:02 pm",
            "content": "I wanted to buy a Macallan 12 year old but it was out of stock everywhere. So after watching a few videos and reading some reviews I ended up buying this magnificent bottle!",
            "nose": "Sweet, very very sweet, red berries, vanilla, black dried fruits, marmalade, herbs",
            "taste": "Sweet and creamy, very smooth, red berries, vanilla, a distant oakiness and at the end some bitterness",
            "finish": "medium-long, dry, dark chocolate, sweet"
        },
        {
            "user_name": "claymore84",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "27 feb 2020 3:45 pm",
            "content": "Tasted at \"THE CONNOISSEUR’S TOUR\" on 11-03-2019 at \"Glendronach Distillery\".",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "p4blo",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "28 sep 2014 2:58 pm",
            "content": "Glendronach is one of my fav distilleries, this core range expression is great value for money and a good everyday whisky.",
            "nose": "Just what I like from GD - cherries, raisins, chocolate, toffee and more cherries. Some spices kick in too - cinnamon, ginger and vanilla. Lovely.",
            "taste": "Sweet, filled with dark fruits and tons of oak. Spices are there too to contribute to the complexity.",
            "finish": "Medium length, dry, wood and spices take over. Cherries are there too, obviously, but rather in the background of what comes from the wood itself."
        },
        {
            "user_name": "Gloin",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "08 aug 2017 11:15 pm",
            "content": "The smell is very appealing and immediately arouses the need to drink. The acidity typical of Glendronach is not very pronounced.  In the mouth, the whisky looks a bit too shallow despite the pleasant taste. Nevertheless, it tastes good.  The finish pleases without enthusiasm.",
            "nose": "Soft and sweet, cereals, then cherries, delicate spiciness, sweet sherry, light sourness, earth, caramel",
            "taste": "The onset is a bit stronger than the smell would have expected, almonds, latte, some chocolate, in the meantime flashes again and again a slightly sourish fruit note, blackberries",
            "finish": "The finish now shows oak and sherry, drier than in the mouth and nose. A nice interplay between sweet and dry, medium long."
        },
        {
            "user_name": "Shane_IL",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "10 dec 2015 9:40 pm",
            "content": "Quite nice, felt a little unbalanced, still good quality.",
            "nose": "Stewed plums. Brandy. Brasil nuts. Mahogany. Light paprika. Nutmeg. Red fruits. Bit of floral with time.",
            "taste": "Dry wood. Raisins. Prunes. Macadamia. Burned pecans.",
            "finish": "Medium. Espresso. Bitter tannins. Bit of sweet figgy notes."
        },
        {
            "user_name": "wbarchive_104650",
            "user_rank": "Expert Senior",
            "rating": null,
            "review_date": "22 apr 2016 6:31 pm",
            "content": "yes .... beautiful twelve-year-old malt, not over-complex but offers more than many others at the age of twelve. Quite delicious",
            "nose": "Raisins and dark chocolate, orange and malt; very dark and sweet; Whole grain bread; a very sticky little gunpowder",
            "taste": "oily to us very sweet; the oak comes through; pleasant tingling, which gets stronger with time; Maple syrup and raisins again",
            "finish": "short, dark chocolate and again very sweet; Oak; on the palate, a more chocolaty taste is left behind"
        },
        {
            "user_name": "erwinnlim",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "31 mar 2020 12:34 am",
            "content": "A good entry level sherried dram and a perfect introduction to the Glendronach core range. Value (£35) : 8/10",
            "nose": "Sweet PX on the nose. Dried fruits and raisins along with some honey and vanilla.",
            "taste": "Pleasant mouthfeel, sweet on the palate with cinnamon and ginger as well. Some delicious milk chocolate turn into a drying oak spice",
            "finish": "More chocolate and oak spice here. Medium in length"
        },
        {
            "user_name": "Chemist",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "23 mar 2014 8:04 pm",
            "content": "Tasting video by Horst Lüning  http://www.youtube.com/watch?v=teMF7jS-kmg",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "riegerjonas",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "11 apr 2021 3:55 pm",
            "content": "2020-12-10",
            "nose": "dark fruits, light vanilla",
            "taste": "strong oak, notes of sherry",
            "finish": ""
        },
        {
            "user_name": "Magnus Hillman",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "20 jul 2014 6:19 pm",
            "content": "This is a great whisky, maybe the most affordable I have ever had. This is a typical house whisky, an everyday dram that is just as good as many of the more expensive whiskies.(Rating interval 85-88)",
            "nose": "Wonderful spiciness, nutmeg, cinnamon, cardamom, butterscotch, caramel, creme brûlée, fresh mocca and leather.",
            "taste": "full-bodied, honey coated raisins, dates, complex vanilla, vanillin and bitter vanilla tea, oak and a hint of pepper mint far back.",
            "finish": "Long, sweet and spicy. Sherry spices, christmas cake, allspice and bitter wood."
        },
        {
            "user_name": "Ikkakumon",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "11 jan 2013 1:27 pm",
            "content": "This basic Glendronach will make a digestif of choice.",
            "nose": "Oak, sherry, oak, vanilla, caramel, oranges.",
            "taste": "Sweetness, caramel, vanilla, sherry influence, oak, fruity notes (oranges, red fruits).",
            "finish": "Quite long and dry, with peppery notes."
        },
        {
            "user_name": "bl0wb4ck",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "06 apr 2024 2:20 am",
            "content": "One of the best Scotch standards ever.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "The_Osprey",
            "user_rank": "Expert Senior",
            "rating": "81",
            "review_date": "04 jul 2022 9:38 pm",
            "content": "Glendronach The Original Aged 12 Years, 43%. I wasn’t rating whisky when I went to the distillery and tasted this for the first time. 50ml miniature consumed May 2022. Bold golden yellow orange borderline. Aroma is manhood ...what? NO. Damn autocorrect. Mango and apricot (both dried), biscuit, ginger and apple tea. Musty oak. The tropical fruit is so dried out it’s become a little meaty. Trail mix. Body is lightly oily. Taste is salty up front, some peppermint comes through the salt, always stays fresh salty and minty, spirit-led and not so sherry cask influenced as some will have you believe (at least on the palate). Some chocolatey char starts to come through on the finish, some bitter oak, some chilli. Spiced linger. Not bad. I believe I had a similar impression of this last time. It’s fine and certainly not over-sherried, which is always a good thing in my book, but it’s as though the maturation casks haven’t taken the edge off the spirit despite the years. The aroma is very good but the palate doesn’t catch up. Good nevertheless. 3.4/81",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Petitcham",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "16 dec 2023 10:18 am",
            "content": "Light green fruit, citrus, slightly bitter texture and oily, malt, miscellaneous spice",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Ozzyosbourne007",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "29 jun 2024 5:46 pm",
            "content": "",
            "nose": "Caramel, nutty, chocolate, raisin, dusty, wood, hazelnut.Nutella, sour sherried notes… banana…",
            "taste": "Wood, nuts, oak, dried fruit, chocolate… light bitter…",
            "finish": "Chocolate, nuts, creamy, dried red fruits…Drying… light pepper notes…"
        },
        {
            "user_name": "malthead-sven",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "19 dec 2015 11:50 pm",
            "content": "great 12-year-old sherry whisky, the sweetness in the aroma stands out, with elegant design and good price",
            "nose": "supple sweetness, fruity sherry, honey, raisins, ripe, juicy pear, hazelnuts, a little vanilla",
            "taste": "mild spicy, tingling sweet, more sweet than dry",
            "finish": "very soft and flattering, slightly warming, medium long"
        },
        {
            "user_name": "ThS",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "26 feb 2014 8:47 pm",
            "content": "A pretty good whisky but not very exciting.  LF 11158",
            "nose": "Fruity Sherry, balanced on summer fruits (peach, apricot). Hot wax. Old wood. Hint of vanilla and flowers. Harmonious and pleasant.",
            "taste": "Medium body. Medium fat. A little dry. Lack a bit of scale and stuff. The woods dominate.",
            "finish": "On the fruity notes of sherry.  Suitable length.  Retro-olfaction on the old wood."
        },
        {
            "user_name": "martinbutterfly",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "20 sep 2020 9:47 pm",
            "content": "***  ????: gold-amber,  ????: warm, sweet sherry, fruit and chocolate, intense but without power, a little still feeling the young distillate. Although the sherry is very nice here, somewhere in the distance shows the bourbon atmosphere, but very gently,  ????: nice sherry, unfortunately \"watery\" but nice chocolate, sweet, light, although it is quite ok, it flattens out quite quickly,  ????: sweet and dry, not too long,  *  A sweet, almost acceptable sherrówka, if it had a bit more ABV it would be quite ok. Unfortunately, the lack of power hurts it a lot ...  *  ????: 3.5 / 10  ????: 83/100",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Crann feàrna",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "25 feb 2016 11:01 pm",
            "content": "Sherry bomb at 43% and 12yo. Wonderful stuff.  This is the standard expression! And with such quality it tempts to buy other Glendronachs. Buy now.",
            "nose": "w/o water - dark, conserved fruit. Sweet dough. Simmered pears.w/ water - lighter, sweet fruit. savoury herbs (sage).",
            "taste": "w/o water - sweet, spicy arrival. Covers the tongue. Sherry-wine and canned fruit development.w/ water - spicy arrival. Sweet fruit development.",
            "finish": "w/o water - lightly dry fruit finish, medium-long.w/ water - savoury, spicy, warm finsih. Long."
        },
        {
            "user_name": "aquataste",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "25 oct 2024 9:51 pm",
            "content": "Bottled 2019",
            "nose": "Dried red fruits and forest fruits, milk chocolate, honey, raisins, a bit of vanilla, a bit of dried plums, ripe orange, ripe apples, light notes of nut nougat, powdered cocoa, a tiny handful of dried herbs, forest moss, delicate notes of wood",
            "taste": "More fresh, green apples combined with a lot of wine notes, dried forest fruits, a handful of dried herbs, dried plums, a small pinch of cinnamon, slightly spicy, nutty, a bit citrusy and malty, milk chocolate, honey, vanilla, delicate oak notes",
            "finish": "Long, pleasantly nutty, slightly spicy, dark chocolate with sherry notes at the end"
        },
        {
            "user_name": "aquataste",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "31 oct 2022 8:27 pm",
            "content": "",
            "nose": "Strongly noticeable notes of sherry, dried plums, raisins, ripe apples, slightly citrus, vanilla, honey, milk chocolate, a pinch of dried herbs, a little nutty at the end",
            "taste": "Lots of sherry notes at the beginning, a pinch of cinnamon, dark chocolate, a handful of dried herbs, vanilla, orange peel, apple, spicy, a little bitterness of oak",
            "finish": "Long with notes of sherry, dried herbs, spicy, oak bitterness"
        },
        {
            "user_name": "uap304",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "20 jan 2022 5:18 am",
            "content": "Another sample from Drinks By The Dram. This is a baby sherry bomb, both immediately alluring and complex enough to maintain your interest. A wonderful invitation into the world of sherry maturation as well as the Glendronach core range. Highly recommended.",
            "nose": "My first thought is PX sherry, which is not to say overwhelming, but as in there is no question about what we’re dealing with here. Raisins, prunes, sloes, berries and dark fruits. Lovely oak, cedar, varnish, and leather overtones. Chocolate and vanilla coming in and out of focus. Not overly expressive, but it’s all in there and it’s lovely.",
            "taste": "An initial blast of sweet brown sugar and rich vanilla cream. Rich and oily body. Becoming more bitter, like dark chocolate, before transitioning to ripe fruits and hazelnut.",
            "finish": "The PX sherry returns as a soft reminder, bringing a dry and spicy oakiness to the pleasingly long finish. Latterly a spirity glow emerges and beckons you to lift the glass again."
        },
        {
            "user_name": "EinSpatzUnterVielen",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "10 aug 2017 7:49 pm",
            "content": "A solid beginner Sherrymalt, but not more. He has too little tension in my mouth.",
            "nose": "instant orange juice, orange marmalade, quince marmalade, honey, chocolate, red berries, pears, raisins",
            "taste": "Juicy oranges, jam, dark chocolate, quickly becoming espresso, a touch of cinnamon, ginger, white pepper, creamy - generally less tension, more pulpy aroma, not well accentuated; little sweet",
            "finish": "getting dry quickly, medium in length, warm and spicy"
        },
        {
            "user_name": "Opeth83",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "16 jan 2016 7:02 pm",
            "content": "2016 VERSION",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Peatyjohn",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "10 jan 2026 5:05 pm",
            "content": "Best part of this dram is the lovely nose, however it does follow through with a reasonable taste. Bitter off putting notes it’s a bit old school compared to all the new sherry cask products out there at the moment. To its credit the distillery character shines through without cask dominance.",
            "nose": "Sweet and fruity, rich dark fruits,tobacco, plums, slightly bitter oak tannins, cigar smoke, bitter chocolate.",
            "taste": "Rich fruity, raisins, classic sherry finish , bitter chocolate notes, plum fruits. Figs dates and cigars.",
            "finish": "Pepper and spice."
        },
        {
            "user_name": "vojt466",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "29 jan 2017 9:02 pm",
            "content": "*THUMBS UP*",
            "nose": "Hezká plná ovocně-sladká vůně - sherry, štrůdl, hrozinky, hnědý cukr, pomeranče přelité čokoládou, jemná skořice",
            "taste": "V základu suché, po chvilce lehce kyselkavé a příjemně kořenité - rozinky, citrusy, pomeranče, zelená jablka, kakao, karamel, čokoláda, skořice. Plná, krémová chuť s probleskujícím ovocem.",
            "finish": "V dozvuku rozinky, dřevitost, čokoláda, káva, kakao, opečený toast a opět jemné koření - středně dlouhý"
        },
        {
            "user_name": "KyleRiemen",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "26 nov 2022 7:13 pm",
            "content": "The whisky tastes incredibly good for the price, it is sometimes available for 30-35 euros. One of my standard whiskys. A slightly more expensive but almost equivalent alternative would be the Tamdhu 12. Edit: Unfortunately, the quality decreases with each new bottle, especially the difference between the first and second was immense. I still have two in stock, I hope Glen Dronach gets back to his old form. Edit 2: I opened a new (old) bottle, this one tastes like it used to. Now I'm sure the quality has gone down with new bottlings. The last of my bottles is a current one, I will report here.",
            "nose": "Relatively weak, mainly sherry, fruity, honey, peach, a hint of vanilla and lemon",
            "taste": "Again, mainly sherry, followed by vanilla, chocolate, dried fruit and lemon.",
            "finish": "Relatively long, but less pronounced, vanilla, nut and sherry."
        },
        {
            "user_name": "Nomorewh",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "14 feb 2024 7:58 am",
            "content": "A good entry whisky, wanna try once more",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Matthias80",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "31 may 2020 10:18 am",
            "content": "",
            "nose": "Sherry, green apple, little zest, cinnamon, orange",
            "taste": "spicy, caramel, orange, subtle sherry aromas, ripe apple mild and medium to slightly intense in body, absolutely flawless",
            "finish": "Caramel, cinnamon"
        },
        {
            "user_name": "dissonance",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "30 jun 2021 1:03 pm",
            "content": "RATING: 86pts – |83 – 86 (B) → Good| — Not a “must”, but a nice-to-have.",
            "nose": "The nose is sweet and beautifuly sherried with notes of brown sugar, milk chocolate, dark fruits and ripe melon.",
            "taste": "The taste is pleasant and silky with a profile of strawberry jam, dark fruits, chocolate and some delicious spices.",
            "finish": "The finish is medium lenght and feels very soft with notes of spicy oak, gentle milk chocolate and eucalyptus."
        },
        {
            "user_name": "Hobbit",
            "user_rank": "Expert Senior",
            "rating": null,
            "review_date": "05 apr 2016 8:51 pm",
            "content": "wonderfully sweet, tasty and fruity Sherrydram, without edges but good to drink, 46% would have done him good, anyway: absolute PLV cracker",
            "nose": "Sherry !, Sweet, dark fruit jam, blackberries, nuts, currants, oranges, sweet fruit compote with vanilla sauce, no alcohol, barely oak, sweetened and caramelized",
            "taste": "Oranges, light bitterness, latte, sweetness, sherry, getting drier, no alcohol noticeable, very mild, a bit weak,",
            "finish": "Medium long finish, with some coffee, little oak, milk chocolate, lasting sweetness and nuts"
        },
        {
            "user_name": "Louisvandermeer",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "02 oct 2024 10:08 pm",
            "content": "Just a good whisky for a normal price. Nice to enjoy, but nothing special.",
            "nose": "Immediately a clear scent of red fruit, soft raisins and chocolate. There is also a sweet scent of honey and caramel",
            "taste": "The taste is soft with an obvious sherry flavor. Think of raisins and figs, but also a clear bitter undertone of chocolate. There is a soft pepper in the background, which provides a nice depth.",
            "finish": "Short to medium long, that pepper is present again. In addition, a deeper bitter taste of chocolate and coffee emerges here"
        },
        {
            "user_name": "zinaf",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "26 may 2015 9:59 am",
            "content": "I think the most amazing thing about this whisky is the very dynamic finish. The nose gets an interesting twist with the water, but the bitter edge and more pepper tips over the balance of the palate.The notes are from LH30406 2014/05/13 14:17 bottle",
            "nose": "A bit prickly on the nose. Immediately sweet with prunes and raisins and dried figs. Also ripe cherries. Whiff of wood smoke. Sugar syrup. Just a hint of saw dust speaks of the oak.Water: cherry pie; With time - lovely cappuccino note; milk chocolate; the dried fruits are still there. Lovely.",
            "taste": "Sweet arrival, drying in the middle. Typical Christmas cake spices with a lovely dried fruit sweetness.Water - bitter oranges and more oak and pepper",
            "finish": "Sweet, dry fruits, nutmeg and clove, then bursts into fruit sweetness and goes into very balanced wood dryness. The sherry influence lingers on."
        },
        {
            "user_name": "AdelphosHume",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "01 may 2018 7:06 pm",
            "content": "I was pleasantly surprised by this one. Unlike some other younger, sherry-heavy whiskies I've tried, this one was easy to enjoy pretty quickly. The first glass took about 10-15 minutes after pouring to settle down, but every glass over the successive days thereafter was pretty much ready within a few minutes after pouring. I really enjoyed it, and I think it's a great example of a younger sherry-heavy whisky that shows solid maturation. For what it's worth, I recommend it!",
            "nose": "Rich red fruits (cherries and raspberries) and dried fruits (prunes, figs, papaya), candied orange peels, a touch of raisins and leather, brown sugar and soft toasted oak, sweet baking spices (coriander, powdered ginger, and cinnamon), and some dusty dry-herbal note (licorice and ginseng root).",
            "taste": "Toasted oak, butterscotch and malt, dried fruits (raisins and dates), red fruits (cherries and raspberries), cinnamon with a touch of brown sugar added, candied orange peel, and ginger and brown sugar black tea.",
            "finish": "Cocoa, bitter-sweet herbal (licorice and ginseng pastels), dark coffee, and orange peel and oak and sherry tannins."
        },
        {
            "user_name": "Thatch",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "13 mar 2022 12:36 pm",
            "content": "What can I say - I like him very much! On some days even more than the bigger 15-year-old brother. A great, fruity entry into the sherry whisky world, which is still very pleasant even after years. Wonderful vanilla, dark fruits and honey, simply harmonious from the nose to the finish. Is my absolute favorite among the whiskys up to 40€.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Corso_theRed",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "07 sep 2014 4:06 pm",
            "content": "Finally managed to try this. At this price point, it is well worth a visit by lovers of sherried whisky. Easy-drinking, as the palate is certainly the highlight here. Due to the gap in production, bottlings prior to 2014 are certainly much older than 12 years, so check your local stores.",
            "nose": "Initially sharp. The astringency does not come from the alcohol, but rather due to oak spice and sherry. Brighter, zestier fruits, compared to the older standard bottling. Not sweet at all. Lemon drops, bees wax, dry sherry. With some air and a drop of water prunes and figs are emerging.",
            "taste": "Full bodied oakiness and quite Christmas cakey. Still not as sweet as the Revival or the Parliament, yet typically Glendronach! Menthol, bitter chocolate, raisins.",
            "finish": "Medium-long. Pretty standard for a sherried Highlander. Moderately tannic and a little licorice coat the tongue for a minute or two."
        },
        {
            "user_name": "Mugis",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "07 mar 2025 6:05 pm",
            "content": "",
            "nose": "Sweet, soft, nuts, apricot, orange marmalade",
            "taste": "Sweet, creamy, orange, vanilla, slightly sparkling",
            "finish": "Mild, some oak, oranges, dry, light pepper."
        },
        {
            "user_name": "Gearmailteach",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "14 feb 2014 10:24 pm",
            "content": "Always great. Intense, hard, worth every penny. An excellent entry into Glendronach's core range.",
            "nose": "Dark sherry, high-ripe pear, behind it warm custard. In between, always ginger.",
            "taste": "Spiced wine, red berries, some oak and vanilla. Roasted coffee on the palate.",
            "finish": "Long and warm, lots of spice and dry sweetness."
        },
        {
            "user_name": "malthead-1984",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "16 jan 2018 5:07 pm",
            "content": "a full and round malt that is quite complex, soft and round, also brings some darker aromas but is not killed, the finish is then rather dry.",
            "nose": "Fruit, Honey, Dried Fruit, Wood / Wort, Earth ... Herbs, Ethereal,  first full fruits not completely dark, like mirabelles and grapes, later darkening, the slightly earthy woody spice is always present and is carried by the forest honey, sometimes more times less. In between a few vanilla and citrus flavors shine through like limes, behind are still a few herb notes",
            "taste": "fruity, spicy, sweetish, vanilla, astringent, quite full flavor that brings dark fruity spiciness from the barrel, but still sweet and creamy remains, a little custard was stirred somewhere.",
            "finish": "medium-long, spicy, bitter, dried fruits, herbs  The finish is then rather adstringend and characterized by the spice, but at the end everything is fruity and sweeter here."
        },
        {
            "user_name": "joho",
            "user_rank": "Expert Senior",
            "rating": null,
            "review_date": "25 jul 2015 7:07 pm",
            "content": "The 2013 version is actualy 18 years oldhttp://wordsofwhisky.com/glendronach-is-a-lot-older-than-the-label-says/",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Captain.Islay",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "23 feb 2017 8:31 pm",
            "content": "A good daily dram, even for beginners, has a lot to discover",
            "nose": "Creamy, sherry, vanilla, vanilla crisp, white chocolate, oak, coconut, fresh banana",
            "taste": "White pepper, moderately sweet, oak, buttery, vanilla",
            "finish": "Short-medium length, Spicy, Drying"
        },
        {
            "user_name": "Lord Octomore",
            "user_rank": "Specialist",
            "rating": "86",
            "review_date": "28 apr 2018 10:59 pm",
            "content": "Very sweet on the nose, fruity vanilla. Oaky, but sweetness dominates. Balanced upon arrival, taking a turn toward dry wood in the finish. Excellent value for money.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Collegiate",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "15 oct 2019 1:12 pm",
            "content": "Tasted in a series at a recent tasting night. Not a sherry bomb by any means, but some of the typical sherried notes are still there. Despite the NCF, pretty watered down and not too exciting. This is one case where you are much better off pursuing the 18yo, even if it costs significantly more.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "hartist",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "21 nov 2014 12:50 pm",
            "content": "A must for the price. But of course not all the complexity of top quality malts.  In fact a good start for anyone who wants to start progressing in the wonderful world of whisky.",
            "nose": "Nice mixture of malted and sherryed notes, hot pastries and orange jams.",
            "taste": "Rich and thick with honey, orange and yellow fruit jam, some chocolate and some exotic spices.",
            "finish": "Long and strong; we find all the components of the mouth."
        },
        {
            "user_name": "keizerjos",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "19 feb 2020 1:26 am",
            "content": "Usually, the WB valuation of entry whiskys is somewhat low - in my opinion, \"experience\" and snobbery play an important role. The Glendronach, however, gets what it deserves. Refined wood aromas, beautiful sherry sweet, an excellent whisky to get to know and to introduce people to uncomplicated, beautiful single malt. Come on, he could use a little more punch, 46 or 48 percent had more depth. There is a sulfur in the aftertaste that didn't necessarily have to be - but come on - three decades!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "D3US",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "01 dec 2012 10:17 am",
            "content": "The finish is shorter than hoped for, but this is a very decent whisky. Good price-quality.",
            "nose": "Orange fruit, chocolate, malt. Vanilla sweetness, caramel. Light oak notes. Fudge, raisins and dates.",
            "taste": "More tingly than the sweet nose would have predicted. Sweetness comes back soon, though, with chocolate and vanilla, nice fresh fruitiness. Dried orange.",
            "finish": "A slight bitter note prevents an overly sweet finish. Warming, with that orange fruit still hanging on. Good stuff."
        },
        {
            "user_name": "nijholtm",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "23 feb 2012 4:18 pm",
            "content": "",
            "nose": "walnuts, caramel, toffee and just a hint of orange.",
            "taste": "starting of soft with malt and vanilla. Leading to more complexity with red fruits and rose hip jam.",
            "finish": "vanilla and caramel fading slowly into a nice medium-long finish."
        },
        {
            "user_name": "Waternish",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "02 oct 2016 11:15 pm",
            "content": "Lovely selected sherry casks for a reasonable price.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Don Cassi",
            "user_rank": "Expert Senior",
            "rating": "78",
            "review_date": "08 jul 2021 12:15 pm",
            "content": "Quite sweet on the nose with honey and sherry fruits. In addition, green and yellow apples and a great note of vanilla. Fruity aroma, but nowhere near as complex as its older brothers. Slightly peppery in the mouth, further fruity and also a little bit spicy. Unfortunately also a little watery and out of round. The finish is typical Glendronach: fruity, spicy with fine, bitter aromas. At 12 years of age, however, it was still relatively short and mild. But you can already taste where it goes. Length: 4/10 Nice entry into the Glendronach range with the classic distillery character. Maybe a bit too simple compared to other 12 year olds. Grade: 2",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "11insomnium",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "01 mar 2017 11:51 am",
            "content": "Nosing: seasoning, oak, dark, ripe fruits, flowery heather, sweetness with sherry  Tasting: Spicy, sweet, full, fruity, sherry  With water: Milder, lighter",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "JohannesB",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "16 jun 2015 9:42 pm",
            "content": "I particularly like the fact that the impression of coffee from light milk coffee to espresso is built up and developed over the entire drinking experience.  A very nice introduction to the sherry world of GlenDronach and definitely miles more complex and intense than the Hielan.",
            "nose": "Sweet dried fruits, dates, figs, red grapes and sweet malt. Then strengthen orange marmalade and fine roasted aromas, like a light coffee with a dash of milk.  The oak of the European sherry barrels carries the flavors along with the welcome drink strength of 43%.",
            "taste": "Sweet, soft and creamy - the alcohol is well integrated and only brings some heat to the esophagus.  Honey, sherry fruits, milk chocolate, the orange marmalade now tends to apricot strawberry.  The oak is also there, the coffee is now made from stronger beans and served without milk.",
            "finish": "Surprisingly spicy and dry. Mixed nuts, espresso and distant raisins. Then some pepper and cream caramel. The sweetness wrestles with the spice and no impression wins the upper hand permanently."
        },
        {
            "user_name": "CellarToberi",
            "user_rank": "Expert Senior",
            "rating": "91",
            "review_date": "04 oct 2023 3:31 pm",
            "content": "Matured in Oloroso and Pedro Ximenez ex-sherry casks. Non-chill filtered. Not coloured. Thick slow slowly forming primary legs. Mid-size slow secondary legs. Trailing droplets.",
            "nose": "Sweet: vanilla, brown sugar, honey, confectionery. Fruity: dried fruit: raisin, plum, fig; fresh fruit: plum; citrus: ripe orange. Cereal: malt, hay. Winey: sherry. Floral: fragrant, heather. Feints: leather, tang, wax. Spicy: ginger, baking spices, liquorice. Oily: cream. Nutty: hazelnut, walnut. Rich. Full body: harmonious. Water turns up nutty notes.",
            "taste": "Sweet: caramel, brown sugar, chocolate, syrup. Fruity: dried fruit: raisin, prune, fig, date; stone fruit: plum, peach, cherry. Spicy: ginger, salted caramel, liquorice note, cake. Cereal: malt. Winey: sherry. Woody: oak. Nutty: walnut, hazelnut. Full body: smooth, mouthwatering. Rich: impactful. Water turns up fruity notes.",
            "finish": "Long. Sweet: confectionery. Fruity: dried fruit; stone fruit; fresh fruit. Spicy: ginger, Christmas cake. Nutty: walnut. Woody: oak. Winey: sherry. Cereal: hay. Rich: delicious. Full body: dry. Water turns up fruity notes."
        },
        {
            "user_name": "Jonkers",
            "user_rank": "Expert Senior",
            "rating": "82",
            "review_date": "03 dec 2012 4:45 pm",
            "content": "The promises made by the nose become fullfilled in the taste. Too bad the finish remains slightly behind.",
            "nose": "Wood (oak). Very malty and lots of vanill;a. Some pineapple and organge. Chocolate and hints of butterscotch and raisins.",
            "taste": "Delicious sweet from the chocolate and oranges. Fresh but also warming.",
            "finish": "Ornages. Also hints of vanilla and some fruit candies. Rather short and dry."
        },
        {
            "user_name": "Sanma",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "06 nov 2024 4:06 am",
            "content": "",
            "nose": "Raisin, chocolate, pepper, plum, floral",
            "taste": "Raisins, nuts, chocolate, prunes, multi",
            "finish": "Chocolate, nuts, spices, multi"
        },
        {
            "user_name": "Der_Schnappulierer",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "20 jul 2021 1:58 pm",
            "content": "Blind tasting The taste and finish are more beautiful than the smell. A great thing, mild but probably CS and a bit older. After the resolution, it must be said, a 12 year old Sherry standard that is second to none. Excellent price-performance ratio.",
            "nose": "Amber, sherry, thick and oily. Tobacco, nuts (walnut and almond), raisins, dates, even a little tropical (coconut)",
            "taste": "Light and mild, rum raisins, dates, coconut, papaya, physalis, very light tobacco. Class!",
            "finish": "Long! Oily, fruity and spicy. Top."
        },
        {
            "user_name": "Dalm",
            "user_rank": "Expert Senior",
            "rating": null,
            "review_date": "17 jan 2016 2:26 pm",
            "content": "Aroma: sweet, strong sherry, spices, oak, ginger, vanilla  Taste: Sherry, dark fruits, some oak  Finish: Medium long, weak, slightly bitter",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Moomin",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "29 feb 2024 1:32 pm",
            "content": "Too Spicy",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Hsh",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "14 mar 2022 7:16 am",
            "content": "The fragrant and soft fruity and nutty flavors like raisins and prunes are delicious. Red Bright and heavy It starts off heavy and ends sourly, which is really appealing ㅋㅋ The spiciness at the end seems to change, but then suddenly stops.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "KEngelaar",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "23 apr 2023 9:21 pm",
            "content": "One of the best 12-year-old whiskies I know and reasonably priced.",
            "nose": "Fruity with grapes, pears and plums. Fresh PX sherry and oloroso sherry notes. A hint of vanilla. A nice smell for the summer.",
            "taste": "Smooth with sweet fruits, a lot of sherry, coffee, chocolate, spices and oak. After letting it breathe in the glas, it opens up and reveals liquorice.",
            "finish": "Long-lasting with a lot of oak, dark chocolate, coffee and spices. This then turns towards old, but sweet sherry. Amazing, for a 12-year-old whisky."
        },
        {
            "user_name": "Rody024",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "22 feb 2021 4:07 pm",
            "content": "Awesome companion to a lovely cheese platter!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Paszko",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "30 oct 2017 10:49 pm",
            "content": "Very equal whisky (although the smell is the greatest advantage), sherry accents definitely in the foreground at every step. Favorite among sherry bombs in that price range below 200 PLN (especially that closer to 150). Definitely worth recommending for those looking for a good introduction into the intense flavors of red fruits.",
            "nose": "intense mix of sweetness - vanilla, honey, sherry and delicacies",
            "taste": "sherry in the foreground, ginger, oak barrel, even more roots, even more sweets - malt and plum jam",
            "finish": "long, sweetness gives way to dark chocolate, but at the same time it's creamy and smooth"
        },
        {
            "user_name": "Gweddry",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "23 jan 2021 12:10 pm",
            "content": "",
            "nose": "sherry, marzipan, dry wine, bourbon red apple and vanilla, yellow melon, then caramel, oak trace",
            "taste": "sherry, vanilla, toffee, sweet, milk chocolate, almonds, spices, wood, licorice, gooseberry",
            "finish": "long, very good, raisins, vanilla, almonds, sherry, red fruit, dry wine"
        },
        {
            "user_name": "Lebenswassertester",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "07 oct 2018 2:38 pm",
            "content": "",
            "nose": "delicate sherry notes, lots of vanilla, dried fruit and chocolate,  light cinnamon and cloves flavors",
            "taste": "beautiful composition of sweetness and acidity",
            "finish": "slightly dry, mid-length great sherry flavor"
        },
        {
            "user_name": "SimondeVette",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "13 jan 2021 12:37 am",
            "content": "An outstanding and balanced highland whisky",
            "nose": "Apricot, raisins, vanilla, sweet, winey",
            "taste": "Subtley spicy, sweet sherry, creamy, toffee, a bit of oak",
            "finish": "Spicy and soft"
        },
        {
            "user_name": "JG76",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "15 jul 2023 9:01 pm",
            "content": "",
            "nose": "Sherry, vanilla",
            "taste": "Sherry, hazelnut",
            "finish": "Sherry"
        },
        {
            "user_name": "Rockwell",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "02 nov 2023 1:02 pm",
            "content": "",
            "nose": "Relaxing sherry, dried grapes, and barrel wood.",
            "taste": "Dried fruit and sweetness.",
            "finish": ""
        },
        {
            "user_name": "RamiW",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "30 aug 2024 7:29 pm",
            "content": "Solid sherried dram. It’s nothing unique, but I mean that in a good way this time. Compared to an Aberlour 12 for instance, this is easier to drink while keeping the all good parts of the sherried profile. Happy to finish this bottle, solid 84.",
            "nose": "A very ‘clean’ sherried profile, with the usual notes. Raisins, dried figs, dates, Christmas cake, marmelade, cinnamon, cloves, some vanilla. Nothing unique pops out, but the balance is nice and it works.",
            "taste": "Sweet and not oily/viscous at all (so a nice way of saying the texture is watery). Christmas cake, quite some spice (cinnamon, cloves, allspice), fresh and dried red fruits (raisins, fresh plums), brownies, a bit of dark chocolate.",
            "finish": "Medium long and sweet, like after a bite of cake with fruit marmalade and chocolate frosting."
        },
        {
            "user_name": "Robert Parker",
            "user_rank": "Expert Junior",
            "rating": "84",
            "review_date": "30 jul 2015 12:11 am",
            "content": "",
            "nose": "Raisins, chocolate, ripe, cinnamon, Christmas spices, distinct sweetness",
            "taste": "Kako, raisins and dark fruits, tangerines + Christmas spices, caramel - vanilla - creamy",
            "finish": "medium and warm, pleasant"
        },
        {
            "user_name": "Lichtalb",
            "user_rank": "Expert Junior",
            "rating": "86",
            "review_date": "03 mar 2016 3:03 pm",
            "content": "Nose: At first a bit harsh due to the wood and sherry notes (allow the whisky in the glass to breathe a little and this impression is softened), pear, citrus fruits (orange), dry  Taste: full-bodied oak taste, beautiful sweetness, delicate bitter chocolate, raisins  Finish: medium in length, the tannins of the oak occupy the mouth for a long time, typical sherry whisky with dark fruit",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "ErrHaBe",
            "user_rank": "Expert Junior",
            "rating": "84",
            "review_date": "17 feb 2018 3:11 pm",
            "content": "A medium heavy spicy whisky, in which the dark notes dominate like dark fruits and wood, not too complex, but not boring either.",
            "nose": "Notes from a blind tasting:  Dark fruits in alcohol, pineapple, orange peel, cinnamon and clove, wet leather, malt sugar, forest honey, sherry keg. Spicy, warming, dark. Medium heavy, harmonic, not too complex nose, more barrel-heavy, dark notes dominate",
            "taste": "Honey sweetness, well integrated, tingling alcohol, caramelized malt sugar, pickled fruits, wet saddle leather, spicy and warm.  Oily mouthfeel, marked salivation, slightly astringent, but harmonious.",
            "finish": "Medium.  Moist cedar wood, pickled dark fruits, fine-sour chocolate, light alcohol, spicy, warm and medium heavy,  Harmonious, slightly barrely, oily, dark and slightly bitter."
        },
        {
            "user_name": "Francishomola",
            "user_rank": "Expert Junior",
            "rating": "85",
            "review_date": "05 oct 2021 2:39 am",
            "content": "Nice sweet and sour sherry, rich, nutty with a spicy kick with strong vanilla reminds me redbreast 12 unfortunately don't have a bottle now.",
            "nose": "dark flavours, sweet, some spices on the nose, vanilla",
            "taste": "sour dominant, spice kick, a bit watery, on second sip more of full velvety mouthfeel",
            "finish": "dry finish, tannic, short-medium finish, nice oak, nuts,"
        },
        {
            "user_name": "slavo",
            "user_rank": "Expert Junior",
            "rating": "84",
            "review_date": "24 jan 2023 7:46 pm",
            "content": "Creamy taste, a combination of apples, toffee and delicate vanilla with notes of sherry, dark fruit and dark chocolate. Lots of fruitiness.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "PeterCr",
            "user_rank": "Expert Junior",
            "rating": "84",
            "review_date": "30 dec 2016 8:15 pm",
            "content": "Very good dram for a 12yo and good value for money. Typical sherry notes in nose and taste. Lacks some complexity to score even higher.Score = 84pts",
            "nose": "Dried fruits (PX sherry comes through), sweet with some vanilla and spices as well. Little bit one-dimensional but still appealing. Chocolat with some hints of orange.",
            "taste": "Sweet, nice texture (creamy), dried fruits, cloves and some vanilla in the finish.",
            "finish": "Sweet finish with some raisin and caramel in the end. Some minor spicy notes but sweetness rules in the finish. Medium long and appealing. For a 12yo quite nice!"
        },
        {
            "user_name": "PeterCr",
            "user_rank": "Expert Junior",
            "rating": "84",
            "review_date": "04 feb 2016 7:22 pm",
            "content": "Nice balance between sweet and spicy. Medium complexity which is not too bad for this 12yo. Sherry is clearly there.Score = 84pts",
            "nose": "Medium impact on the nose. Fruity (lost of dried fruits, honey), some mild spices (nutmeg, pepper), wood.",
            "taste": "Full bodied (thick tears), smooth sweet (raisins some honey) attack followed by some spices (pepper, vanilla) and oak.",
            "finish": "Medium long. Ends medium dry with some sweetness (honey, caramel, even some liquorice)."
        },
        {
            "user_name": "harry",
            "user_rank": "Expert Junior",
            "rating": "73",
            "review_date": "24 jun 2009 11:07 pm",
            "content": "too much wood and furniture plosh to be convincing",
            "nose": "wood, chocolate, some furniture polish, later rotten fruits",
            "taste": "Sherry, dark chocolate, wood, intensive, some bitter notes",
            "finish": "Sherry, less wood, shorter"
        },
        {
            "user_name": "lukasz12",
            "user_rank": "Expert Junior",
            "rating": "83",
            "review_date": "13 apr 2025 6:26 pm",
            "content": "",
            "nose": "Sweet and sherry, apples and caramel",
            "taste": "Dark chocolate, raisins and apples, pepper, nuts",
            "finish": "Pretty short, alcohol, spices and oak, dark chocolate."
        },
        {
            "user_name": "Rom",
            "user_rank": "Expert Junior",
            "rating": null,
            "review_date": "18 apr 2015 6:47 pm",
            "content": "Nose powerfully sherry, dried fruits of all kinds. Mouth very sweet and vinous, nutty. Very easy to drink. Good.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskeyfanRoy",
            "user_rank": "Expert Junior",
            "rating": "87",
            "review_date": "28 dec 2021 8:44 am",
            "content": "In recent years, various distilleries have continued to release \"Sherry cask\" flavored whisky. But my personal standard for \"Sherry cask\", It's this bottle of Gelendronach 12yo. No way to convince me to buy those whiskies if they don't beat this 12 yo in the taste of \"Sherry Cask\". This bottle has a solid foundation and tells the world what a \"Sherry cask\" whisky should look like, I hope this persistence can be maintained forever. The total taste is 86 points, and the price adds 1 point, for a total of 87 points.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Emperor69",
            "user_rank": "Expert Junior",
            "rating": "85",
            "review_date": "04 jun 2022 1:24 pm",
            "content": "Glendronach 12 YO The Original Category: Single Malt Manufacturer and bottler: The Glendronach Distillery (Brown - Forman) Region: Highlands Fortress: 43% Volume: 700 ml Bottling date: 07/13/2021 Barrel type: Pedro Ximénez & Oloroso Sherry Casks Min. exposure: 12 years Filtration: none Dye: no Nose. Baked apples, pears, plums and Seville oranges, apricot pit, dried banana slices, cocktail cherry, chocolate Christmas cake with raisins, almonds, hazelnuts and a mixture of spices (cinnamon, cloves, ginger, nutmeg, star anise). For a 12 year old, very beautiful, powerful, memorable aromatics, as well as a good balance of sweetness and acidity from fruits and spiciness from spices. Taste. The sweetness of cane sugar at the beginning is replaced by a fleeting pepper, clove, ginger “wave”, which, in turn, already gives way to a richness of fruit overtones (baked pears, dried apples, plum and apricot jam, orange peel with cinnamon, brown raisins, figs) , vanilla cream and nuts. Dessert, but with an appropriate bitterness, silky, with a moderate density (I would still add 3% to the fortress), dryish, but in moderation, rich in various nuances and an extremely pleasant taste that can be enjoyed for a long time, finding new shades. Aftertaste. Dry. Medium duration. Raisins, dried apricots, ginger, apricot kernel, hazelnuts. Outcome. A very decent 12. One of the best representatives among non-peat \"Scots\" of mass production of this age. A real “sherry bomb”, which, despite its youthful years, already demonstrates the hefty potential of properly selected barrels. The richness of taste, aroma and aftertaste is guaranteed to you. Whisky, with which you can catch a buzz under any circumstances. Rating: 85 out of 100.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "wbarchive_875995",
            "user_rank": "Expert Junior",
            "rating": null,
            "review_date": "06 apr 2021 8:02 pm",
            "content": "Rich sweet brown sugar with milk chocolate, eucalyptus, ripe melon and strawberry jam. RATING: 86pts - [n22,t21,f21,b22] → |86-89: Remarkable|",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "KOQ24",
            "user_rank": "Expert Junior",
            "rating": "83",
            "review_date": "19 feb 2017 4:25 pm",
            "content": "Nose:-richly sweet, Spices,Oloroso Sherry,Caramel,Milk Chocolate,nutty,Toffee,Pears,Cinnamon,Oak,VanillaTaste:-nutty,Sherry,Milk Chocolate,Oak,Plums,Ginger,Caramel,Vanilla,Raisins,Mild bitternessFinish:-medium to long,with a strong Alcohol noteO:Very affordable and complex heavily-sherried Malt.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Scotch4ever",
            "user_rank": "Expert Junior",
            "rating": "82",
            "review_date": "12 apr 2013 7:01 pm",
            "content": "Nice drum for a fair price. Rich nose.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "snaotheus",
            "user_rank": "Expert Junior",
            "rating": "82",
            "review_date": "25 dec 2020 9:22 pm",
            "content": "",
            "nose": "Sherry, fruity, very light touch of smoke, maybe some wood.",
            "taste": "Spice, dark fruit, sherry,",
            "finish": "Light, bright fruit. Vanilla, nuts."
        },
        {
            "user_name": "hafssol",
            "user_rank": "Expert Junior",
            "rating": "75",
            "review_date": "02 mar 2021 4:20 pm",
            "content": "I had a very good approach with this one. Rich and fruity nose and quite sweet taste. While going deep into it, it revealed a bit flat, especially for the sweet sherry notes. Not bad at all, but you can find something better for a similar price.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Jabarkas",
            "user_rank": "Expert Junior",
            "rating": "70",
            "review_date": "03 jun 2020 8:25 pm",
            "content": "Very \"rum-like\" whisky. Reminds me of Malecon for example. Though you can taste the malt in it. Not my favourite though.",
            "nose": "slightly stinky, caramel",
            "taste": "Sweetnes, bitterness, caramel, raisins in rum. And either it is an echo of the oak, or I feel some very very distant peat.",
            "finish": "Woodiness from the cask. Bitterness comes with it."
        },
        {
            "user_name": "skratte",
            "user_rank": "Expert Junior",
            "rating": "82",
            "review_date": "14 feb 2016 9:23 pm",
            "content": "not very complex, easy drinking, not exciting but a good dram 4/5",
            "nose": "sharp, fruity spiciness, oak, leather, mocha, with hints vanilla and cocoa",
            "taste": "softer than expected, smooth sweet, sherry, oak, hints of berries, mocha, vanilla",
            "finish": "long, dry, lots of sherry, oak, pepper"
        },
        {
            "user_name": "Wal",
            "user_rank": "Expert Junior",
            "rating": "84",
            "review_date": "07 feb 2025 7:11 pm",
            "content": "-aroma: buckwheat honey, figs, dates, raisins 84 Taste: pleasant, sweetish, prunes, chocolate, raisins, nuts, youthful character is felt 84. Finish: light, chocolate, delicate spices, caramel, dried fruits, wood 83.5",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Benjamin_Wang",
            "user_rank": "Expert Junior",
            "rating": "84",
            "review_date": "11 sep 2020 5:05 am",
            "content": "2019 vintage. You can feel the youth ness off the 12yo, but it is balanced with some very fine oak. so the defects are covered by the flavour of the sherry. But you can still find the character of the distillery. Very good work!",
            "nose": "Not too strong, but fresh. Fruitness like apricot and plum. Some pineapple can water. A little acidity and alcoholic note. Very juicy, with apparent maltiness in the back, creamy vanilla also. The stewed fruits at the bottom of the cup. From time to time, oakiness shining through.",
            "taste": "Mid-sweet fruitness. In the middle, the maltiness and the creamy vanilla appear. The immatured menthol is well balanced by the maltiness. The body is oily and sticky. Then hazelnut appears. Some clove and cinnamon sharpness in the finish.",
            "finish": "Very dry oakiness coating my mouth, apricot sweetness, clove. Mid-long."
        },
        {
            "user_name": "Soysauce_Sommelier",
            "user_rank": "Expert Junior",
            "rating": "84",
            "review_date": "20 feb 2025 5:37 am",
            "content": "For those who enjoy deep and dark sherry flavors, this whisky makes for an excellent daily dram. While it's not a long-aged expression and has some hollow spots in the flavor profile, it still offers an enjoyable experience.",
            "nose": "Right after opening, there's a strong alcohol presence with a somewhat unrefined sherry nuance. The sherry influence feels deep but slightly underdeveloped, like it hasn’t fully matured. Notes of dried raisins, leather, and a barnyard-like mustiness (which adds an intriguing, almost mysterious character). Additional layers of dried blueberries, dried apricots, black pepper, and warm spices emerge.",
            "taste": "It starts with a touch of black pepper and spice, followed by an unpolished bitterness from the alcohol. The flavors soon transition into dried apricots and mixed berries, before evolving into a honeyed, caramel-like sweetness with hints of almonds.",
            "finish": "The finish is medium in length, beginning with berry-like notes before shifting towards a nutty character, where almonds and hazelnuts become dominant. The lingering nuttiness adds a toasty, satisfying conclusion."
        },
        {
            "user_name": "Ashita",
            "user_rank": "Expert Junior",
            "rating": "83",
            "review_date": "05 may 2022 12:06 pm",
            "content": "Very standard sherry barrel flavor, very cost-effective",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "gerardvw",
            "user_rank": "Member Senior",
            "rating": "85",
            "review_date": "16 jan 2019 10:12 am",
            "content": "",
            "nose": "Sherry, Nutty",
            "taste": "Sherry, sweat",
            "finish": ""
        },
        {
            "user_name": "McKen",
            "user_rank": "Member Senior",
            "rating": "83",
            "review_date": "18 nov 2017 10:30 pm",
            "content": "",
            "nose": "From the very start the sweetness is what hits you. A fruity sweetness, that is reminiscent of some sort of fruit liquor or fruit cake. With apricot as protagonist. This is followed by some Oloroso notes serving a vinous aroma. The nose ends sweet as well with hints of milk chocolate.",
            "taste": "The fruitiness hasn't gone far. Raisins, cranberries and orange zest set the tone for this dram. Some peppery and woody balance out the delicate floral taste of apricot blossom and coffee blossom.",
            "finish": "The finish os slightly grassy and woody, bringing to mind some ginseng and nutmeg"
        },
        {
            "user_name": "McKen",
            "user_rank": "Member Senior",
            "rating": "83",
            "review_date": "05 jan 2017 8:57 pm",
            "content": "85/100",
            "nose": "Sweet lord! From the very start I can smell some oranges and milk chocolate. Sweet but also fruity. Also a strong vanilla note reaches the surface. It brings back the memory of freshly baked hotel cake.",
            "taste": "Sweet again. Chocolate and vanilla comes to the mind immediately. Creamy and full mouth feel. Custard is present as well. In the back there is an oaky note from the Oloroso cask.",
            "finish": "Medium and dry finish. At the very end you get a nutty character."
        },
        {
            "user_name": "pwal",
            "user_rank": "Member Senior",
            "rating": "82",
            "review_date": "20 nov 2023 11:16 pm",
            "content": "",
            "nose": "Intense, caramel, candied orange peel, orange, chocolate, plums in chocolate, raisins, brown sugar, spicy, clove, gingerbread,",
            "taste": "Wood, slightly spicy, maybe a little sour, slightly bitter, citrus, grapefruit, a little ginger, orange or lemon peel,",
            "finish": "Medium, slightly warming,"
        },
        {
            "user_name": "jaydjo",
            "user_rank": "Member Senior",
            "rating": "82",
            "review_date": "26 jan 2023 5:45 pm",
            "content": "A good sherried whisky but I would expect better from Glendronach",
            "nose": "Rancio notes. Nutty, honey and coffee. Very rich nose as it also develops on stewed apples, gingerbread, fruit cake and almond milk chocolate.",
            "taste": "More limited than the nose.Tannic, dark chocolate, spicy, kind of oily on the first impression on the mouth. Then back on the fruits and slightly liquorice.",
            "finish": "Medium short. Fresh on the sherry and malty. I expected a longer and stronger finish on the sherry."
        },
        {
            "user_name": "whiskeyjedi",
            "user_rank": "Member Senior",
            "rating": "80",
            "review_date": "07 may 2015 8:48 am",
            "content": "Glendronach Original (12 year old)  Tasted 2015-04-30 @ RedRock Bremen:  Nosing: dark chocolate, warm winter fruits, clear sherry  Taste: full-bodied with a lot of fire, spicy, then sweet sweet red wine as a long finish  - good, 80",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "toksala",
            "user_rank": "Member Senior",
            "rating": "61",
            "review_date": "01 apr 2023 6:51 pm",
            "content": "Perus Single Malt.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Roelv",
            "user_rank": "Member Senior",
            "rating": "83",
            "review_date": "15 apr 2014 7:45 pm",
            "content": "Bang for your buck whisky. paid 29 euro for a 1L bottle.Not very complex but enjoyable",
            "nose": "Red berries, Chocolat, Hazelnut, vanilla, hint of sulfer",
            "taste": "sweet red berries, vanilla, Hazelnut, Milk chocolat, a bit creamy.",
            "finish": "medium long finish, again sweet red berries , ends in hazelnut and milk chocolat"
        }
    ]
}