{
    "info": {
        "ws_name": "Deanston 12-year-old",
        "ws_category": "Single Malt",
        "ws_distillery": "Deanston",
        "ws_age": 12,
        "ws_abv": 46.3,
        "ws_image": "https://static.whiskybase.com/storage/whiskies/9/8/349/435224-normal.png",
        "ws_rating": 84.19,
        "ws_vote_cnt": 1298,
        "original_url": "https://www.whiskybase.com/whiskies/whisky/98349/deanston-12-year-old"
    },
    "collected_count": 52,
    "reviews": [
        {
            "user_name": "Dris",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "27 dec 2023 2:42 pm",
            "content": "",
            "nose": "+",
            "taste": "+",
            "finish": "-"
        },
        {
            "user_name": "Slàinte Mhath",
            "user_rank": "Super Administrator",
            "rating": "84",
            "review_date": "14 jan 2024 1:43 pm",
            "content": "I am somewhat guilty of neglecting Deanston so far, and I am not even sure why. To me, it has always been the least interesting distillery in the Distell portfolio. On the nose, apple pie, honeydew melon and lemongrass mingle with malty and cereal-rich notes. Nothing sticks out, but it is quite pleasant. Spicy and drying flavors surprise on the palate before it mellows with juicy fruits, peppery oak and a touch of cider. A few drops of water help. Orange zest, honey and lingering spices migrate into the savory and floral finish. I am certainly not disappointed.RATING: 3.5/5.0 stars ≙ 84 pts → ABOVE AVERAGE",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "LukasJakubDrabek",
            "user_rank": "Shoplink Moderator",
            "rating": null,
            "review_date": "07 jan 2020 11:23 pm",
            "content": "Ralfy review 716: https://www.youtube.com/watch?v=cIFSZZ0SNfo (88/100).\"A classic example of an improving modern single malt whisky which is not encumbered with disingenuous fictional marketing...\"Ralfy review 807: https://www.youtube.com/watch?v=YPG1YN19bLk (89/100).Ralfy's whisky of the year 2020.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "ctu",
            "user_rank": "Connoisseur",
            "rating": "84",
            "review_date": "31 aug 2017 9:12 am",
            "content": "The 46.3% ABV works well. It's also simple but great in it's category.",
            "nose": "Oily. Nice bourbon vanilla, exotic fruits, banana, flowers, raisin.",
            "taste": "Fresh and powerful. Slightly sour oak, sweet fruits, bergamot oil, pepper.",
            "finish": "Medium length, bittersweet."
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "03 nov 2024 10:03 am",
            "content": "https://whiskylovingpianist.wordpress.com/2024/11/01/brighton-whisky-club-angels-share/C: Perhaps sweeter and certainly more sherried than I’ve found it in the past [WLP185 WLP286 WLP387 WLP483], I’m impressed once again. Must get myself another bottle, it’s been too long. It remains fairly priced too.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "02 aug 2023 5:16 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2023/08/02/bottle-polishing-a-summer-pair/Having previously enjoyed this permashelf bottling on a number of occasions [WLP185 WLP286 WLP387], another bottle was inevitable.N: In five words, wood, banana, cream > plantain > omelette. Of the woodiness, we are talking of a clean & clear/active first-fill bourbon influence, so confectionary vanilla is also a given. A Scotch for bourbon fans, perhaps? As this open bottle enters its second year, the egginess lifts, largely to be replaced by a far more pleasing maltiness – and a fusty maltiness at that. It’s at the heel of the bottle that things begin to sing. A touch of honeysuckle, rose apple, and the like, provide some bonus top notes.T: More than halfway down the bottle, unfortunately, this less than pleasing slightly eggy gacky/edgy/resinous bourbon-derived, [mahogany] woody profile persists. Compared to earlier releases, I ask myself – where’s the sweet banana, where’s the toffee, where are the nuances? Again, It took two years for this bottle to open up and chill out a little. Well into year two, we’ve a transition towards a sweeter maltier direction after a persistent active wood spice explosion. Though the citric woody spiciness endures, additional water will bring out a few of the nuances I was looking/hoping for.F: Gacky/filmy sour/bitter ex-bourbon wood for the large part. Things are far more desirable at the heel of the bottle, creamy if green maltiness the main improver, though overall, it remains immediate even lightly insipid.C: What a difference two years makes. I had this at a dislikable 80 for a fair while. Thankfully, a sour-to-sweet evolution in the bottle came through with the casks softening almost enough. A tad full-on – cask-wise – for my liking, but it’s a fine line. A very decent malt but other versions have been more to my liking.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "04 apr 2019 1:38 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2019/04/03/whiskylive-2019-day-1-part-2/After TBWC stand, I’d no specific plans. Brian Houston from Deanston catches my eye so I decide to refresh my memory of Deanston’s new-found excellence after a distillery visit there in 2017 [blog].C: The 18yo shares a similar pleasing profile to the 12yo with something lost & something gained – plenty gained actually. Both crackers! Both score 87 points",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "WhiskyLovingPianist",
            "user_rank": "Connoisseur",
            "rating": "85",
            "review_date": "01 aug 2017 3:38 pm",
            "content": "https://whiskylovingpianist.wordpress.com/2017/08/01/deanston-from-mill-to-distillery-part-2/N: Oily barley, cereal-fruits, dusty flour, a little clay, bitter-sweet oils and fruity biscuit notes – less banana more raisins. Solid & simple complexity.T: Oily barley again with a bitter oily/molasses edge. Nice & clean, [oily clean] bitter oily chew. Water brings to the fore more cereal sweetness and another touch of clay with that prevalent bitter molasses note – bitter-sweet all the way.F: Waxy-dry molasses.C: Bitter-sweet fruity oily barley spirit with raisins over bananas – what’s not to like? I’m amazed how faithful the spirit is to the airborne smells of the distillery. Big improvements over previous decades. During my three week distillery trip, this was the only bottle i bought directly.Scores a B-",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "18 apr 2025 4:48 pm",
            "content": "2020 Rating",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "90ClubWhisky",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "25 nov 2022 6:50 pm",
            "content": "Dark golden colour. Oily whisky.",
            "nose": "Delicate sweetness. Quite a specific aroma. A bit of honey. Maybe some malt. Delicate skin, but very delicate. Some vanilla and caramel. A pinch of spices. White pepper. Some wood. Quite a volatile aroma. Traces of fruit underneath. On the second nose, more sweetness and more vanilla.",
            "taste": "Light sweetness. Lots of caramel. Slight bitterness. Lots of wood. Some spices. White pepper. There is a slight oiliness. Honey the second time.",
            "finish": "Spices. White pepper. Sweetness. Vanilla. Caramel. A bit of oak. Long finish. The second time there were citruses at the beginning and then a lot of honey."
        },
        {
            "user_name": "Totoro",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "10 oct 2018 9:15 pm",
            "content": "On the same level as Ben Nevis 10, Springbank 10, Bunna 12, Craigellachie 13, or Clynelish 14, which is to say, a really fat and substantial, oily, and pungent spirit drawn from high-quality casks.Hard to beat in this price segment.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "ThorstenH",
            "user_rank": "Connoisseur",
            "rating": "73",
            "review_date": "29 mar 2025 5:38 pm",
            "content": "Tasted directly at the distillery. An appealing dram. 71-80 – Fine, like to drink by time",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Tom na Gruagaich",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "07 sep 2025 11:21 pm",
            "content": "A balanced but not boring standard with the best from the bourbon barrel. Definitely an above-average standard.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "wisekyofcourse",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "08 dec 2018 6:31 pm",
            "content": "2nd version with new bottling, still in ex bourbon casks.",
            "nose": "minerality! glue, a soft side too, caramel, vanilla, dry but strong wood",
            "taste": "spices very present, peppery, stronger vanilla, a pastry side, tenacious woody on dry wood, citrus fruits also now on orange, vanilla stands out, a little varied and mixed exotic fruits, the typical singular minerality.",
            "finish": "spices, citrus fruits, vanilla, a bit of rockery which make it typical, and this wood, this wood"
        },
        {
            "user_name": "LeChiffre",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "12 jun 2021 12:16 pm",
            "content": "Malty-fruity-sweet and vanilla - and thanks to the 12 years also a nice accompanying oak note - plus a great slightly oily mouthfeel. Considering the price-performance ratio, this is pretty good stuff. You can't get more whisky for the money, one of the best 12-year-olds I know.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Segens",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "03 nov 2023 7:12 pm",
            "content": "really fruity and delicious for below 40€ - absolutely stunner!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Calmar",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "07 nov 2022 9:22 am",
            "content": "Very, very good for the start of the line, dense, rich, everything is perfectly balanced, no inappropriate youthful shades, everything is smooth, coherent and polished, I would even put this whisky among the best initial releases along with Clinelish 14, Ben Nevis 10 and Springbank 10 .",
            "nose": "Open, damp, lots of wood, freshly sawn boards, wood dust, carpentry, vanilla, freshly cut grass, coated tablets, some minerality - stone dust, masonry mortar; light candy-caramel shades, cotton candy, flower-honey tones.",
            "taste": "Soft, enveloping, delicate woody tones, candy-caramel sweetness, vanilla, coated tablets, floral-honey tones, light astringency of young bark, candied tropical fruits, a little candied ginger, leather goods, tobacco.",
            "finish": "Light, spicy, refreshing, airy sweet-woody shades, honey-floral notes, vanilla, Dream-type caramel sweets, light and tart tablet-mineral motifs, lemon zest, green tea."
        },
        {
            "user_name": "DistiLesha",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "25 mar 2025 8:56 pm",
            "content": "A real competitor to Ben Nevis! Only much cheaper! Strictly speaking, it is hard to believe that there are no sherry casks in the blend. Another alternative to the heavy industrial fruity Scotch whiskies! 22 22 21 21",
            "nose": "Sulfur, yeast and industrial tones, vanilla, fruits, malt, raw bread. Difficulty of note breakdown: 8/10 Intensity: 7/10",
            "taste": "Sulfur, metal, fruits, vanilla, malt, beer with honey. Oily, waxy, alcoholic. Sweetness: 8/10 Saturation: 9/10",
            "finish": "Beer, wood, yeast, tart, sweet, alcoholic"
        },
        {
            "user_name": "maurisso",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "04 jul 2021 5:36 pm",
            "content": "A good malt. Simple but not trivial, with a low price.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "GJR",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "01 feb 2020 11:17 am",
            "content": "Tasted versus the Virgin Oak. This one is much more balanced and pleasent. Still lots of fruit and quite a long finish.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "_Dziki_",
            "user_rank": "Connoisseur",
            "rating": "83",
            "review_date": "24 dec 2022 6:14 pm",
            "content": "",
            "nose": "Pleasantly light, floral, banana, honey, vanilla, pudding, egg cream, creme catalana, volatile pleasant aroma.",
            "taste": "Fairly smooth, oaky, sweet, creamy, advocat, vanilla, frosting, cheese bun, no alcohol, white chocolate, and ice cream.",
            "finish": "Rather medium long, or even short, not very expressive, without heating, without spiciness, creamy."
        },
        {
            "user_name": "Thermidor",
            "user_rank": "Connoisseur",
            "rating": "82",
            "review_date": "15 may 2021 3:09 pm",
            "content": "Better and more distinct than Deanston 12yo was over 5 years ago when I last tried it.",
            "nose": "Bready at first. I get this whiff of some rustic hard crust white bread with a bit of butter on it, rapeseed oil, unripe pears, oatmeal, and riesling. Some faint echoes of farminess.",
            "taste": "A well chosen bottling strength that provides an unusually firm body for such a low cost bottle. Bready, malty, with a side of licorice. After the inviting nose and the nice mouthfeel, the actual taste is a bit of a letdown in its simplicity. A nice distillate, though.",
            "finish": "Too short, actually surprisingly short for a 46 % whisky."
        },
        {
            "user_name": "TKoolhaas",
            "user_rank": "Connoisseur",
            "rating": "78",
            "review_date": "28 may 2024 7:47 am",
            "content": "If the cardboard smell and taste were not present, it would probably be a lot better. Unfortunately, you cannot avoid this.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "larswehmeier",
            "user_rank": "Connoisseur",
            "rating": "81",
            "review_date": "27 nov 2018 10:54 am",
            "content": "Very good standard.",
            "nose": "Light vanilla. Some oak. Mild honey",
            "taste": "On the tongue surprisingly spicy. Pleasant chocolate.",
            "finish": "Mild, light finish"
        },
        {
            "user_name": "spigray",
            "user_rank": "Connoisseur",
            "rating": "87",
            "review_date": "04 jan 2022 6:11 pm",
            "content": "",
            "nose": "malt, figs, baked apple, new opened pack of filter cigarettes, white bread, beer, a bit of honey. Not quite sure if there is a bit of smoke.",
            "taste": "more caramel than on the nose, pastry, honey, dried figs. Rather mellow.",
            "finish": "Long, a bit salty, caramel, white bread"
        },
        {
            "user_name": "kikist",
            "user_rank": "Connoisseur",
            "rating": "80",
            "review_date": "11 jun 2023 11:36 pm",
            "content": "Good value for money, i get feeling it's quality degraded over last few years... but it's still okay for the price",
            "nose": "Grassy, floral, alcohol is there, hints of dark notes, light tea cookies, little bit of honey",
            "taste": "sweet, ligtly spicy, touch of juice, alcohol is there",
            "finish": "light coconut, oak, light vanilla"
        },
        {
            "user_name": "Jackson05",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "15 oct 2019 4:55 am",
            "content": "Coming off a Glengoyne 12/18 year old and in my opinion this is way better. More characterful. A nice viscous mouthfeel, minerality, soft herbal notes along with vanilla and stone fruits. One of the better young OBs I think. Reminded me of a softer Springbank 10 - a compliment!",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "dominikbraun",
            "user_rank": "Connoisseur",
            "rating": "86",
            "review_date": "07 jan 2021 6:44 pm",
            "content": "A balanced, honest and well-crafted Bourbon maturation. Could also be a 20-year-old from some independent bottlers - an absolute recommendation for ex-bourbon beginners.",
            "nose": "Dried fruits, lemonade, some oak, vanilla, pastries, wet wood and a little spice. Not overloaded, the barrel influence is very balanced.",
            "taste": "Oak seasoning, pepper, jam, overall creamy, caramel",
            "finish": "Milk chocolate, wood, vanilla, slightly dry."
        },
        {
            "user_name": "MaltyMillionaire",
            "user_rank": "Connoisseur",
            "rating": "76",
            "review_date": "29 nov 2017 2:15 am",
            "content": "Solid and dramble.",
            "nose": "Dusty, vanilla, banana, floral notes.",
            "taste": "Oily, sweet, and soft. Honey, floral notes, ripe pear, dusty.",
            "finish": "Long and sweet with mild spice, pear, and floral notes."
        },
        {
            "user_name": "YD84",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "08 oct 2020 4:42 pm",
            "content": "Floral, fruity, creamy. Waxy even. Sour apples, pineapple, pears, hint of lemon, honey, barley sugar, touch of vanilla, ginger. Water brings out some white chocolate but takes away some of the waxiness. This is lovely, and tastes way better than my last outing with it.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Whisky Hamster",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "04 sep 2021 9:11 pm",
            "content": "Indeed a very competently made entry level malt not (just) for whisky novices. Full-bodied, flavorsome, and imho def better distillate than what's in the - to me inferior - 18 nowadays. Looking forward to a potentially bright future if the don't f things up by selling the company to a bigwig and/or charging a fortune the time a new 18 or 21 yo hits the shelves. Fingers crossed. :-)",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "eselsim",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "09 may 2022 5:25 pm",
            "content": "Decent, malty, fragrant, new wood, dry, fruity good value for money",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "kawhi",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "12 feb 2025 8:34 pm",
            "content": "Great bourbon for the price",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "erwinnlim",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "26 jun 2020 6:04 pm",
            "content": "Value (£38) : 7/10",
            "nose": "Sweet vanilla and light honey up front. A touch of waxiness and some cereal malt notes. Bright citrus notes and candied orange peels. Some apricot and melon with cooked pears and bananas. Overall the bourbon influence is clearly present here with a heavy oak note. I wonder if there were some recharred barrels included as well.",
            "taste": "Creamy mouthfeel. Very obvious honey and vanilla notes with barley water. Slightly bitter orange peels balance this out well with a bright tangy lemon note. Cooked apples now. A touch of black pepper warmth and some drying wood tannins. At 12 years of age, I think some rather active casks were used here as the oak influence is quite pronounced.",
            "finish": "More of the same from the palate here. Slightly more black pepper spice but all the oak and honeyed citrus peels come through along with more vanillins."
        },
        {
            "user_name": "rich_93",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "16 may 2021 12:05 am",
            "content": "Brilliant value for money - enough complexity in this that you can come back to it again and again, finding something new. Thanks to the distillery who let the spirit shine!",
            "nose": "The spirit is well balanced with the oak.Soapy fresh lemon and hints of herbs (clary sage), cereal (porridge and pasta), lemon oat biscuits, oak, fresh cedar and pencil shavings, caramel, vanilla, spicy-green woody notes (fir needles and sap), hints of fruit (pear and underripe banana). Orange peel, bee pollen, ginger, pepper, blackcurrant cough drops.",
            "taste": "Sweet, then citrusy, followed by spicy-woody, finishes soft and fruity. Cereal throughout.Buttery/oily vanilla and soft oak, caramel, cereal, lemon, ginger, fir needles, cardamom, oak, banana, green pear.",
            "finish": ""
        },
        {
            "user_name": "SAND",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "17 apr 2020 12:03 am",
            "content": "(Bought march 2020. Bottle code 2018608 L516:5419226) Tasted 01.04.2020.APPEARANCE: Deep gold colour. Much darker than the Deanston 15 YO Organic. Quite viscous, noticeable long, slim legs on the side of the glass.NOSE: Dried fruits, mainly yellow; dried mango, dried banana. Waxy. Mineral notes, direction oils and metal, fresh engine oil. With time also some red dried fruits arrive. I think there must have been sherry or other wine casks in the mix here. A few drops of water opens it up a little more, emphasising the mineral aspect more. (88-89p)TASTE: The arrival is quite rich, red dried berry kind of fruity. On the mid palate there’s sweet barley juice (but darker than in the 15) and forest honey. With a few drops of water it becomes sweeter and full of sweet barley juice. (86-88p)FINISH: On the exit there’s barely juice with quite a bit of black pepper.... With a few drops of water it becomes sweeter. (86-87p)OVERALL: TOTAL SCORE 87 points.",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "SAND",
            "user_rank": "Expert Senior",
            "rating": "87",
            "review_date": "10 jun 2019 12:36 am",
            "content": "(Tasted 01.03.2019)NOSE: Already straight out of the bottle, this smells nicely of serious whisky with an initial nose of malt, minerals, iodine and light smoke. Like a cousin of Springbank. After some minutes the smoke disappears while iodine and malt takes over. It is a sweet biscuity maltiness. Then there are lemons. And the light smoke returns. Then more sweet maltiness. Engine oil and engine room. With a few drops of water: more lemon and malt. (89p)Initial TASTE: The arrival is slightly oily, then ginger, black pepper and salt.BODY: The oiliness enriches the body of this malt, which is quite sweet and rounded on the mid palate. Not very complex but really moreish and characterful. A little water doesn’t change much. (87p)FINISH: Black pepper, ginger, lemon (86p)= Weighted Rate 88 points",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "Eilean a' Cheo",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "04 nov 2017 6:55 am",
            "content": "Tasted blindN:  sherry notes plus a hint of smoke, some leather and coffee, woody as well, floral and with some salinityM: mineral, sherry sweetness, no sulphur, quite thick, salt and spices, a bit dirtyF: satisfying with salt and sherry sweetnessSomething between campbeltown and highlandsIt feels 48+/- 2% vol. and 12-14 years oldI quite liked it86",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "riegerjonas",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "03 jun 2021 6:30 pm",
            "content": "2021-06-03",
            "nose": "Wax, honey, smells of a slight sherry influence, although probably none in it, not very spicy, fruity, pineapple, apple, maybe also pear and cookies",
            "taste": "fruity, spicy, gooseberry, pineapple, fresh, slightly bread-like",
            "finish": "medium length, somewhat spicy, chocolate"
        },
        {
            "user_name": "Lukas_Kiene",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "22 jun 2021 10:01 pm",
            "content": "Honest, tasty, refreshing. Simple and good. Or is it more 'simply good'?",
            "nose": "Pleasantly spicy with a delicate herbal note. After a few moments, fresh citrus notes follow, slightly wet, almost a little musty wood, milk chocolate and slightly musty fruit notes. Becomes a little more tropical over time, goes towards pineapple and mango. Vanilla ice cream is also added. At first I was a little disappointed, but time and affection reveal great and quite distinct fruit notes. Sometimes maybe a tad too light-footed. Still really beautiful and even summery and refreshing.",
            "taste": "Delicious. Wonderful light fruity notes, very delicately spicy, here the lemonade that I really appreciate comes through quite well. Light wood, delicate tropical fruits, tangy citrus notes. With the second sip, the herbal notes are pushed into the foreground, the lemon turns into a sweet, juicy orange.",
            "finish": "Pleasantly dry, very slight tendency towards bitterness. It might be a bit flat, but it doesn't matter. A slight tart herb and wood note remains along with a hint of bitter lemon peel."
        },
        {
            "user_name": "Jakub_P",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "23 aug 2019 12:14 am",
            "content": "Deanston does a great job. I drank with great pleasure, I will definitely buy another one.",
            "nose": "light, grass, cereals, plum cake, peaches in syrup, bun, caramel",
            "taste": "light sweetness, pear, raisins, caramel, oak, peanut butter, root notes",
            "finish": "medium long, tea, dried fruit"
        },
        {
            "user_name": "Feorag86",
            "user_rank": "Expert Senior",
            "rating": "84",
            "review_date": "20 jan 2024 7:35 pm",
            "content": "",
            "nose": "Unfiltered apple juice, lemongrass, granola and cheese cake",
            "taste": "White pepper, lemon zest, cinnamon stick and honeydew melon",
            "finish": "Rosehip tea, pecan and almonds"
        },
        {
            "user_name": "aquataste",
            "user_rank": "Expert Senior",
            "rating": "83",
            "review_date": "08 jul 2024 9:40 pm",
            "content": "",
            "nose": "Fresh, lots of sour green apples, vanilla pudding, heather honey, slightly floral and grassy, freshly cut wood, notes of forest floor, sawdust, minimal citrus, a tiny pinch of cinnamon, notes of nuts in the background",
            "taste": "Fresh, sour green apples, floral and slightly grassy, vanilla, heather honey, delicate bitterness of freshly cut oak, a pinch of cinnamon and spices, slightly nutty, dark chocolate, notes of forest floor and earth",
            "finish": "Medium length, delicate bitterness of freshly cut oak combined with sour green apples, earthy notes, a pinch of cinnamon and spices"
        },
        {
            "user_name": "uap304",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "09 apr 2025 10:59 pm",
            "content": "Like so many malts, better on the nose than the palate. Unlike so many other malts, it is quite characterful. Unfortunately I didn't often find myself reaching for that character. Water brings out a dirty/funkiness/mustiness. Will certainly buy another bottle, but might be a while.",
            "nose": "Automatic, floral, mineral, citrus rind, vanilla, sweet like honey.",
            "taste": "Initially quite delicious. Sweet, creamy, toffee, and custard. With time, becoming sharp and spicy. Best not to linger in the glass.",
            "finish": "Sweet and sharp/tart citrus, sour barley, becomes more sharp and bitter, somewhat numbing."
        },
        {
            "user_name": "Peatyjohn",
            "user_rank": "Expert Senior",
            "rating": "88",
            "review_date": "04 oct 2025 6:57 pm",
            "content": "Best of bourbon influence. Sweet honey, caramel, chocolate light cereal notes. Very nice",
            "nose": "",
            "taste": "",
            "finish": ""
        },
        {
            "user_name": "anter",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "02 apr 2025 2:04 am",
            "content": "This is a really impressive bottle for the price, simple but effective, not easily boring, both fresh and full of sweetness. The aromas really go hand in hand, an impressive harmony. An original herbal background structure reveals a beautiful and unique character. Budget friendly, whisky lover friendly, what more could you want! Price performance: Good-Very good Would I buy it again?: Yes!",
            "nose": "A nutty, dry woody side. Lots of honey coated cracker. A slightly waxy side but very light; beeswax. Floral and slightly grassy. Very light orange peel maybe. Lemon peel that becomes obvious over time. Nuts go beyond walnuts but they can't be distinguished exactly. Maybe hazelnut and almond. Grassy and floral combined, it reminds me of a yellow flower whose buds are consumed and whose exact name is unknown. Vanilla. Craterdi maltiness opens. Heather. Maybe green apple. Light caramel croquant. A very harmonic, homogeneous and characterful nose!",
            "taste": "On the palate, zero bitterness, very low pungency. A little below medium sweetness. Intense green apple and super honey cracker. A light creamy, creamy note complements these two notes wonderfully. Vanilla with light spices, oak spice. A nice medium body that can be said. It has a soft consistency; really easy to drink. A light waxy note here, hand in hand with the green apple. A few notes of light herbal thyme and a subtle grassiness. A really quality palate. Like a super apple and honey cookie. Very enjoyable.",
            "finish": "A small crescendo is felt. Slowly opening cracker-like, crunchy notes give way to vanilla. Green apples continue to exist with a slightly acidic structure. At the end of the finish, light grey black pepper and oak spice and maybe a very, very light cinnamon stick. Especially retronasally, apples and light acetone. Medium length and intensity. No defects; zero bitterness and burning."
        },
        {
            "user_name": "KyleRiemen",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "06 jan 2023 9:27 pm",
            "content": "Tried this Deanston again at a whisky tasting, and fortunately it hasn't gone down any alley; a very nice whisky!",
            "nose": "Floral aroma with plenty of vanilla (custard) and honey, hinting at crème brûlée, orange peel, plum, yellow apple, mint, and leather, with light rubbery notes. If left for a while, a hint of white pepper emerges.",
            "taste": "Strong spicy-malty aroma, creamy mouthfeel, again with lots of vanilla and a little lemon, caramel and oak, round taste, the pepperiness is a bit disturbing.",
            "finish": "Medium-long finish, relatively weak, but spicy and pleasant with lots of vanilla, leather (and that rubber again), you get the feeling there's a bit of sherry in there."
        },
        {
            "user_name": "dissonance",
            "user_rank": "Expert Senior",
            "rating": "85",
            "review_date": "06 jul 2021 12:31 pm",
            "content": "RATING: 85pts – |83 – 86 (B) → Good| — Not a “must”, but a nice-to-have.",
            "nose": "The nose is very pleasant and malty with strong influence of sweet baked apples followed by raisins and white grapes.",
            "taste": "The nose is pretty sweet, well rounded and oily with notes of citrus fruits, fruit marmalade and spicy candies.",
            "finish": "The finish has a profile of spicy oak and caramel followed by cardamom, ripe bananas and yellow pears."
        },
        {
            "user_name": "Louisvandermeer",
            "user_rank": "Expert Senior",
            "rating": "86",
            "review_date": "02 oct 2024 8:25 pm",
            "content": "I only had a sample, but I will definitely get a bottle of this. Price-quality ratio is very good!",
            "nose": "Immediately wonderfully soft and sweet. You immediately smell green apples, lime grass and vanilla. In addition, there are scents such as banana and caramel. Soft and inviting.",
            "taste": "Fresh and reasonably strong taste. You immediately taste different types of fruit, a the bitter taste of wood that is combined with a soft taste of lime. Here too, sweet flavors such as honey and vanilla are present, but these are soft and mainly in the background. In addition, there is a very gentle pepper in the background which provides a nice variation",
            "finish": "Medium long, here the pepper comes out more but still very soft. In addition, there is a good bitterness of oak that is softened by wild honey"
        },
        {
            "user_name": "Mugis",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "22 jan 2025 9:10 pm",
            "content": "",
            "nose": "Brioche, salted caramel",
            "taste": "Sour, tropical fruits, thick, a bit musty.",
            "finish": "Soft, oak, unripe fruit and at the very end the musty note again."
        },
        {
            "user_name": "smolar231",
            "user_rank": "Expert Senior",
            "rating": "80",
            "review_date": "31 aug 2023 10:00 pm",
            "content": "",
            "nose": "sweet, vanilla, slightly alcoholic",
            "taste": "warming, vanilla, slightly alcoholic, slightly herbal, pepper",
            "finish": "quite short, sweet, vanilla, warming"
        },
        {
            "user_name": "oppi",
            "user_rank": "Expert Senior",
            "rating": "73",
            "review_date": "05 mar 2018 12:31 pm",
            "content": "Honey sweet and citrus fruits",
            "nose": "",
            "taste": "",
            "finish": ""
        }
    ]
}